{"0": "Has Ancient Japan been scientifically tested?", "1": "Would there be peace in the Middle East if Islam was destroyed once and for all?", "2": "If I live in the UK and am importing products from China to the USA to be sold through Amazon FBA, who pays for customs taxes? Do I always pay customs taxes regardless of the size/price of the product being imported?", "3": "Has Ancient Japan been scientifically tested?", "4": "Can I install two AC's of 1.5 ton each with a single phase supply of 230 V, 50 HZ?", "5": "Are Maoists and Naxalites in India are fighting to overthrow the state or to survive (to live in their own land till death)?", "6": "Has Ancient Japan been scientifically tested?", "7": "Can I become a multi millionaire on Amazon or is it too saturated?", "8": "How much milk do you put on cereal?", "9": "Has Ancient Japan been scientifically tested?", "10": "Is the sequence defined by [math]s_n= \\left( \\frac{-1}{5} \\right)^n[/math] a cauchy sequence?", "11": "Has Ancient Japan been scientifically tested?", "12": "I am expecting a score of 32.7 in XAT 2017, what are my chances for XLRI-HRM?", "13": "Has Ancient Japan been scientifically tested?", "14": "Has Ancient Japan been scientifically tested?", "15": "Is Quora biased towards the Democratic Party?", "16": "Should big companies donate more to charities?", "17": "Does love happen only once in a lifetime?", "18": "Has Ancient Japan been scientifically tested?", "19": "Has Ancient Japan been scientifically tested?", "20": "Is it possible to set ring tone in Motorola E3 power?", "21": "Can a sociopath fall in love?", "22": "Has Ancient Japan been scientifically tested?", "23": "Can you buy youtube subscriber?", "24": "Is it illegal to link to a web page where a copyrighted image appears?", "25": "Does a long distance relationship really work?", "26": "Are cats better guard dogs than dogs?", "27": "Has Ancient Japan been scientifically tested?", "28": "I got 96% in my board exam and 210 in the JEE Mains. I have Karnataka state quota. Can I get NITK, CSE or ECE?", "29": "Could Jesus have been crucified without Judas Iscariot?", "30": "Has Ancient Japan been scientifically tested?", "31": "Is homosexuality a choice?", "32": "Has Ancient Japan been scientifically tested?", "33": "Can you buy alcohol free spirits such as whiskey? How are they made?", "34": "Did India really gain Independence?", "35": "Has Ancient Japan been scientifically tested?", "36": "Can someone be lactose intolerant but still have lactose?", "37": "I Reserved 3 tickets in kochuveli express 16315 on 8 April 2016. PNR Status is RAC 68,69,70.Will it get confirmed by 8 April?", "38": "Has Ancient Japan been scientifically tested?", "39": "Has Ancient Japan been scientifically tested?", "40": "Can you be spiritually enlightened, then lose it?", "41": "Has Ancient Japan been scientifically tested?", "42": "Has Ancient Japan been scientifically tested?", "43": "Has Ancient Japan been scientifically tested?", "44": "Is the \"Planet Hillary\" cover of the New York Times Magazine an effort to show that they're not biased in her favor, given recent accusations that they are?", "45": "Are Hindi and Urdu essentially same languages?", "46": "Can the us be invaded?", "47": "Does the Porsche 911 have a comfortable ride?", "48": "Has Ancient Japan been scientifically tested?", "49": "If we left earth, would Thailand and other nations collaborate to try to send a royal white elephant to space?", "50": "Can we request access to the new Facebook News Feed?", "51": "Were the standards for judging who is famous before better than they are now?", "52": "Has Ancient Japan been scientifically tested?", "53": "Does \"Splice\" have a sequel? Will it have one?", "54": "Has Ancient Japan been scientifically tested?", "55": "Has Ancient Japan been scientifically tested?", "56": "Has Ancient Japan been scientifically tested?", "57": "Has Ancient Japan been scientifically tested?", "58": "Has Ancient Japan been scientifically tested?", "59": "Has Ancient Japan been scientifically tested?", "60": "Should there be a White Collar movie?", "61": "Has Ancient Japan been scientifically tested?", "62": "Has Ancient Japan been scientifically tested?", "63": "Has Ancient Japan been scientifically tested?", "64": "Should I get back together with my ex?", "65": "Would David Duke make the perfect Vice President for Donald Trump...?", "66": "Has Ancient Japan been scientifically tested?", "67": "Has Ancient Japan been scientifically tested?", "68": "Audiophiles: Does the audio cable make a difference in terms of sound quality?", "69": "Has Ancient Japan been scientifically tested?", "70": "Do you feel that language directed towards more ancient faiths can sometimes paint them as more simplistic or strange than they truly are?", "71": "Naive, confused but curious ^^: If light already travels at the speed of light, wouldn't that mean that all the light we see should bend time/space? In other words, is light ever now (and here)?", "72": "Has Ancient Japan been scientifically tested?", "73": "Should IPL be banned in INDIA after seeing all this fixing?", "74": "Has Ancient Japan been scientifically tested?", "75": "Are Google URL shorteners banned on Facebook?", "76": "Does black magic exist in this world? Is there any scientific evidence for it?", "77": "Has Ancient Japan been scientifically tested?", "78": "Has Ancient Japan been scientifically tested?", "79": "What is the probability of choosing a pink ball from a bag containing 1 black, 2 yellow, 5 green and 4 blue colored balls?", "80": "Can someone who's blocked me see a friend request on wechat?", "81": "Has Ancient Japan been scientifically tested?", "82": "Would infinite temperature have infinite heat and energy?", "83": "Has Ancient Japan been scientifically tested?", "84": "Is 80 bpm a good resting heart rate?", "85": "Isn't this contradictory that most of the people selected in UPSC are from UP and Bihar, and these states have the most corrupted government in India?", "86": "Has Ancient Japan been scientifically tested?", "87": "Has Ancient Japan been scientifically tested?", "88": "Is dating or falling in love prohibited in Islam?", "89": "Am I desecrating the American flag if it is used as a doormat?", "90": "How frequent do birds lay eggs?", "91": "Has Ancient Japan been scientifically tested?", "92": "Are there any ashrams in India that offer Yoga or meditation for free or in exchange for Volunteering?", "93": "Has Ancient Japan been scientifically tested?", "94": "Has Ancient Japan been scientifically tested?", "95": "After the defeat of Nazi Germany, there were massive rapes in Berlin and Germany. Did German troops (Gestapo and the SS) also rape women in concentration camps?", "96": "Will I be eligible to get an admit for an undergrad program in management at MIT Sloan / Stanford / Booth?", "97": "Can we do ms after mba?", "98": "Has Ancient Japan been scientifically tested?", "99": "Has Ancient Japan been scientifically tested?", "100": "Can we really hack using Kali Linux?", "101": "What if the whole world had only one religion, could we think the world can be at peace then?", "102": "Can glass weapons like in Skyrim be useful in real life?", "103": "Has Ancient Japan been scientifically tested?", "104": "Is IIT Indore really worth it?", "105": "How many stamps do I need to send a letter in the usa?", "106": "Has Ancient Japan been scientifically tested?", "107": "Hw long does it take for your lungs to return to normal after smoking for 30 years?", "108": "In Selective Repeat, does the receiver send individual ACK for each packet?", "109": "Can I send an invoice to a customer if my startup is not yet registered?", "110": "Do you believe there is a miracle?", "111": "If you are Muslim, do you believe non-Muslims will go hell?", "112": "Do capacitors reduce energy consumption? How?", "113": "DC Comics: Who would win an American football match if the Justice League played the X-Men or the Avengers?", "114": "Has Ancient Japan been scientifically tested?", "115": "What will be the registration process for GST? When will the registration start?", "116": "Has Ancient Japan been scientifically tested?", "117": "Will Kejriwal win the next elections in Delhi?", "118": "Has Ancient Japan been scientifically tested?", "119": "Write a simple algorithm to check whether the given number is prime or not?", "120": "Was Anna Gunn (Skylar) really pregnant during Breaking Bad?", "121": "Reince Preibus told Trump he would have been better off going on vacation after the convention. Is Trump in free-fall and is the GOP ready to bail?", "122": "Tarzan is a myth or real?", "123": "Obamas law license?", "124": "Is it possible for transfer from the Harvard Extension School into other top graduate programs in Harvard? For example, HBS.", "125": "Has Ancient Japan been scientifically tested?", "126": "Has Ancient Japan been scientifically tested?", "127": "Is it worth it to mine Bitcoin?", "128": "Is it possible to fix a sociopath?", "129": "Has Ancient Japan been scientifically tested?", "130": "Has Ancient Japan been scientifically tested?", "131": "What is the chance to get confirmed seat after opting VIKALP Scheme of Railways ?", "132": "Has Ancient Japan been scientifically tested?", "133": "I am calm most of the time, but every once in a while (once every 4 months) I'll have a rage fit. Am I considered emotionally unstable or normal?", "134": "Can human live with only eating bee's honey?", "135": "Are annoying advertising campaigns successful?", "136": "Can we do intra day trading in futures stocks?", "137": "Can you drink after getting a tattoo?", "138": "Should I watch Clone Wars?", "139": "Are humans from another planet?", "140": "Has Ancient Japan been scientifically tested?", "141": "Has Ancient Japan been scientifically tested?", "142": "Is Big Boss (An Indian TV Series) scripted?", "143": "Has Ancient Japan been scientifically tested?", "144": "Can you have more than one Facebook profile?", "145": "Is registration for NEET-UG 2017 open?", "146": "Should I email Ron Conway?", "147": "Has Ancient Japan been scientifically tested?", "148": "Has Ancient Japan been scientifically tested?", "149": "Before making a telephone call, do you ever rehearse what you are going to say? Why?", "150": "Can I be successful if I dislike socializing?", "151": "Is Quora merging all similar questions?", "152": "Are there any lines NYC subway drivers love/hate to drive?", "153": "Has Ancient Japan been scientifically tested?", "154": "Is China a true communist state?", "155": "Do porn female stars consider the offers to do sex with some unknown males on request?", "156": "Can I retrieve my friendster account?", "157": "Are there any stories of divine intervention aiding the India’s struggle for Independence?", "158": "Is the term \"Revenue Profile\" a real term? My CEO uses it to describe the source and amount of our revenue.", "159": "Has Ancient Japan been scientifically tested?", "160": "Has Ancient Japan been scientifically tested?", "161": "Has Ancient Japan been scientifically tested?", "162": "Can I learn programming at the age of 40?", "163": "If an advanced, intelligent species had once inhabited Mars, but went extinct one billion years ago, would we have any way to know it today?", "164": "Does Quora advertise?", "165": "Has Ancient Japan been scientifically tested?", "166": "Has Ancient Japan been scientifically tested?", "167": "Is it true that matter/energy actually can be created and/or destroyed?", "168": "Is it diffult to become a doctor?", "169": "Is Hrithik Roshan the best actor of Bollywood?", "170": "Has Ancient Japan been scientifically tested?", "171": "With how much money per month can a single man live in Dubai?", "172": "Are there any fruits that grow underground, except peanut?", "173": "Is ethiopia safe?", "174": "Has Ancient Japan been scientifically tested?", "175": "Is pork banned in India?", "176": "Has Ancient Japan been scientifically tested?", "177": "Has Ancient Japan been scientifically tested?", "178": "Is prostitution should legal in India?", "179": "Has Ancient Japan been scientifically tested?", "180": "Does the Pokémon GO release in India android?", "181": "Is mathematics is important for doing mba?", "182": "Does a women's sleeping pattern change when sleeping with their children in the same bed?", "183": "Is there any place to camp for 5 days/6nights which is for free with our own camping tent and gear in Bangalore?", "184": "Is torrent usage illegal?", "185": "Has Ancient Japan been scientifically tested?", "186": "Has Ancient Japan been scientifically tested?", "187": "Amsterdam shelter donate jack Russell?", "188": "Are both type 1 and type 2 diabetes patients at the risk of death?", "189": "Has Ancient Japan been scientifically tested?", "190": "Have you ever been mistaken for the opposite sex?", "191": "Is Taylor Swift musically talented?", "192": "Has Ancient Japan been scientifically tested?", "193": "Has Ancient Japan been scientifically tested?", "194": "Has Ancient Japan been scientifically tested?", "195": "Can you predict the next digital fad?", "196": "Is Quebec culturally closer to France or to the rest of Canada?", "197": "Is there a My Little Pony D&D system?", "198": "Has everyone in IIM-A/B/C scored in the 99th percentile or higher?", "199": "Has Ancient Japan been scientifically tested?", "200": "Has Ancient Japan been scientifically tested?", "201": "What vegetarian foods can dogs eat? Can they eat cooked rice, curd and cooked vegetable. Can they eat spicy food.?", "202": "Has Ancient Japan been scientifically tested?", "203": "Is Law School worth attending?", "204": "Has Ancient Japan been scientifically tested?", "205": "Will you marry a girl, who have had physical relationship in past with some other man?", "206": "Is RAM size or processor speed more important?", "207": "Has Ancient Japan been scientifically tested?", "208": "Has Ancient Japan been scientifically tested?", "209": "Can VMware run Logic Pro X well?", "210": "Is it safe to use ultra tampons?", "211": "Taxes in India: Can I download a soft copy of my PAN card?", "212": "What would be approximate gross salary at the time of joining of IDA pay scale Rs.12300-25400/-?", "213": "Is dimentia curable?", "214": "Is the Node.JS license Free/Open Source?", "215": "Is SEX is really important to save relationship?", "216": "Is reliance jio data is unlimited from 5 sept to dec 31?", "217": "Does poor grades matter in getting admission in JBIMS for MSc Finance?", "218": "Is my boyfriend a narcissist?", "219": "Are the US national interests really more important than justice?", "220": "Do wild animals suffer immensely when hunted by a wild predator, or are there mechanisms at work (such as adrenaline) that alleviate any suffering?", "221": "Is the outflow associated with a supermassive black hole on the scale of a Universal black hole dark energy?", "222": "Is Bangladesh better off than Pakistan?", "223": "Has Ancient Japan been scientifically tested?", "224": "Has Ancient Japan been scientifically tested?", "225": "Has Ancient Japan been scientifically tested?", "226": "Should I believe in God because my relatives do and tell me to do the same?", "227": "How many hours does an MIT undergrad work a day?", "228": "Do I need a US passport to leave the US?", "229": "Will Trump lead to the downfall of the USA?", "230": "Would anything happen to my cash in a US bank account if the US dollar crashes overnight?", "231": "Has Ancient Japan been scientifically tested?", "232": "Is it a bad idea to file a trademark through LegalZoom instead of our expensive Silicon Valley law firm?", "233": "Do Mormons believe that God was human first?", "234": "Did the guillotine cause instant death as the head fell in the basket?", "235": "Is it safe and healthy for dogs to eat cooked rib bones?", "236": "Has Ancient Japan been scientifically tested?", "237": "Are cross body bags also hand bags?", "238": "Has Ancient Japan been scientifically tested?", "239": "If someone blocked me on Instagram can they still receive my message?", "240": "Should gratuity be based on the pre-tax amount or the post-tax amount on a bill at a restaurant?", "241": "Has Ancient Japan been scientifically tested?", "242": "Have you ever created your own language? Do you mind to teach us?", "243": "Has Ancient Japan been scientifically tested?", "244": "Has Ancient Japan been scientifically tested?", "245": "How much does it cost to get a passport in Thailand ? I mean as a Thai people.", "246": "Is it true that Dr Bidhan Chandra Roy had failed in his 1st year MBBS life?", "247": "How often should I rinse my toothbrush while brushing my teeth?", "248": "Do dark skinned Indian girls like dark skinned Indian guys?", "249": "Can you take a can of Coke on an international flight?", "250": "Is the University Physics book better than Halliday Resnick?", "251": "Has Ancient Japan been scientifically tested?", "252": "Love is my religion! What is likely to happen if more people will follow?", "253": "Will matriculation certificate work as proof of birth while applying for Indian passport?", "254": "Has Ancient Japan been scientifically tested?", "255": "Is Pankow a good area to live in Berlin?", "256": "Does 'empty' space have mass which is displaced by matter?", "257": "Is Hernia surgery safe?", "258": "Was it really necessary to drop the nuclear bomb over Hiroshima and Nagasaki during World War 2?", "259": "Has Ancient Japan been scientifically tested?", "260": "Has Ancient Japan been scientifically tested?", "261": "Can you work under pressure best answers?", "262": "Has Ancient Japan been scientifically tested?", "263": "Is it possible to enter into the study of Cryptography without having a background in Maths or Science?", "264": "Has Ancient Japan been scientifically tested?", "265": "Can we drink milk and beetroot mix juice?", "266": "Does Barbie Giri have a boyfriend?", "267": "Is Kapil Sharma married?", "268": "Does reverse biasing increase a photovoltaic’s output power?", "269": "Has Ancient Japan been scientifically tested?", "270": "Has Ancient Japan been scientifically tested?", "271": "Is modi government working well or not?", "272": "Has Ancient Japan been scientifically tested?", "273": "In Star Wars wouldn't it be more efficient to use regular bullets?", "274": "How long is an overtime period in a hockey game?", "275": "What are the countries in the American continent (North / South) that you can travel to without applying for a prior visa, if you have an Indian passport with a valid US visa?", "276": "How much does it cost to open a small restaurant/cafe in pune in a decent locality?", "277": "Has Ancient Japan been scientifically tested?", "278": "Are there risks to wearing earplugs regularly?", "279": "Do Indian women love oral sex?", "280": "Should I buy a MacBook Pro 13 inches or 15 inches for game development?", "281": "Is there a way to solve the problem of overpopulation all over the world?", "282": "I am planning to invest in SBI blue chip fund for 3-5 yrs with 8k SIP per month. Is it a  good scheme to invest?", "283": "Is cheesecake a cake?", "284": "Has Ancient Japan been scientifically tested?", "285": "If 7 billion humans ride bicycle from the same point to the same direction at the same time, can this affect the motion of the Earth?", "286": "Do I still have a chance of getting into a good college?", "287": "We are 5 people planning to go Kolkata and surrounding areas like Sundarban Gangasagar and other important places and we have 5 days?", "288": "Has Ancient Japan been scientifically tested?", "289": "How many litres of coconut water can a person drink a day without getting any issues?", "290": "Caltrain: Will I be able to put my bike on the 329 baby bullet in Palo Alto (8:23AM, northbound), or are the bike cars full by the time train arrives here?", "291": "On Facebook, is my last online time only visible if I'm on mobile?", "292": "Debbie Wasserman Schultz has been removed as DNC chair. Is that enough to satisfy Bernie supporters?", "293": "Has Ancient Japan been scientifically tested?", "294": "Do teen girls like teen boys who smoke, etc.?", "295": "Is a 27 inch standing vertical jump good for a 13 year old boy?", "296": "Has everyone cheated in school before?", "297": "Would it be a better idea if India had only one body with identical uniform and rank hierarchy, instead of the present Army/Navy/Air Force?", "298": "Has the value of the Iranian rial fallen 450% in ten years, as stated by The Associated Press today, or by 78%, as according to my calculation?", "299": "I have bad anxiety. Does meditation work?", "300": "Has Ancient Japan been scientifically tested?", "301": "Has anyone used Centurica.com?", "302": "Has Ancient Japan been scientifically tested?", "303": "I want to start a hotel business in patna in a posh area is it a good decision?", "304": "Can India survive an invasion by China?", "305": "How much does Airtel pay at the senior level?", "306": "Do people still like Urdu poetry?", "307": "Has Ancient Japan been scientifically tested?", "308": "Has Ancient Japan been scientifically tested?", "309": "Has Ancient Japan been scientifically tested?", "310": "Has Ancient Japan been scientifically tested?", "311": "Has Ancient Japan been scientifically tested?", "312": "Has Ancient Japan been scientifically tested?", "313": "Are imaginary numbers always irrational? Why or why not?", "314": "Has Ancient Japan been scientifically tested?", "315": "How much time does a student visa for Germany take to process in India?", "316": "Has Ancient Japan been scientifically tested?", "317": "Can full-face veils be banned in India?", "318": "A father with 8 children takes 3 at a time to zoo as often as he can wothout taking?", "319": "Has Ancient Japan been scientifically tested?", "320": "How many status updates get posted on Facebook daily?", "321": "Is it okay to put leave-in conditioner on dry hair?", "322": "Has Ancient Japan been scientifically tested?", "323": "Legal Documents: Is it necessary to have your name on birth certificate to get an indian passport?", "324": "How much will it cost to fix this car door?", "325": "Has Ancient Japan been scientifically tested?", "326": "When I become the next President of America", "327": "Has Ancient Japan been scientifically tested?", "328": "If I send a message on Line and delete it, will the receiver see the message?", "329": "Does Quora suck?", "330": "If you were married, planning to have two children and are a single income household working in south Germany, would you rather live in Germany or Austria or Switzerland?", "331": "Has Ancient Japan been scientifically tested?", "332": "Has Ancient Japan been scientifically tested?", "333": "Can I open two current account with same name but with two properitor?", "334": "Has Ancient Japan been scientifically tested?", "335": "Who would win: the Juggernaut or the Hulk?", "336": "Has Ancient Japan been scientifically tested?", "337": "Has Ancient Japan been scientifically tested?", "338": "Has Ancient Japan been scientifically tested?", "339": "Should we use hair wax daily?", "340": "Can dogs smell cancer?", "341": "Is a man in a relationship with a transgender person considered gay?", "342": "Will a sequel be made for The Legend of Tarzan (2016 film)?", "343": "Is it impossible for two persons to have exactly the same fingerprints?", "344": "Has Ancient Japan been scientifically tested?", "345": "How difficult is it for for an Indian to be single for the rest of his life considering he was forced to break up with his girlfriend?", "346": "How long can a person survive on just water without food?", "347": "Are there any porn sites containing specifically nail pain or nail fetishes?", "348": "Can an award issued by the Lok Adalat be challenged in court?", "349": "Has Ancient Japan been scientifically tested?", "350": "Does Sasuke become good?", "351": "Has Ancient Japan been scientifically tested?", "352": "Is it possible that Singapore will be back to Malaysia in the future?", "353": "Is there a Canadian equivalent of Zillow?", "354": "Does my male friend have feelings for me?", "355": "Has Ancient Japan been scientifically tested?", "356": "Has Ancient Japan been scientifically tested?", "357": "Currently, all Supreme Court Justices come from very elite law schools, is it similar for the best lawyers in private practice?", "358": "Are there any Progressive Christian dating websites?", "359": "Has Ancient Japan been scientifically tested?", "360": "If you really want to work at Google, is it a bad or good idea to keep resubmitting your resume?", "361": "Will c programming language help me in mechanical engineering?", "362": "Has Ancient Japan been scientifically tested?", "363": "I live in Portugal and I wanna start investing and trading and the United States. Should I use a broker in my country or a U.S broker?", "364": "Will Donald Trump end up in some conflict of interest?", "365": "Has Ancient Japan been scientifically tested?", "366": "Has Ancient Japan been scientifically tested?", "367": "Will I be charged $99 if I subscribe to free amazon prime trial and order a sweater using prime but cancel prime after sweater is delivered (within 30 days)?", "368": "Can dead people feel pain?", "369": "Is it ok to watch porn with boyfriend?", "370": "Will I die?", "371": "Can Virat Kohli ever break Sachin Tendulkar's records?", "372": "Is India quickly becoming the next superpower?", "373": "Has Ancient Japan been scientifically tested?", "374": "Is iOS supposed to clear out your music library when you cross national borders?", "375": "Is there is any scope for a network engineer in India?", "376": "Is the relationship between the USA and Russia getting tenser?", "377": "Do Blairites and Blairism have a place in the future of the Labour Party?", "378": "Has Ancient Japan been scientifically tested?", "379": "Is it possible to get over depression without medicine or therapy?", "380": "Is social media a threat to national security?", "381": "Can I sue a website admin who blocked me despite that I didn't commit anything against the sites terms? Can I win?", "382": "Is it worth to add suspensions to go-karts using 125cc engines?", "383": "Do background checks show warrants?", "384": "Has Ancient Japan been scientifically tested?", "385": "What is the average amount of equity to give first round (seed) investors?", "386": "Can you make me laugh out loud?", "387": "Will 1080p display on my phone be good for VR or do I need a quad HD display?", "388": "Has Ancient Japan been scientifically tested?", "389": "Has Ancient Japan been scientifically tested?", "390": "Has Ancient Japan been scientifically tested?", "391": "Do “observant” Jews ever violate kosher laws?", "392": "Karina and Saif named their child tamoor Ali Khan pataudi is it right?", "393": "Does banning of abortion means gender inequality?", "394": "I am a software engineer with 5 years of experience. Should I pursue my job or handle my dad's business?", "395": "If I exit (not delete) a WhatsApp group, can I still see future conversations?", "396": "Is it true that IT companies really give calls to people if they get a high enough AMCAT score? If so, what is that score?", "397": "Has Ancient Japan been scientifically tested?", "398": "Has Ancient Japan been scientifically tested?", "399": "Has Ancient Japan been scientifically tested?", "400": "Has Ancient Japan been scientifically tested?", "401": "Did India's surgical strikes against Pakistan really happen? Or is it a lie to pacify hurt Indian sentiment and to send a message internationally?", "402": "Has Ancient Japan been scientifically tested?", "403": "Does astrology really effect life?", "404": "Has Ancient Japan been scientifically tested?", "405": "For building a system like Udemy, Coursera or EdX can one use an available off the shelf LMS or have this custom build in PHP or Dot Net?", "406": "Has Ancient Japan been scientifically tested?", "407": "Are there any Amazon scraping tools for Mac? Tools that can help track prices and copy of products over time.", "408": "How many seats are available in MA English in GGSIPU?", "409": "Can I pass a hair follicle drug test if I smoked weed about 3 times, 90 days ago?", "410": "Are hotels required to check your ID?", "411": "Has Ancient Japan been scientifically tested?", "412": "Has Ancient Japan been scientifically tested?", "413": "Will double majoring in Computer Science and Applied Mathematics help me to become more desirable as a candidate?", "414": "Is the Insanity workout worth it?", "415": "Hairbless doesnot work hair still falling?", "416": "I'll be applying for admission into several Engineering programs within the next month. If I don't get accepted can I start as a different major and then transfer into the College of Engineering at a later time once I prove my grades?", "417": "Has Ancient Japan been scientifically tested?", "418": "Does Stripe or Square-Up act as an \"agent\" to process money transfer or do they also come under the payment processor license in USA?", "419": "Does it seem like a lot of breakthroughs (in medicine and in energy technology) get very quickly and \"conveniently\" forgotten shortly after? Is there an organization dedicated to keeping a good record of such findings? Is it ethical?", "420": "Has Ancient Japan been scientifically tested?", "421": "Has Ancient Japan been scientifically tested?", "422": "Is it possible that Vladimir Putin can be homosexual?", "423": "Has Ancient Japan been scientifically tested?", "424": "Should I buy a MacBook Air now (January 2016), or wait for a new one?", "425": "Has Ancient Japan been scientifically tested?", "426": "Should I claim 0 or 1 allowance in my W-4?", "427": "Is it normal to feel a bit nervous before having sex with a new guy?", "428": "Has Ancient Japan been scientifically tested?", "429": "Has Ancient Japan been scientifically tested?", "430": "Is whistleblowing ethical?", "431": "Should I take piano, voice, or guitar lessons?", "432": "Is it mandatory to write the GRE to do an MS in the U.S.?", "433": "Though candidate got selected in UPSE Mains is there any chance of rejecting in interview? An if in that case what about candidate name in final list?", "434": "Do porn stars enjoy double penetration?", "435": "Does low TDS water means low minerals?", "436": "Has Ancient Japan been scientifically tested?", "437": "Has Ancient Japan been scientifically tested?", "438": "Has Ancient Japan been scientifically tested?", "439": "I recently talked to a senior binary stockbroker that wants 20% needs a 5,000 dollar investment and has a 73% success rate. Should I invest?", "440": "Has Ancient Japan been scientifically tested?", "441": "Did video games make brain smarter?", "442": "If I like someone's picture in Facebook and then unlike it will there be any notification in Facebook disclosing me?", "443": "Has Ancient Japan been scientifically tested?", "444": "Is universe expanding or not?", "445": "\"A true musician/singer can able to write songs\", is this true?", "446": "Beach ave elmwood?", "447": "Does India backstab Russia becuase Russia is weak, isolated & in difficulty considered by India?", "448": "I’m 5′6″ and 13 years old. How tall will I be?", "449": "Has Ancient Japan been scientifically tested?", "450": "Do I need a bachelor's degree to become DevOps Engineer?", "451": "Has Ancient Japan been scientifically tested?", "452": "Has Ancient Japan been scientifically tested?", "453": "Has Ancient Japan been scientifically tested?", "454": "Is React.js faster than that of JQuery?", "455": "Is selling on amazon a great career start for a 20 year old who wants to become a multi millionaire?", "456": "Are you a dog person or cat? Why?", "457": "Can an educated man be happily married to an uneducated woman and vice versa?", "458": "Has Ancient Japan been scientifically tested?", "459": "Has Ancient Japan been scientifically tested?", "460": "Is it easy to earn Jazz Rock piano?", "461": "Has Ancient Japan been scientifically tested?", "462": "If you have interest in politics, can you view my plan for a government set up that would solve most of the world problems and write a comment ?", "463": "Can I drive on an Indian driver's license in the US?", "464": "Is there such thing as reincarnation? If yes, what is it that reincarnates?", "465": "How much time should it ideally take for a 26 yr old male to reduce from 18% body fat to 10% body fat while gaining muscle?", "466": "Is there any difference between love at first sight and first crush?", "467": "Should people use Twitter less or more often?", "468": "Has Ancient Japan been scientifically tested?", "469": "Has Ancient Japan been scientifically tested?", "470": "Has Ancient Japan been scientifically tested?", "471": "Can a deaf person hear what he speaks?", "472": "Has Ancient Japan been scientifically tested?", "473": "Has Ancient Japan been scientifically tested?", "474": "Doe anyone know fees for international transfers from Sillicon Valley Bank to Argentina?", "475": "Has Ancient Japan been scientifically tested?", "476": "Is it true that liberals are destroying America?", "477": "Has Ancient Japan been scientifically tested?", "478": "Has Ancient Japan been scientifically tested?", "479": "Has Ancient Japan been scientifically tested?", "480": "Can I use Google App Engine for hosting Meteor.js?", "481": "Do some gun owners really believe in the conspiracy that the government is planning to take away all the guns?", "482": "Are there other examples of immortal cells other than HeLa?", "483": "Has Ancient Japan been scientifically tested?", "484": "When will more William S. Burroughs books will be available on Kindle?", "485": "If you are living in a house where drugs are being sold and are there while the house is raided by the police, will you likely be arrested if you have no involvement? And if yes, on what charges and is a conviction likely?", "486": "Can I run GTA 5 on powercolor r7 250x?", "487": "Can you take Pepto-Bismol while breastfeeding? Why or why not?", "488": "Has Ancient Japan been scientifically tested?", "489": "Is 5\"4 really short for a girl?", "490": "Can we pay the gold loan with old 500?", "491": "Is it possible to use baroque pattern in modern furniture?", "492": "Do you know Audioholics.com?", "493": "Is it illegal for a person to have a list of people they want to kill?", "494": "Can hormonal imbalance lead to weight gain?", "495": "Will the US ever go to war with Russia directly?", "496": "Has Ancient Japan been scientifically tested?", "497": "Can I still be a computer programmer if I am not good at maths?", "498": "Is Austin, TX overrated? How?", "499": "Is life insurance important if I don't have children?", "500": "Can a person carry toothpaste on domestic flights in India?", "501": "Can rooting a device get free Google Play paid apps and books?", "502": "Do all the popular Quorans receive mean comments?", "503": "Has Ancient Japan been scientifically tested?", "504": "Has Ancient Japan been scientifically tested?", "505": "I lost all my photos after temporarily disabling my Instagram account. Will I get them back? How many days should I wait?", "506": "Has Ancient Japan been scientifically tested?", "507": "Do you think 12 cm (4.5 inch) is enough for a penis?", "508": "Is it true that cats are afraid of cucumbers?", "509": "Is it so that a dominant planet can affect one’s personal character?", "510": "Has Ancient Japan been scientifically tested?", "511": "Is it possible a girl can be beautiful but still single?", "512": "Is it legal for a Muslim man to marry a non-Muslim woman for his second wife?", "513": "Is Manaphy from \"Pokemon Ranger and The Temple of The Sea\" considered a whore?", "514": "Is your job allowed to tell you to come to work when you are sick?", "515": "Should I do what makes me happy no matter what others say?", "516": "Has Ancient Japan been scientifically tested?", "517": "Is there blood and pus in cow milk?", "518": "Will my friends be able to see my WhatsApp picture if I uninstall my account?", "519": "How long will tires last with 40% tread left?", "520": "Has Ancient Japan been scientifically tested?", "521": "Is there any capacitor without dielectric?", "522": "I don't know anything about circuits, should I try home automation?", "523": "Is it true that CPSS is tougher than PABT Test in NDA?", "524": "Has Ancient Japan been scientifically tested?", "525": "Is liquid nitrogen flammable?", "526": "Should I believe my girlfriend when she tells me that she doesn't want to have sex (even with a condom) because she's worried about getting pregnant?", "527": "Has Ancient Japan been scientifically tested?", "528": "Do dogs sweat? Why or why not?", "529": "Has Ancient Japan been scientifically tested?", "530": "Is God ever referred to as she in the Bible?", "531": "Is the term \"evolution\" explained in Vedas?", "532": "Should I get a duke 200 or gixxer 155?", "533": "How much is the average cost to replace an alternator?", "534": "Has Ancient Japan been scientifically tested?", "535": "Has Ancient Japan been scientifically tested?", "536": "Can an arts graduate from India get a job at Google after he or she attains enough training in CS programming?", "537": "Is there any legit trial codes for Xbox live gold w/o a generator?", "538": "I have given CFA I exam but I have not cleared it? Whether I should go for 2nd attempt or not?", "539": "Has Ancient Japan been scientifically tested?", "540": "If Trump wins, will President Obama attend his inauguration?", "541": "Is it possible to not have mental illness and be insane?", "542": "Has Ancient Japan been scientifically tested?", "543": "Has Ancient Japan been scientifically tested?", "544": "Are the nude scenes in film and television real?", "545": "Can an emotionally abusive person change?", "546": "If I mixed coconut oil with avocado oil, would that make a good face moisturizer?", "547": "Has Ancient Japan been scientifically tested?", "548": "Is DigitalOcean $5/month enough for my approximately 10,000 visitors/day WordPress site?", "549": "How many attempts can a person make for GATE?", "550": "Has Ancient Japan been scientifically tested?", "551": "If Hilary wins, will Bill Clinton bring his cigars back into the White House to use on interns?", "552": "Is WFU a good choice to study computer science?", "553": "Is a recruiter and an interviewer from a company allow to ask what hour salary you made at your previous job? Is it rude to not tell them?", "554": "How safe would the Southern Hemisphere be if a Nuclear War broke out between Russia and the United States?", "555": "How much does Apple charge to develop/use push notification service in iPhone apps?", "556": "Does PM Modi not visiting NAM meeting in Venezuela represent a shift in India's \" Non - Aligned\" foreign policy?", "557": "Will I ever find my calling?", "558": "Is 65% marks compulsory in M.tech for MHRD scholarship (student is GATE qualified)?", "559": "Has Ancient Japan been scientifically tested?", "560": "Has Ancient Japan been scientifically tested?", "561": "Can I combine Tomatoes, poultry, cow and maize on the same farm land? Please note that total area of land is 10 acres.", "562": "I have done my graduation in economics honours. I am now going to do my master's from Calcutta University. I really don't know whether doing my master's from Calcutta University or not. Is it a good idea?", "563": "Do System engineers at TCS do System programming?", "564": "Has Ancient Japan been scientifically tested?", "565": "Has Ancient Japan been scientifically tested?", "566": "Has Ancient Japan been scientifically tested?", "567": "Has Ancient Japan been scientifically tested?", "568": "Has Ancient Japan been scientifically tested?", "569": "Has Ancient Japan been scientifically tested?", "570": "I am a good software developer at this stage of my career. But I am feeling some interest to pursue my interest in machine learning. Should I pursue?", "571": "Can you get teeth whitening even if you have a cavity?", "572": "If I retake PTE, will the previous test results be still valid or they would be overridden and considered invalid after the new result?", "573": "Has Ancient Japan been scientifically tested?", "574": "Can doses of estrogen turn a man into a woman?", "575": "Has Ancient Japan been scientifically tested?", "576": "Is Yahoo worth $5 billion?", "577": "Has Ancient Japan been scientifically tested?", "578": "Has Ancient Japan been scientifically tested?", "579": "Does Ne-Yo have a sister?", "580": "Can birds cry of emotion?", "581": "Does Tango currently offer new employees stock options or RSUs?", "582": "Has Ancient Japan been scientifically tested?", "583": "Has Ancient Japan been scientifically tested?", "584": "Has Ancient Japan been scientifically tested?", "585": "Do Mexican women like East Asian men (Korean, Japanese, Chinese)?", "586": "Did a solar and lunar eclipse happen on the same day?", "587": "Do big cats (tigers, lions) purr?", "588": "Am I the only one to notice Fibonacci sequence in traffic signal lights?", "589": "Was India's caste system founded on race, white skinned Aryans subduing dark Dravidians?", "590": "Has Ancient Japan been scientifically tested?", "591": "Is a month enough time for preparation for the BITSAT and JEE Main exams?", "592": "How long does DGCA take to allot a computer number for student pilots after application is received?", "593": "I am placed in an embedded company named \"Pantech Solutions\". If I enter this field, will my future be good or not?", "594": "Has Ancient Japan been scientifically tested?", "595": "Should I believe my horoscope?", "596": "Is it true that the Vatican has the highest crime rate per capita of any country on earth?", "597": "If Flash can catch a bullet how is it possible that he sometimes can't dodge a punch?", "598": "Can I pass a value from one HTML (or JavaScript) page to another HTML (or JavaScript) page without passing it in URL?", "599": "Has Ancient Japan been scientifically tested?", "600": "Is the electricity, gas and water market in Argentina owned by the government or particulars?", "601": "Was Erwin Rommel a great general?", "602": "Is a bio-tech graduation applicable for entry in the defense?", "603": "Is Cersei Lannister psychologically ill?", "604": "Has Ancient Japan been scientifically tested?", "605": "Are kellogs corn flakes good for weight loss?", "606": "Who is more powerful among Muslims, Shia or Sunni?", "607": "\"Avada Kedavra,\" \"Wingardium Leviosa,\" \"Stupefy,\" etc. Do these Harry Potter spells have any meanings?", "608": "Have you ever met a celebrity who was nicer than you expected?", "609": "Has Ancient Japan been scientifically tested?", "610": "Anyone who can give me write information about this graphic card? Graphic card name is Zotac 210 Synergy edition tc1g 64bit ddr3", "611": "Can writing about a kind person improve your personality?", "612": "If you are smart, do you need to be kind?", "613": "Has Ancient Japan been scientifically tested?", "614": "Has Ancient Japan been scientifically tested?", "615": "Has Hugo Boss designed any military uniforms since 1945?", "616": "I have obc certificate in kannada is it ok for applying csir net exam.?", "617": "Is it safe to visit srinagar in September 2016?", "618": "Has Ancient Japan been scientifically tested?", "619": "My father works in oil india limited and income is more than 6 lakh but not an officer..can I get obc ncl certificate?", "620": "Would Facebook, Google, Amazon and Microsoft be able to withstand a more than 1Tbps DDOS attack?", "621": "Me and my girlfriend had a big argument on Monday and she said she didn't want to be with me anymore (I think this was partly out of anger) but then agreed to go on a weeks break with no contact, shall I wait for her to contact me? I really want to text her.", "622": "Does an exercise bicycle help you lose weight?", "623": "Has Ancient Japan been scientifically tested?", "624": "Is it compulsory to attest the document with Gazetted officer or to self attest in SSB?", "625": "Could we weaponize Hawking radiation?", "626": "Has Ancient Japan been scientifically tested?", "627": "Has Ancient Japan been scientifically tested?", "628": "Was Ghiyasuddin Ghazi the real name of Motilal Nehru's father?", "629": "Can I use both benzoyl peroxide and panderm cream together?", "630": "Has Ancient Japan been scientifically tested?", "631": "I am told to receive MMR vaccine, but my wife and me are trying to conceive, will the vaccine have any bad effects on us?", "632": "Has Ancient Japan been scientifically tested?", "633": "Has Ancient Japan been scientifically tested?", "634": "Can someone hack into my computer if it is not connected to the Internet?", "635": "Has Ancient Japan been scientifically tested?", "636": "Has Ancient Japan been scientifically tested?", "637": "In a ticket booked for one couple, if one passenger gets a confirmed berth, and the other is still waitlisted after chart preparation, can the waitlisted passenger board the train?", "638": "As a result of a disaster, only a handful of serial killers remain alive. Would you kill them in the name of justice or use them to re-populate Earth?", "639": "Is the story that Sir Alexander Fleming or his father saved Winston Churchill's life, true?", "640": "Is 1 year enough to crack iit?", "641": "Has Ancient Japan been scientifically tested?", "642": "Has Ancient Japan been scientifically tested?", "643": "Is the Non-Proliferation Treaty a hoax?", "644": "Is A Brief History of Time still a good read or is it outdated?", "645": "Has Ancient Japan been scientifically tested?", "646": "I have turned 30 and hardly interested in anything. I mean nothing interests me anymore. There is no motivation to do anything. Is this a common feeling?", "647": "Do employees at Noodles & Company have a good work-life balance? Does this differ across positions and departments?", "648": "How much water would it take to put out the sun?", "649": "Was/is it justified for the government of India to ban the documentary \"India's Daughter\"?", "650": "Has Ancient Japan been scientifically tested?", "651": "Has Ancient Japan been scientifically tested?", "652": "Has Ancient Japan been scientifically tested?", "653": "Has Ancient Japan been scientifically tested?", "654": "Hypothetical scenarios: If Obama could run for office again, could he win?", "655": "Has Ancient Japan been scientifically tested?", "656": "Was the Kohinoor really gifted to England queen?", "657": "Is there any karma rule is applied in real life?", "658": "Is Indian economy is a strong economy?", "659": "Telangana private medical colleges are asking for bank guarantee for 5 years for MBBS seat. Is it worth paying?", "660": "Has Ancient Japan been scientifically tested?", "661": "Has Ancient Japan been scientifically tested?", "662": "Has Ancient Japan been scientifically tested?", "663": "Has Ancient Japan been scientifically tested?", "664": "Do adopted children of homosexual parents tend to become gay?", "665": "Has Ancient Japan been scientifically tested?", "666": "Has Ancient Japan been scientifically tested?", "667": "Has Ancient Japan been scientifically tested?", "668": "Do dinosaurs still exist and is it possible to contact and communicate with them?", "669": "Can you read a novel after completing a language course in Duolingo?", "670": "Is the UK a declining economy?", "671": "Who is safer for the world, Hillary or Donald?", "672": "If we credit card stteled ammount is there any issue?", "673": "Can a man do sex in the night and do Pooja the next morning? What does Scriptures say about it?", "674": "Do people always want to side with the villains rather than the heroes?", "675": "Cooking in earthen pot?", "676": "How much hard disk space does The Sims 3 take up when all of its expansion and stuff packs are installed?", "677": "Did Luke surpass Darth Vader or did Vader hold back?", "678": "Was Lord Shiva a Brahmin or Kshatriya?", "679": "How much does it cost to make a cashless transaction in India?", "680": "Have you ever heard of the Bible being defiled by witches?", "681": "Has Ancient Japan been scientifically tested?", "682": "Has Ancient Japan been scientifically tested?", "683": "Are Nissan Sentras good cars? Why or why not?", "684": "Has Ancient Japan been scientifically tested?", "685": "Do I need a domicile certificate for NEET?", "686": "Has Ancient Japan been scientifically tested?", "687": "Has Ancient Japan been scientifically tested?", "688": "Has Ancient Japan been scientifically tested?", "689": "Has Ancient Japan been scientifically tested?", "690": "Is the universe finite or infinite? Is there any imaginary boundary for it?", "691": "If by being anonymous, you can truly share your life experiences and feelings without any fear of being judged, it's not a bad thing, is it?", "692": "Has Ancient Japan been scientifically tested?", "693": "Is Lyrica a better option than Tramadol for pain management ?", "694": "Is there any mobile application identified fake currency notes using backend machine learning alogorithms?", "695": "Has Ancient Japan been scientifically tested?", "696": "Is hard work the key to success?", "697": "If you are getting one word replies from a girl while texting, does that mean she isn't interested?", "698": "How much time does it take to activate internet banking in SBI?", "699": "Can we expect RBI assistant prelims 2016 result today?", "700": "Has Ancient Japan been scientifically tested?", "701": "Do you tend to post more questions or answers?", "702": "Are most gay guys unnoticeable as being gay?", "703": "When is it time for a divorce?", "704": "Is there any other life existing except on Earth?", "705": "Should I get the Plume or Armor fossil in Pokémon Sun / Moon?", "706": "Has Ancient Japan been scientifically tested?", "707": "Is Quora investing in Startups?", "708": "Has Ancient Japan been scientifically tested?", "709": "Has Ancient Japan been scientifically tested?", "710": "Can you listen to the radio on an iPhone 6 without WiFi or mobile data?", "711": "Can I upgrade Window 7 SP1 to Window 10 now?", "712": "Has Ancient Japan been scientifically tested?", "713": "If space would be endless, wouldn't that mean that everything can exist?", "714": "Has Ancient Japan been scientifically tested?", "715": "Has Ancient Japan been scientifically tested?", "716": "Do parents in 2016 have different hopes and standards for their sons than for their daughters?", "717": "If a catastrophic event were to happen and all our technological advancements like semi-conductor fabs, manufacturing plants , industries get wiped out, how long will it take for us to get back where we are now?", "718": "Has Ancient Japan been scientifically tested?", "719": "With current technology, how long would it take to reach Mars from Earth?", "720": "Has Ancient Japan been scientifically tested?", "721": "Sixsigma green belt worth for civil engineering?", "722": "My AIR rank is 462000 and my OBC NLC rank is 161998. Is there any chance that I can get an admission in DTU, NSIT or IGDTUW?", "723": "In the phrase \"I love you, Spencer.\" is the comma needed?", "724": "Has Ancient Japan been scientifically tested?", "725": "Has Ancient Japan been scientifically tested?", "726": "Has Ancient Japan been scientifically tested?", "727": "Can a Uber rider be a uber driver using the same account?", "728": "Has Ancient Japan been scientifically tested?", "729": "Have there every been any mental stability issues in Donald Trump life?", "730": "Has Ancient Japan been scientifically tested?", "731": "Has Ancient Japan been scientifically tested?", "732": "Will drinking lemon water or dropping honey in eyes make your eye color lighter?", "733": "Has Ancient Japan been scientifically tested?", "734": "Has Ancient Japan been scientifically tested?", "735": "Has Ancient Japan been scientifically tested?", "736": "Has Ancient Japan been scientifically tested?", "737": "Is onion juice a good remedy for hair loss?", "738": "Has Ancient Japan been scientifically tested?", "739": "Should I learn C?", "740": "How long does it take for a signal from Earth to reach Mars?", "741": "Has Ancient Japan been scientifically tested?", "742": "Is PV^(gamma) = constant valid for only an internally reversible adiabatic process or any isentropic process?", "743": "Has Ancient Japan been scientifically tested?", "744": "Has Ancient Japan been scientifically tested?", "745": "Is there any District Magistrate for Kolkata?", "746": "Do IAS officers get jobs in CBI, RAW, or the Intelligence Bureau? If so, how?", "747": "Have you or anyone you know ever transitioned career from a full time scientist to fashion/makeup artist? How did it work out?", "748": "Does the Rothschild Family own the world?", "749": "Has Ancient Japan been scientifically tested?", "750": "Has Ancient Japan been scientifically tested?", "751": "How much did it cost you to fix a water damaged MacBook Pro?", "752": "Romance (love): Do you still trust your heart after a break up intensive love story?", "753": "Can I feed my cat raw chicken liver?", "754": "Has Ancient Japan been scientifically tested?", "755": "Would you respect the Abrahamic God if he exists?", "756": "Will the family of my boyfriend from south India will accept a foreign woman with kids?", "757": "Is negative temperature possible if\"certain systems can achieve negative temperature\"? If it's hotter than infinite temperature has it infinite energy?", "758": "Is interface theory of perception a well tested theory?", "759": "Does a US Starbucks Card work in other countries?", "760": "Has Ancient Japan been scientifically tested?", "761": "Do you support affirmative action?", "762": "Can Hillary Clinton pardon herself if she is elected as President?", "763": "Has Ancient Japan been scientifically tested?", "764": "Has Ancient Japan been scientifically tested?", "765": "Has Ancient Japan been scientifically tested?", "766": "Has Ancient Japan been scientifically tested?", "767": "Has Ancient Japan been scientifically tested?", "768": "Can I get the Poki app on my Android phone?", "769": "Is it a good option to transfer from Purdue to MIT?", "770": "How many people around the world are playing Clash of Clans? Is it the most viral online game ever?", "771": "Has Ancient Japan been scientifically tested?", "772": "Has Ancient Japan been scientifically tested?", "773": "Has Ancient Japan been scientifically tested?", "774": "Do sunscreens block Vitamin D synthesis?", "775": "Are there any Trump supporters who actually think the wall is a good and effective solution to illegal immigration and if so, can you explain how?", "776": "Has Ancient Japan been scientifically tested?", "777": "Can you get gold from a bar of iron by using flux, a torch and a furnace (Parkes process)?", "778": "In Game of Thrones or the book, are all Targaryens immune to fire?", "779": "Is it cheaper to withdraw money from a bank in a foreign atm machine or to just transfer money from overseas to my account?", "780": "Can math be described as the language of nature?", "781": "Has Ancient Japan been scientifically tested?", "782": "Does the prime minister of India have power to demonetize the currency without getting approval from the president?", "783": "Has Ancient Japan been scientifically tested?", "784": "How long does nutrition\\nutrients last after cutting\\slicing a fruit? Or after how much time does the nutrition\\nutrients start to erode after cutting\\slicing a fruit?", "785": "Is it good to buy Asus UX310U?", "786": "Would it be wise to invest in property with historical value in Old Tbilisi?", "787": "Has Ancient Japan been scientifically tested?", "788": "Has Ancient Japan been scientifically tested?", "789": "Has Ancient Japan been scientifically tested?", "790": "Can I quit my job via email effective immediately if I only worked there one week?", "791": "Can I burn an audio CD on a DVD-R and have it behave as a CD-R so I can play it in all cars and players?", "792": "Can depression make you feel sick or actually become sick?", "793": "Is a new report from a medical examiner likely to win a habeas corpus case?", "794": "Should I give up on my 6 year long distance relationship because of my fears?", "795": "When is Google Play Music coming to India?", "796": "Has Ancient Japan been scientifically tested?", "797": "Should we eat non veg?", "798": "Has Ancient Japan been scientifically tested?", "799": "Are the materials needed to created fossils available on Mars?", "800": "Is MS in Data Science difficult if you don't know programming?", "801": "Is it possible to sell your soul?", "802": "Can a cat become addicted to catnip?", "803": "Can someone tell if I am looking at their Instagram?", "804": "Is there any difference between Computer science and Computer engineering?", "805": "Can paramedics/EMTs have tattoos and piercings?", "806": "Is it true that some behind-the-scenes families, like the Rothschild family, control the world's wealth?", "807": "Can AngularJS be used as a CMS?", "808": "Can we reverse time?", "809": "Has Ancient Japan been scientifically tested?", "810": "My 45 days old 350 classic Enfield has one tire (rear) hole which has been patched. With that can I go for long ride Or do I need to get it change?", "811": "Has Ancient Japan been scientifically tested?", "812": "Are Muslims allowed to celebrate Christmas?", "813": "Were there white slaves in the USA before and during the Civil War?", "814": "Has Ancient Japan been scientifically tested?", "815": "Is \"I've a [object]\" proper grammar?", "816": "Can undiagnosed asthma cause high blood pressure?", "817": "Is there free will in this world?", "818": "Would it ever be possible to cure and reverse aging?", "819": "Has Ancient Japan been scientifically tested?", "820": "Has Ancient Japan been scientifically tested?", "821": "Do prokaryotes have cell walls or cell membranes?", "822": "Do I have photographic memory?", "823": "Has Ancient Japan been scientifically tested?", "824": "Can a person avail both \"PMJBY' and \"PMSBY\" life insurance? Would their family members get a benefit post-death?", "825": "Has Ancient Japan been scientifically tested?", "826": "Can the absence of time traveler from the future visiting us conclude that time traveling does not exist?", "827": "Has Ancient Japan been scientifically tested?", "828": "Has Ancient Japan been scientifically tested?", "829": "Is Nazism on the rise in Europe again?", "830": "Can you propel a car using only magnetism?", "831": "Is there a contradiction with feminism that women want to be equal but often choose aggressive, dominant men in relationships, casual and long term?", "832": "How long will it take the United States to live down the candidacy of Donald Trump?", "833": "Which is easier greencard (USA) or permanent residency in Canada?", "834": "Has Ancient Japan been scientifically tested?", "835": "Can anyone has the codevita round 1 result?", "836": "Can I ask my bank to reverse an ACH withdrawl made by a merchant on my account and did not deliver the service?", "837": "Is IIT-B's campus the best?", "838": "Was this years' (2016) IBPS-PO paper difficult? Can the cut-off be 40–45?", "839": "Will Hillary Clinton run for president in 2016?", "840": "How often can you use egg mask on your face?", "841": "Can I cancel and reschedule passport appointment on same day?", "842": "Who can become a cabinet minister?", "843": "How much time does it take to ship something First Class with USPS?", "844": "Is it cultural appropriation when black women straighten their hair, dye it blonde, or wear blue contacts?", "845": "Can living a generally unhealthy lifestyle as a teenage male increase your chance of being gay\\ bisexual due to increased estrogen production ?", "846": "Does this contradict the hypothesis that the speed of light is the same for all observers?", "847": "What's the right age to lose virginity?", "848": "Can I sue reliance for migrating jio preview offer users to welcome offer ?", "849": "Has Ancient Japan been scientifically tested?", "850": "Can I implement Lean UX in the creation of applications using rapid methods (RAD)?", "851": "Is triglyceride a lipid, carbohydrate, or protein?", "852": "Would Earth be wetter if there were more oceans covering our planet's surface?", "853": "Has Ancient Japan been scientifically tested?", "854": "How many Groupon buyers ask for refund?", "855": "Has Ancient Japan been scientifically tested?", "856": "Does anyone agree Scientology was dreamt up by RLH for tax evasion ? Can I just dream up my own religion?", "857": "Does something cause a person to become a psychopath, or are they just born that way?", "858": "Could Matt Murdock actually see?", "859": "Would you date a Muslim guy? Why/why not?", "860": "Has Ancient Japan been scientifically tested?", "861": "Has Ancient Japan been scientifically tested?", "862": "Has Ancient Japan been scientifically tested?", "863": "Has Ancient Japan been scientifically tested?", "864": "Should I join jindal steel bellary plant or continue with TCS . Considering I m an electrical engineer and want to do MBA in future ?", "865": "Has Ancient Japan been scientifically tested?", "866": "Has Ancient Japan been scientifically tested?", "867": "Can we get HTML content of blocked domain (by proxy) using curl?", "868": "Has Ancient Japan been scientifically tested?", "869": "Has Ancient Japan been scientifically tested?", "870": "Has Ancient Japan been scientifically tested?", "871": "Is Socialism really a bad thing?", "872": "Is it illegal to argue with kinners/hijras?", "873": "Has Ancient Japan been scientifically tested?", "874": "Are Vatican citizens also Italian citizens?", "875": "Has Ancient Japan been scientifically tested?", "876": "Is it true that a dog who bites his owner should dieron?", "877": "Has Ancient Japan been scientifically tested?", "878": "Can IAS officer go for vacation to abroad?", "879": "Has Ancient Japan been scientifically tested?", "880": "Has Ancient Japan been scientifically tested?", "881": "Has Ancient Japan been scientifically tested?", "882": "Has Ancient Japan been scientifically tested?", "883": "Is Obama really going to give away control of the internet? How and why is this a good idea? Won't this threaten free speech?", "884": "Can a person with a very low IQ increase it by better dieting or any other ways?", "885": "Has Ancient Japan been scientifically tested?", "886": "Has Ancient Japan been scientifically tested?", "887": "Has Ancient Japan been scientifically tested?", "888": "Does prostatitis cause hair loss?", "889": "Has Ancient Japan been scientifically tested?", "890": "Has Ancient Japan been scientifically tested?", "891": "Do White people have the lightest skin colour of any people in the world?", "892": "Has Ancient Japan been scientifically tested?", "893": "Has Ancient Japan been scientifically tested?", "894": "Who should file income tax return?", "895": "Has Ancient Japan been scientifically tested?", "896": "Has Ancient Japan been scientifically tested?", "897": "Should we be afraid of dying?", "898": "Does Your Life have meaning?", "899": "When learning a new language, should I associate a foreign word with an object or translate from English to the new language, such as German?", "900": "Is there a proof in the Bible that Jesus was buried three days and nights?", "901": "Should I buy a DSLR?", "902": "Are human cells considered to be prokaryotes or eukaryotes?", "903": "Has Ancient Japan been scientifically tested?", "904": "Can someone with no finance background prepare for FRM level 1 in 2 months?", "905": "Has Ancient Japan been scientifically tested?", "906": "If I am traveling to Cancun, should I buy Mexican pesos in the US?", "907": "Are your grades inflated?", "908": "Have you met someone from Quora, in person?", "909": "Can I get honest reviews on Samsung Galaxy A5 2016?", "910": "Is Orlando Bloom a good actor?", "911": "Could god be a four dimentional being?", "912": "Has Ancient Japan been scientifically tested?", "913": "Could I get into MIT?", "914": "Can beggars be source of inspiration to bloggers too?", "915": "Is the earth moving closer to the sun?", "916": "If Ghost Rider used the Penance Stare on Cthulu would it have any effect?", "917": "Has Ancient Japan been scientifically tested?", "918": "Is it better to kiss or to be kissed?", "919": "Can I be gay in the whole Mass Effect series?", "920": "Should one cancel Maruti Suzuki Baleno and buy Hyundai Elite I20?", "921": "How much time does Amdocs, Pune take to send offer letter after asking for documents?", "922": "Does Quora have a private message feature?", "923": "Should it no longer be appropriate to consider what the founding fathers would do when addressing modern day issues because of how different our outlook on the world is today?", "924": "Has Ancient Japan been scientifically tested?", "925": "Did Joseph McCarthy ever \"out\" anyone who was an actual threat to the U.S. or was it only a political witch hunt/power grab?", "926": "Is it ok to ask your wife to give a blow job?", "927": "Has Ancient Japan been scientifically tested?", "928": "Has Ancient Japan been scientifically tested?", "929": "Sniper Rifles: For long range shooting with a bipod ONLY - is there an ideal barrel length?", "930": "Was ICICI bank a public sector bank?", "931": "Do Indians realize that Territorial map of India looks like this?", "932": "Is Swami Vivekananda Chicago speech overjoyed?", "933": "Is coding enough for a CSE engineer or must he/she develop soft skills too? And if yes, then what soft skills should he/she learn and how?", "934": "Has surgical strike on Pakistan given tight slap to those who mocked 56\" chest?", "935": "Have you witnessed few things that is suddenly getting changed in your life in a span of 1 or 2 decades?", "936": "Has Ancient Japan been scientifically tested?", "937": "Has Ancient Japan been scientifically tested?", "938": "Has Ancient Japan been scientifically tested?", "939": "Has Ancient Japan been scientifically tested?", "940": "Has Ancient Japan been scientifically tested?", "941": "Is book named ‘Kautilya's Arthashastra’ useful for managers?", "942": "Does new testament rejects old testament?", "943": "Has Ancient Japan been scientifically tested?", "944": "Could Satan be a god or the good guy?", "945": "Has Ancient Japan been scientifically tested?", "946": "Do we technically not touch anything?", "947": "How many Tinder matches do you get on Tinder?", "948": "Has Ancient Japan been scientifically tested?", "949": "Fish oil manufacturer in india?", "950": "How fast would the average human have to run to run on water?", "951": "Can a student with BTech in food/oils/coating etc do MTech/MS in Chemical Engineering?", "952": "Has Ancient Japan been scientifically tested?", "953": "Is it a good idea to marry if the only thing I want is sex?", "954": "Has Ancient Japan been scientifically tested?", "955": "Has Ancient Japan been scientifically tested?", "956": "Does Islam seem outdated to the present world?", "957": "Has Ancient Japan been scientifically tested?", "958": "Can God create a rock so big that even he cannot lift it?", "959": "Has Ancient Japan been scientifically tested?", "960": "Is \"Ether\" from Myntra.com a good brand?", "961": "Has Ancient Japan been scientifically tested?", "962": "Has Ancient Japan been scientifically tested?", "963": "Has Ancient Japan been scientifically tested?", "964": "If I leave communication for Gate ECE, can I still achieve a good rank?", "965": "Has Ancient Japan been scientifically tested?", "966": "Can I ever become a CEO, or even one of the top managers, if I join a company like Google, Facebook, LinkedIn, Quora or even Wipro, Infosys or TCS, after joining them as an entry level engineer?", "967": "Is it correct to say someone is 'Arabic'?", "968": "Has Ancient Japan been scientifically tested?", "969": "Has Ancient Japan been scientifically tested?", "970": "Has Ancient Japan been scientifically tested?", "971": "If nothing is impossible, then isn't the impossible possible?", "972": "Will the universe end with the Big Freeze?", "973": "Is America going to collapse?", "974": "Does accenture send employees abroad? people with which profile are sent abroad? Which country has had visits from accenture employees frequently?", "975": "Has Ancient Japan been scientifically tested?", "976": "Did Dr. Oz cover the fraudulent story that said chocolate helps you lose weight before it was revealed to be fraudulent?", "977": "Is there any need of tempered glass or screen guard on gorilla glass 4?", "978": "Has Ancient Japan been scientifically tested?", "979": "Is there any natural solution for erectile dysfunction treatment?", "980": "Has Ancient Japan been scientifically tested?", "981": "If Trump becomes President in 2016, which aspects of his legislative agenda will the Democrats be most able to disrupt?", "982": "Republican Party (U.S.): How many people out there wholeheartedly support Donald Trump running for president?", "983": "Is it possible to track someone remotely through GPS on his phone without his knowledge and without installing any software on his phone?", "984": "Does the genetic makeup of a tree have predetermined locations to sprout branches?", "985": "My old damaged passport's cover and the name page is trimmed at top right corner by Indian consulate when they reissued me new passport?", "986": "Can I make as much money as gambler,''Zeljko Ranogajec'' which is billion dollars a year in his betting overturn? Is he lucky or is he smart?", "987": "Has Ancient Japan been scientifically tested?", "988": "Can I do a mix of coconut oil and olive oil for hair growth and nourishment?", "989": "Can kids be paid less than minimum wage?", "990": "Do you believe in parallel universes?", "991": "I want to write and publish a fantasy novel. I have heard the concept of self-publishing on Amazon.com. Does it require any pre-investment? How much?", "992": "Has Ancient Japan been scientifically tested?", "993": "In an automatic transmission car, when should you use the lower gear settings such as D3 or 2.?", "994": "Should I assassinate trump?", "995": "Has Ancient Japan been scientifically tested?", "996": "Has Ancient Japan been scientifically tested?", "997": "Has Ancient Japan been scientifically tested?", "998": "Has Ancient Japan been scientifically tested?", "999": "Lead guitar pull on vs slide?"}