{"0": "Why are guys intimidated by “cute” girls?", "1": "What is the percentage of people clicking on paid ads?", "2": "What are the safety precautions on handling shotguns proposed by the NRA in Colorado?", "3": "Why is the USA destabilizing the Philippines?", "4": "How did the word noob originate in Age of Empires?", "5": "Can someone list the advantages and disadvantages of demonetization?", "6": "What's in it for Julian Assange?", "7": "How did Adam D'Angelo get so much learned people to sign up for Quora?", "8": "What are the advantages and benefits does both snapdeal and Infocus has in selling its product only online through snap deal?", "9": "Why do men like masturbation?", "10": "What is criminality?", "11": "What is the standard basketball ring height in the NBA?", "12": "What are the differences between NaHDO4 and H2O?", "13": "What is the punishment of apostasy in Christianity?", "14": "Why does Justin Bieber's song \"Baby\" has so many views on youtube?", "15": "What does 10 inch rainfall conveys?", "16": "What is the concept of the phrase \"payment without prejudice\"?", "17": "It is the glory of God to conceal a thing. What is the glory of kings?", "18": "Why is my toilet tank empty?", "19": "Who killed Nikola Tesla?", "20": "What is Godot syndrome, and how can it be treated?", "21": "How do you react when someone is tailgating you?", "22": "Why is BufferedReader preferred over Scanner?", "23": "How good is Puma ignite as a runner and how well does it fair as a trainer shoe?", "24": "What happens if a tornado meets a volcano?", "25": "In Interstellar, how did Cooper dock with the Endurance when it was out of control? I might make a YT video about this.", "26": "Difference between laminar transitional and turbulent flow?", "27": "What is the purpose of living my life?", "28": "What are the disadvantages of TV advertising? What are the advantages?", "29": "How is bore whole water treated and removed the high salt content (if any)?", "30": "Why aren't humans drilling to the center of the earth?", "31": "What does the audience in WWE shout when the match is going on?", "32": "What was the reason behind India-Pakistan partition? Was Nehru's and Jinnah's immoral character (with lady Edwina Mountbatten) responsible for it?", "33": "How good is LCA Tejas compared with other fighter jets in its category?", "34": "How is sodium hydroxide produced?", "35": "Why is Donald Trump nasty and why do people actually like him?", "36": "How does it feel to have an Indian for a boyfriend?", "37": "What are the characteristics of baroque art?", "38": "Will humans evolve into a more developed being? If so, what would be the first signs of evolution in humans (definite organs or adaptation)? If not, why won't humans develop?", "39": "Why do I feel stressed for no reason?", "40": "How friendly is a Shepherd/White Husky mix puppy?", "41": "Would you second guess your interactions on Quora if the site was SEO optimized and caused your answers to appear prominently when someone Google'd your name? Why?", "42": "Why aren't there traditional namespaces in TypeScript? How do I rewire my brain to think without namespaces for organizing related classes together", "43": "Who was on earth first humans or plants?", "44": "What is an example of a sentence using the word \"their\"?", "45": "By the hierarchy protocol who is senior: A cabinet Minister of Central Government or a Chief Minister of a State in India?", "46": "How does seafloor spreading hypothesis differ from Wegener's continental drift theory and theory of plate tectonics?", "47": "Operating systems : what is the difference between an original OS and a pirated one? why should one go for the original one, benefits as such?", "48": "Why aren't there many (or any) black \"rockstar\" tech founders?", "49": "What can be my first question for Quora?", "50": "How does the tap water distribution and sewage disposal system work in Kolkata?", "51": "What is the difference between atomic mass unit(amu) and mass?", "52": "Why is the capacitor connected in a series in a ceiling fan?", "53": "If Darth Vader had not died when he destroyed Palpatine, what, in your opinion, would the future have been for Vader and his son Luke Skywalker?", "54": "What were some motives to begin with imperialism in some European countries?", "55": "Why did Ambani attend Wharton?", "56": "Why aren't Peter Drucker's books as popular in America as they are in Japan?", "57": "When is Bruce Springsteen next going on tour in the U.S.?", "58": "Why did the band X never hit the big time?", "59": "Where are illegal immigrants crossing the US border?", "60": "What is the daily income of the volunteer working for SAMAJWADI POLITICAL PARTY in India?", "61": "Why does the UN consistently say Norway is the best country in the world to live in?", "62": "Why is money not the most important thing in life?", "63": "Who is Bashar al-Assad?", "64": "What is the Nobel Peace Prize?", "65": "What is the name of the Anglo-Indian 16th Lok Sabha?", "66": "What is the proper pronunciation of the word \"celtic\"?", "67": "Why did a majority of voters in Scotland reject independence from the UK in 2014?", "68": "How can you describe the levels of organization in an organism?", "69": "Which of the following is true about the graph of the rational function shown?", "70": "How would Hillary Clinton being diagnosed with pneumonia affect the presidential race?", "71": "What is psychological tricks?", "72": "Why do the Syrian refugees leave Turkey?", "73": "What is the cause of eye or eyelid swelling? How to get rid of it?", "74": "Which stands for the chemical disphosphorus pentasulphide: P4S10 or P2S5?", "75": "British supported whom in worldwar?", "76": "In science, what is resolution?", "77": "What kind of value system can maintain the value of humanity?", "78": "Where did the trojans go after the war?", "79": "What is the difference between i3, i5, i7?", "80": "How does it feels to be in coma for a long time?", "81": "Why do some Chinese people think it is difficult to learn English?", "82": "What is the origin of cut it out?", "83": "Which of the following is one of the conditions for the validity of Ohm's law?", "84": "What do Americans love about the UK?", "85": "What is magnetic flux?", "86": "What's the difference between larceny and robbery?", "87": "Why is Hillary Clinton losing?", "88": "What does it mean when a person wishes you happy birthday in a Facebook message not on your timeline?", "89": "Application of die steel?", "90": "What are guard cells and how do they function?", "91": "Who invented post its?", "92": "How are acorns produced in an oak tree?", "93": "What were the most violent native american tribes?", "94": "Why have human beings evolved more than any other beings on Earth?", "95": "After the independence of India in 1947, why were Indian and British flags raised equally? Why wasn't only India's flag raised?", "96": "What is the heat transfer coefficient of smoke?", "97": "How does the board game Monopoly end?", "98": "What is the value of [math]\\frac{1}{1-\\sqrt{2}}\\div\\frac{1}{1-\\sqrt{2}}\\div\\frac{1}{1-\\sqrt{2}}\\div\\frac{1}{1-\\sqrt{2}}\\div\\ldots[/math] up to 100 terms?", "99": "Who is Sathya Sai Baba? Is he God?", "100": "How does the structure of the education system in South America compare to the edcuation system in Central America?", "101": "What is the difference between electrons in the mitochondria of an animal cell and mitochondria in the plant cell when cyanide is added?", "102": "How does a civil offence differ from a criminal offense?", "103": "Why are so many people opposed to suicide?", "104": "What do you mean by enterprise mobility solutions?", "105": "What are some mind-blowing facts about the World War II?", "106": "What is the treatment of stretch marks?", "107": "What are the characteristics of a Libra Sun/Leo Moon/Pisces Rising man?", "108": "What causes throat bleeding?", "109": "How do astronauts scratch their nose in their spacesuits?", "110": "How will the anime One Piece end?", "111": "What can cause a thick white discharge with a fishy like odor during pregnancy?", "112": "How many sports bars are there in the U.S.?", "113": "How is lateral inhibition telling the cell not to fire?", "114": "What is your review of Sons (2006 movie)?", "115": "What is the difference between love and addiction?", "116": "Why should the Fynd app be considered over Myntra and Flipkart?", "117": "What is the importance of Thanksgiving?", "118": "Why social media criticizing Narendra Modi for not having war with Pakistan after Uri attack?", "119": "What is the procedure for changing the name of listed companies in India?", "120": "What is the difference between a Mufti, a Sheikh, a Mullah, an Ayatollah and an Imam?", "121": "What is social context?", "122": "What is the difference between Calcium and Calcium Sulfate?", "123": "What is recession?", "124": "What if the axis had won at Stalingrad and carried out case blue?", "125": "What were the reasons for the decline of Buddhism in India?", "126": "Why Delhi is more polluted than any other cities of India?", "127": "What is a bilateral pulmonary embolism?", "128": "What is Amazon's return policy for textbooks?", "129": "What is the reason that Great Grand Masti got leaked before the release date? What should Bollywood do that will prevent to leak any movies?", "130": "Which cigarette has the lowest amount of nicotine in Bangladesh?", "131": "What is the difference between freudian ego and buddhism ego?", "132": "Where do flower shops get flowers?", "133": "What are the differences between Chinese and Western diet cultural?", "134": "How does a malt differ from a milkshake?", "135": "Define the term art and aesthetics?", "136": "How does the block chain work?", "137": "How has German preserved its grammatical cases while most other Germanic languages have lost theirs?", "138": "What is the cap for Hack reactor cohort?", "139": "Evaluate the assertion that interviews in qualitative research are characterised by struggle between interviewer and interviewee?", "140": "Why do women not provide more sex to males to reduce the demand and bring down demand for prostitution?", "141": "What's the wisdom of not knowing?", "142": "What do Shahrukh Khan and Sahid Kapoor use on their hair?", "143": "Where should smoking be banned, and why?", "144": "How important is punctuality in business?", "145": "What is a supermoon? Why it is different than a full moon? How frequently does a supermoon occur?", "146": "What is the Laplace transform of t^(1/2) * e^ (-1/t)?", "147": "Why do so few people live in Greenland?", "148": "Why do US school grades go A, B, C, D, and F. Why not \"E\"?", "149": "How can you express the narratives of heroic deeds?", "150": "How deep sea creatures survive under so high water pressure.?", "151": "What does 4k resolution mean?", "152": "How are laws passed in India?", "153": "Who named our planet earth, and why earth?", "154": "What do credit card billing addresses mean and how are they used?", "155": "How safe is traveling to Israel given the periodic unrest?", "156": "How do SPARC and x86 Solaris differ?", "157": "How are stretchy fabrics made?", "158": "What is d diff betwn Android 7.0 update - dwnloadng thru' OTA available on website & waiting for an auto update? Is it same as Buffet & Á la carte?", "159": "What song plays over the end credits to the movie The Calling?", "160": "Why does Turkey wants to join the EU even when they don't want her in?", "161": "What is the use of hexadecimal and octal numbers in a computer?", "162": "How did you get away with murder?", "163": "What are the uses of ammonium alum in cooking?", "164": "If the professor on Gilligan's Island can make a radio out of coconut, why can't he fix a hole in a boat?", "165": "Why do we sweat more on the head?", "166": "What kind of camouflage pattern this?", "167": "What is VGA?", "168": "What font is being used here in State University of New York at Albany logo?", "169": "What do you mean by \"hi\"?", "170": "Why would someone choose to work at DreamWorks Animation over Pixar?", "171": "What is the molecular equation for calcium chloride and silver nitrate?", "172": "How are enzymes and substrates related?", "173": "What does musk smell like?", "174": "Where could El Chapo be now?", "175": "What is a sandbox in Sinon.JS?", "176": "Why is it hard for a Chinese guy to get an American girl?", "177": "Why does Narendra Modi keep a beard? Is there a particular reason for his not shaving?", "178": "What is a sociological novel? How does it differ from other kinds of novels?", "179": "When did Travelzoo launch its IPO?", "180": "Operating Systems: Why do we need logical memory at all? Why can't we do whole paging with physical memory only?", "181": "What is a lee wave?", "182": "In SimCity BuildIt, how important is it to build the airport?", "183": "What is it like to be a pregnant teenager in India?", "184": "What is it like working for postmates?", "185": "What would happen if the Penguins of Madagascar met the Minions?", "186": "Why does chicken reheated in a microwave smell terrible?", "187": "As an immigrant, how did you feel after arriving in the US?", "188": "Difference between a Wish list and Registries?", "189": "What is unique about Kerala which stands out from other states?", "190": "What are advantages & disadvantages of closing an adult congenital left to right shunt type atrial septal defect?", "191": "What does RPM mean in a car?", "192": "What is the truth about life after death since there are some unconfirmed examples?", "193": "Why do I not feel remorse?", "194": "Why there is no atmosphere around many planets then why does earth has atmosphere?", "195": "How is China's new satellite unhackable?", "196": "What does 'assault by beating' (UK law) mean in layman terms?", "197": "What is difference between String args [] or String [] args?", "198": "What advantages does an alternating current have over a direct current?", "199": "Why do some people like using foul language?", "200": "What role should India, the largest democracy in the world, play to help the people of Hong Kong achieve independence from communist China?", "201": "What is the difference between long term, short term and medium term loan?", "202": "Why can't dark matter be displayed by matter where the state of displacement of the dark matter is curved spacetime?", "203": "What do you think of Donald Trump's victory?", "204": "What was the main reason behind cancer disease?", "205": "What is the mezzanine of a theater used for?", "206": "What does ASEAN countries think of Russia?", "207": "Why do some afro American claim that original north African were black?", "208": "What's the technology behind Manymo, the web based Android emulator?", "209": "How do the Americans view German people?", "210": "What is Pink Floyd's \"Wish You Were Here\" about?", "211": "What is the difference between Chase Sapphire Preferred and regular Chase Sapphire?", "212": "What is the difference between machine learning and deep learning?", "213": "What does it mean when the dispatch says bith sets of numbers when running my name during a traffic stop?", "214": "What is automation test framework?", "215": "What does FIT mean in the tourism industry?", "216": "What is a surrogate son?", "217": "Men, what do you consider as modest in women's clothing?", "218": "What is a money tree?", "219": "How Rs 500 and 1000 ban help to take out black money? Say someone has 20 crore Rs , which he didn't mentioned to income tax department.", "220": "How were hieroglyphics first decoded?", "221": "What is considered to be plagiarism?", "222": "What do Pakistani people think about uri attack and about their own country after that?", "223": "Who is the father of metal?", "224": "What is warm love?", "225": "Why do I feel like I did not sleep?", "226": "What is the American government hiding about 9/11?", "227": "What are some generally unknown facts about Ancient India?", "228": "How many Bollywood Actresses are comedian in real life?", "229": "What is the inverse of[math] f(x) =4^x[/math]?", "230": "What is the orbital diagram for nickel?", "231": "Why does the porridge bird lay its eggs in the air?", "232": "What does the saying \"done and done\" mean?", "233": "How many digit numbers can be formed from 1-2-3-4 without repeating the same digit?", "234": "How is the relationship between India and other countries?", "235": "What is MIT?", "236": "Why are escalators necessary in public places?", "237": "Do living things have their own gravitational pull? If so, what causes it?", "238": "Why do companies that take over smaller companies lay-off the mid/low level employees rather than laying off the top-level management?", "239": "What are your opinions on Donald Trump and his presidential campaign?", "240": "What is the corporate culture like at Associated Bank? How is the culture different than other companies?", "241": "Why does this function in JS not work?", "242": "What are all the arguments against gay marriage?", "243": "Why do you meditate and why should you meditate?", "244": "Why do companies need to prepare a Funds Flow Statement, when they are already preparing many other financial statements to present their financial position?", "245": "What are some wholesale drop shippers that have Rokinon lenses and Canon cameras?", "246": "What is Sap hybris architecture?", "247": "What are the benefits to learn Spanish?", "248": "How many types of cheese are there? What makes them different?", "249": "How is MCOMs Nepal?", "250": "What is bionic eye?", "251": "Why was James Madison suspicious of factions?", "252": "What is meant by synchronization in technology?", "253": "What is the meaning behind the song \"Slide\"?", "254": "What is the scope of ACCA in Pakistan?", "255": "What does \"meta\" mean?", "256": "If Donald Trump is a racist, why did Ben Carson endorse him?", "257": "What do you admire about Donald Trump?", "258": "What is the difference between a republic, the form of government, and Republicanism, the political ideology?", "259": "Why did Daksha Prajapati curse Chandra Dev to wither and die?", "260": "Why were bikinis invented?", "261": "How is TCS Nagpur?", "262": "Where does the money actually go if someone fails to deposit old Rs 500 or Rs 1000 notes to the bank before the 31st of December?", "263": "What is Adempiere’s Architecture?", "264": "Why are there three states in United States called the “Commonwealth of XXX” rather than “State of XXX”?", "265": "How does the business model of SessionM differ from Kiip?", "266": "If India is the second largest in population, why do they not have Olympic medals like China or the US?", "267": "What do you think about this dark intriguing indie-shortfilm \"Complex\"? Do you think India has a market for such films?", "268": "My Resume Status in the WIPRO candidate desktop has changed from \"null\" to \"to offer\" after I gave the HR interview yesterday. What does this mean?", "269": "Where do you find sloths?", "270": "What's going on with MySpace and their platform initiatives?", "271": "What is a market economy? What are its characteristics?", "272": "Why am I seeing so many answers in my feed written several years ago by people I follow?", "273": "What causes tigers to be so angry all the time?", "274": "What are some contrasting aspects of China?", "275": "What is the difference between convenience food, fast food and junk food?", "276": "What are specialized cells and what are some examples?", "277": "When will Quora see the light and allow more than three lines of question details?", "278": "How big is the difference between Tagalog and other regional languages in the Philippines?", "279": "How many cities, towns, and villages are there in India?", "280": "What is the CIF Harare price of PEC2540 diesel engine crusher Zimbabwe?", "281": "What is gerrymandering? What are some examples?", "282": "What are the differences between college and NFL football fields?", "283": "What does it mean to be moral?", "284": "Why do liberals and democrats fight so hard for individual cases rather than larger issues?", "285": "What are the pros and cons of being a student athlete at an Ivy League?", "286": "How many baleno does Maruti Suzuki produce in a day?", "287": "What is the difference between an R user and an R programmer?", "288": "Why is Google Chrome so unresponsive on Android?", "289": "What are some insane facts about Greek mythology?", "290": "How come a person blacks out during a fight?", "291": "What is refraction index?", "292": "How is life in Darjeeling?", "293": "What is the sap course?", "294": "How true and accurate are exit polls?", "295": "What does a star inside of a circle represent?", "296": "What advantages does a backlit keyboard offer?", "297": "What is the origin of human existence?", "298": "What are Authentication Factors?", "299": "What are the features of spring framework?", "300": "Why isn't CO[math]_2[/math] an organic compound?", "301": "What actions (if any) are movie theaters taking after the Dark Knight / Aurora shooting incident?", "302": "What is the scope of a private space agency in India? Will the government support it?", "303": "What are the mechanics of how Wall Street analysts calculate or predict a company's target price per share?", "304": "How do planets stay suspended in space?", "305": "What are some stereotypes and connotations of accents and dialects in languages aside from English?", "306": "How real is professional wrestling?", "307": "Why do most UI Design concepts never make it to production? There's tons on dribbble etc, but having a look at some mobile apps, they're terrible", "308": "Why do I feel like I am in the Truman Show?", "309": "Why do my questions need improvement when I met the criteria?", "310": "What was Joseph Goebbels' IQ?", "311": "What is the salary structure of Motorola India?", "312": "Why is the Japanese yen considered a safe haven to invest?", "313": "Every vegan out there, what is your opinion on abortions?", "314": "When was the franco-prussian war?", "315": "What are the applications of differentiation?", "316": "Why are DoorDash delivery fees going up?", "317": "How does a brothel account for its business?", "318": "A box contains 2 red, 3 black and 4 blue balls. 3 balls are randomly drawn from the box. What is the probability that the balls are of different colors?", "319": "Why is North Korea so different from the rest of the world?", "320": "What are some mind-blowing optical illusions?", "321": "What hotel in Lachen Hill-station would be safe for unmarried couples, without the harassment of police, hotel staff, and moral police?", "322": "What is the value of a such that √3sinx−cosx−2ax+b is decreasing for all real values of x?", "323": "What is meant by censors?", "324": "What are the benefits of aloe vera?", "325": "Why is RBI not issuing new 1000 Rupees notes?", "326": "What is the difference between mouse and a rat?", "327": "Why is Selena Gomez depressed now?", "328": "What are the side effects of eating chocolate?", "329": "If there are so many proof against Pakistan carrying terror attack on India why doesn't India approach UN to take action against Pakistan?", "330": "What causes diarrhea?", "331": "What the lhc?", "332": "Why there is no version of Cheese Burst for small and large pizza in Domino's?", "333": "How do Déjà Vus happen?", "334": "Why do companies buy companies?", "335": "What is the formula for the brute force algorithm?", "336": "What was the Treaty of Versailles?", "337": "Why does Jimmy Wales go around answering people in Quora?", "338": "What is unconsolidated particles?", "339": "What is the definition of life?", "340": "How does Vastu shastra work?", "341": "What does chlorophyll do?", "342": "What is the likelihood of an assassination attempt on Trump?", "343": "What happens if we go up in space?", "344": "Why is our culture so obsessed with celebrities?", "345": "What are examples of sentences with the word \"abashed\"?", "346": "What are nonprofit organizations?", "347": "How are pedophiles treated in prison?", "348": "How does Brexit affect India?", "349": "Why and how is 0! =1?", "350": "If w is brownian motion t is time, how dw^2=dt?", "351": "Why do so many people ask or answer questions anonymously in Quora?", "352": "What if we had kings now?", "353": "What is difference between Authorisation and Authentication?", "354": "List me some compaitable elements to be added on Nickel to increase its catalytic capacity for anode on direct Ethanol fuel cell?", "355": "What names are leaked in the Unaoil scandal?", "356": "Why don't some Brahmins eat onion and garlic?", "357": "How is laissez-faire related to capitalism?", "358": "How are Julius Caesar and Alexander The Great similar?", "359": "Why do children and old people behave similarly?", "360": "What causes a sore throat to only occur at night?", "361": "What is the longest time the US has gone without some kind of civil war?", "362": "Why did Romney make his Vice President announcement during the weekend?", "363": "What are the known causes for depression?", "364": "What is the future of AI?", "365": "What kind of people dislikes kind and generous people?", "366": "What is the total box office collection of 1989 Telugu movie \"Shiva\"?", "367": "What is the health impact of drinking Red Bull?", "368": "How does Steven Cohen invest?", "369": "What has Elon Musk achieved?", "370": "What is the hierarchy structure of nomura India? What are the approximate salaries of each designation?", "371": "How do the Chinese eat sauce with chopsticks?", "372": "What do you think about Amway business and its product?", "373": "What is thermodynamics and entropy?", "374": "What does the expression \"Well done is better than well said\" mean, and where does it come from?", "375": "What is it like to live in Israel and be an atheist?", "376": "What is cost of fund?", "377": "How is the work culture and pay at Sophos?", "378": "Why is Africa tagged as a corrupt continent?", "379": "What is Banksy's greatest piece of street art, and why?", "380": "What is agricultural product?", "381": "How do chocolate morsels and chocolate chips differ?", "382": "What is a brief summary of Marilynne Robinson's \"Housekeeping\"?", "383": "How many programming languages does Facebook use and how do the languages connect with each other?", "384": "Why was no report issued by the NTSB on any 9/11 flight when they have done reconstructions and issued reports on civil aviations crashes since 1962?", "385": "What is the difference between fibre, yarn and fabric?", "386": "How is Ancient Eyptian history divided?", "387": "What is the full form of AM and PM?", "388": "Why girls are not interested in introverts?", "389": "Why are police officers so fat?", "390": "Who decides the Poké Stops in Pokémon GO and how come there are pokestops in India if the game has not yet released here?", "391": "If Britain decides to exit the EU, how would it affect the Indian Economy?", "392": "What is meant by Bitcoins?", "393": "In nuclear reactor reactions, \"4H -> He+ 2positrons and some gases... Then, what happens to helium in above reaction?", "394": "What are the difference between Mumbai and Delhi Girls and Boys?", "395": "What are the reasons why you believe in God?", "396": "What is Shark Tooth Island in Poptropica?", "397": "What is there after the observable universe?", "398": "Why do people act smart?", "399": "What makes Earth to rotate on its axis?", "400": "What should you take into consideration when driving from Brooklyn to Staten Island, and how does it compare to driving from Brooklyn to Manhattan?", "401": "How is solar energy converted into electricty?", "402": "Why do we get frightening dreams?", "403": "In mathematics, why is the product of two negative terms is positive? And also why is the product of a positive term and a negative is negative term?", "404": "What is the size of the US online travel media market?", "405": "The Quran: Why are so many Muslim girls named Aisha?", "406": "What is the real meaning of being a freethinker?", "407": "How are Corn Nuts (corn gone wrong) made?", "408": "What are some mind-blowing facts & trivia about Indian Film Industry ?", "409": "How do F1 cars generate so much horsepower with such small engines?", "410": "EpicMealTime: How did the guys behind \"Epic Meal Time\" first come up with the idea of the online hit?", "411": "What is the story behind Seeley Booth's cocky belt buckle in Bones?", "412": "When and why did you learn a new programming language?", "413": "What is the main function of a cell membrane in a plant cell?", "414": "What is any CA doing taxation for a company incorporated in the US?", "415": "To what degree are some of the conspiracies of the Rothschild true?", "416": "What are the names of months as per the Hindu calendar, and what is their significance vis-à-vis festivals or rituals?", "417": "Why do some people use \"…\" at the end of all their sentences?", "418": "If we're looking back in time when we view the most distant galaxies, how can we predict their distance and velocity?", "419": "Is there a reason why nuclear bombs were only used on Japan and not on Germany?", "420": "What is the scope of supply chain management in India?", "421": "Why are college rankings considered bad?", "422": "What if we put a metal in reactor to decrease temperature?", "423": "What is the witching hour in occult belief, and why is it at 3 AM? How does it compare to the Devil's hour?", "424": "What is the CHEMISTRY aspect of Ambien CR?", "425": "Why does a stylus stop working? Can it be restored?", "426": "What is the Great Depression all about?", "427": "What happens when an Android phone is rebooted?", "428": "Why do some people call Mustafa Kemal Ataturk dictator?", "429": "What were the major effects of the cambodia earthquake, and how do these effects compare to the Sohei earthquake in 1361?", "430": "What is life without dreams?", "431": "What is the basic ideology of Marxists?", "432": "What happens to Migrants when they arrive in the UK?", "433": "What is the difference between Linux Mint mate and cinnamon?", "434": "How safe is using Neosporin on cracked lips?", "435": "It seems like Captain America shield is so strong, why can't IronMan make a suit out of it?", "436": "Why doesn't the proton in a hydrogen nucleus pull in its electron?", "437": "What is your review of Virender Sehwag (cricketer)?", "438": "Why don't British people brew tea like Iranian people placing the tea pot over the kettle?", "439": "What are the main biological functions of lipids?", "440": "Why do people like reading tabloids? Is it seen as an escape from bigger problems?", "441": "How is the square root of 160 simplified?", "442": "What are the safety parameters of north east India if one needs to travel there as a tourist?", "443": "Why are Windows phone more popular compared to other mobile phones?", "444": "What is jet fuel?", "445": "\"Electrons feel the force exerted by a magnetic field\". Is this statement correct and why?", "446": "How can you explain the difference between democrats and republicans to a 10 year old?", "447": "If every state of India had its own tagline, what would It be?", "448": "What is mean by immigration?", "449": "Why do you, personally, believe in conspiracy theories?", "450": "How many Bollywood Actresses are showing camel-toe in real life?", "451": "What you think about the Mexican people?", "452": "Why are so many Quora questions about airplanes and flying?", "453": "Why is Lua-Wget often used for web scraping?", "454": "What does Ballroom Dance mean to you?", "455": "What is a wave in electronics?", "456": "How can excessive sitting affect human health?", "457": "How does Buddha come to the conclusion that the self does not exist?", "458": "What is wrong with the Indian national anthem? Why do some people oppose it?", "459": "What is the role of Indo-Israel relationship in favour of India?", "460": "What fuel system powers the Curiosity Mars Rover?", "461": "Why would a dog have a grey tongue?", "462": "What causes a computer virus? How do you remove computer viruses on your PC?", "463": "How did Palpatine kill Darth Plagueis?", "464": "What is it like to raise a Persian cat?", "465": "What are the basic child support guidelines from Kansas, and how do they compare to those from Kentucky?", "466": "What is it like being a nonwhite immigrant in a Scandinavian or Nordic country?", "467": "What is the correct pronunciation of the word \"via\"?", "468": "Why can't some people be nice?", "469": "Why is it that you die when you cut some arteries (or vein) of your hand, but you don't die when your arm is cut?", "470": "Why is my Quora digest email so much more interesting than my feed in the app or on the website?", "471": "How do you accept that grading systems are unfair because two students of very different standards can seem equal?", "472": "Why is the firm's marginal cost curve equal supply curve?", "473": "Why do people feel like they can tell others what they feel?", "474": "If Charles's law is based on absolute or Kelvin scale temperatures, then in derivation of absolute zero, why does Charles's law relate volume to Celsius temperatures?", "475": "Why does my butt hurt after pooping?", "476": "What is Uraga Vagga about?", "477": "Who invented ice cream?", "478": "Why is sodium hydroxide a strong alkali?", "479": "Why are some Americans so bad at geography?", "480": "How do girls expect or like guys to start a conversation on dating apps like OkCupuid and Badoo?", "481": "How successful is the income declaration scheme by Indian government?", "482": "How beneficial has the Syrian civil war been to the security and long term future of Israel?", "483": "Why are food so expensive in the airports? Are they just playing monopoly or the rents there are very expensive?", "484": "What is the difference between tube and pipe?", "485": "What can communities do to protect from groups of people who victimize themselves?", "486": "How do Trump supporters feel about his cabinet nominees?", "487": "How is MCA at VIT University?", "488": "Why do so many poor and homeless people in India have light colored hair?", "489": "What dirt is there on Bernie Sanders?", "490": "How does the rest of world perceive, understand, view and opine about Abrahamic religions?", "491": "What is IBM Watson?", "492": "How would the 4400 season 5 have finished, if it hadn't been cancelled?", "493": "What happens if a dictatorship continues in the present day?", "494": "How does a leadership development firm break into the mental health and recovery arena to provide training/coaching for decision makers of those treatment centers, so they can better serve their clients and employees?", "495": "What is the meaning of dreams about my teeth breaking/ falling out?", "496": "What's the scope of psychology?", "497": "How do blind guys masterbate?", "498": "What do Kerala people think about Narendra Modi?", "499": "What is a example of a real life situation where Avogadro's law can apply?", "500": "How do you know Jesus is the only way to heaven?", "501": "How does it feel to be featured on a newspaper for the first time in your life?", "502": "How many packaging boxes does Amazon use in a year and how many trees are cut down to produce them?", "503": "Why do many Americans accept social services like tax-funded police and fire protection, but not services like healthcare and higher education?", "504": "Why did MS Dhoni step down from the captaincy of limited overs?", "505": "What are the last lines of the finale that Rust says as he's walking with Marty?", "506": "Why does time seem to go so much faster as we age?", "507": "Human Physiology: What concentration of salt water will induce vomiting?", "508": "What is The Rapture? When should it happen?", "509": "What is Prosthetic group?", "510": "Why should you not eat room temperature caramel apples?", "511": "What if Chicago was the capital of Illinois?", "512": "What happens if you eat egg yolks for a month?", "513": "What do you think of the Battle of Mosul?", "514": "What is logistic regression?", "515": "What is the JAR file used in Java Spring?", "516": "What is the significans and importance of power factor?", "517": "What is it like to have sex with a gymnast?", "518": "What is the meaning of \"corporate disclosure\" ?", "519": "What are some examples of \"emotional marketing\"?", "520": "What is the property tax rate in Granville, Ohio? How is it compared to the one of Texas?", "521": "What is inside a Bed Buddy?", "522": "What are the different kinds of drums and how are they use?", "523": "What is Sacrificing love?", "524": "Why does my honey bottle have an expiry date?", "525": "What is a formal amendment?", "526": "What is the Anna Karenina principle?", "527": "Who invented the modern periodic table?", "528": "How many ways can the word \"fuck\" be used in the English language and what are some common expressions?", "529": "What's the difference between a bracelet and a wristband?", "530": "What do the molecular orbitals of 4-HNE look like?", "531": "What is daangar.com?", "532": "What is the Minerva Mills case?", "533": "What are the PS4 gamer tags of Quorans?", "534": "Why is Llaollao (the frozen yoghurt brand) so popular in Singapore at the moment?", "535": "Why did they dump Osama bin laden in the ocean?", "536": "How does Ban Ki-moon's performance as UN secretary general compare to that of his predecessors, such as Kofi Annan?", "537": "What is it like to be a 90s Indian child?", "538": "What are the functions of derivatives of rationals?", "539": "What's the difference between SaaS and the Cloud?", "540": "What are the survival chances of Earth having a black hole near?", "541": "What is Earth's life-support system?", "542": "Why are the centre lathes made tapered?", "543": "Why didn't any country besides Israel vote against the UN resolution condemning Israeli settlements?", "544": "How accurate is the CL IIM profilizer?", "545": "How does Charlie Rose choose interview questions?", "546": "What are the safety precautions on handling shotguns proposed by the NRA in Texas?", "547": "What was the reason behind India being called as Jambudweep in the ancient times?", "548": "What do investors think of Snapchat?", "549": "What are some examples of invertebrates?", "550": "Where does the Malaysia National Baseball team play?", "551": "What are the pros and cons of local law enforcement? What are the pros and cons of state law enforcement? What are the pros and cons of federal law enforcement?", "552": "What does a concept in C++ refers to i.e. semantics?", "553": "What does doodling your name signifies?", "554": "What are the causes of chronic constipation?", "555": "What are some stereotypes of the different Australian states?", "556": "If the Vatican is wealthy, why doesn’t the Pope deliver financial assistance to help poor and struggling Christian worshipers worldwide?", "557": "What is the hiring process in mRoads?", "558": "What do Albanians think of the 2008 English movie starring Liam Neeson, Taken?", "559": "What kind of conversations only happen in Australia?", "560": "Why did India banned 500, 1000 rupee notes?", "561": "How did Germany defeat France so easily during the World War II?", "562": "What are the functions of IMF?", "563": "How many kVA is needed to power a 3000 Watt bulb?", "564": "Why is Pokémon the best-selling game on Nintendo consoles?", "565": "Why did PM Modi fly to Japan after banning Rs. 500 and 1000 notes?", "566": "What was Waze developed in?", "567": "Why are my lymph nodes itchy and swollen from occipital to cervical posterior ones?", "568": "What tool is used to create hand drawn illustrations like this?", "569": "Why are some people afraid to think?", "570": "What are the definitions of classical probability, empirical probability, and subjective probability?", "571": "How hydrogen bond is directional?", "572": "What are the side effect of sartaline?", "573": "Who are the 'they' in the movie Interstellar?", "574": "How does Vijay mallya duping the banks and leaving the country affect normal people?", "575": "Why do people make fun of others for their entertainment?", "576": "What does a melanistic Jaguar look like?", "577": "What makes football the beautiful game?", "578": "What's it like to serve in the IDF?", "579": "If the Big Bang created everything, how did the Big Bang happen if there was nothing before it happened?", "580": "How does Northwestern's undergrad computer science program compare to those of Ivy Leagues such as Penn?", "581": "If you are a Trump supporter and Donald Trump loses very badly in November, what if anything will that tell you about America?", "582": "What was Cuban Missile Crisis?", "583": "Why should I accept Islam?", "584": "Why do we first find the prime numbers up to square root of N in segmented sieve?", "585": "How many different species of jellyfish are poisonous to humans and which ones can be potentially fatal?", "586": "How is the equation for the formation of acid rain determined?", "587": "How many questions asked from microprocessor in gate2016 for EE?", "588": "As ALL matter is created soon after the Big Bang, and in a relatively small area, why doesn't it collapse into a black hole under its own gravitation?", "589": "What is the difference between a culpable homicide amounting to murder and a culpable homicide not amounting to murder?", "590": "What will be the impact of demonetization in India?", "591": "What does compact() do in Laravel?", "592": "What are psychological barriers?", "593": "What are the differences between biotic factors and abiotic factors?", "594": "Why do women have casual sex?", "595": "What is the Apple Mac Technical Support Phone Number?", "596": "What is Yelp's average CPM?", "597": "What are the pros and cons of implementing a uniform civil code in India?", "598": "How do Filipinos see the Spanish?", "599": "Why is there so much of pay disparity between government and private employees here in India?", "600": "What is castor oil used for?", "601": "What is the difference between a carburetor and a fuel injected system?", "602": "What does an IQ test measure?", "603": "What do chloroplasts do?", "604": "Who are eligble for october salary hike cycle?", "605": "Explain Sugar is macrostructure or microstructure?", "606": "What is the exact difference between programming languages and scripting languages and their types and their real time applications?", "607": "\"How does yoga result in weight loss? I mean, we sweat so little?\"", "608": "What are blowers and compressors used for?", "609": "Why doesn't Amazon ship to Singapore?", "610": "At what has Apple failed?", "611": "How far are we from gender simulation?", "612": "What can go wrong if Trump becomes the US president?", "613": "What will happen to British Royal family once UK becomes Muslim country?", "614": "What will be the effect of banning of INR 500 and INR 1000 notes in India?", "615": "Trump won the 2016 presidential election. What is your reaction?", "616": "What are the government issues in the Philippines?", "617": "What is Pizzagate and how real is it?", "618": "Who is the hero in Breaking Bad?", "619": "What is parta by darpa?", "620": "What is the name of the compound HBrO4?", "621": "What is missing number in this series 16,47,75,106,___, 167?", "622": "In a nerve cell, what is the process where sodium is pumped out of it?", "623": "Why does ice melt under pressure? How is the process carried out?", "624": "What exactly is the Kremlin's function and does anyone live there?", "625": "How is it to be a doctor?", "626": "Why do many Americans like to go on and on talking about their feelings?", "627": "Why do most men think women are subordinate to them?", "628": "What is the difference between a circle and the circumference of a circle?", "629": "How do magic mugs work? What is used for the heat sensitive coating?", "630": "Why are lesbians attracted to me?", "631": "What are the differences between iambic and trochaic meters?", "632": "Why do you think 50% of people voted for slightly racist Donald Trump against Ted and Rubio in the Primary?", "633": "What payment gateways are available in Myanmar?", "634": "How does it feel to live in North Korea?", "635": "Why is anybody with blue eyes and blonde hair known as beautiful?", "636": "What is the scope of an MSc in nanophysics?", "637": "What changes have been done to split buffer as compared to the original OS?", "638": "How can the population of India be controlled?", "639": "What is currency war?", "640": "What did Pete Rose do?", "641": "Why is the movie called Black Mass?", "642": "Who is Modi?", "643": "What is automatization?", "644": "What do Americans think about Scottish people and/or Scottish Independence?", "645": "Why should we protect threaten and endangered species?", "646": "What are the horrors of C++?", "647": "How much did Lance Armstrong pay to the Sunday Times to settle a libel case?", "648": "What are the benefits and drawbacks to a cashless society?", "649": "What is the difference between an IIT graduated engineer and an Local college graduated engineer?", "650": "Why does -x/x = 1?", "651": "Why did Satan decide to fall from heaven?", "652": "Why is Jimmy Wales answering on Quora all the time?", "653": "Which personality traits are more influenced by genes?", "654": "What are the characteristics of a mudpuppy circulatory system?", "655": "What's the difference between foundation, compact powder, BB/CC creams, mousse, and concealer?", "656": "What is the difference between a tax and a duty?", "657": "What is it like to attend a State of the Union Address?", "658": "What do you think about Greek football?", "659": "What is the difference between Computer Science and Computer Engineering?", "660": "Why is Apple Music important for Apple?", "661": "Why are my questions on Quora so stupid?", "662": "What mental disorders result in people scratching themselves to the point of bleeding (like in Black Swan)?", "663": "Why isn't fire attracted by the Earth's gravity when you fire any object? Why does the fire always go upwards?", "664": "How many meters above sea level is Vancouver? How does effect the local weather patterns?", "665": "What is the reasoning behind launching the note of Rs 2000 in India?", "666": "Why do Indian media still lie about the India-China war in 1962 right now today?", "667": "Why do many expats living in the Philippines think they know who is best qualified to lead the Philippines?", "668": "How many users does Microsoft Excel have?", "669": "How is Donald Trump viewed in China?", "670": "What is being religious?", "671": "What is the exact meaning of \"your time is limited so don't waste it living someone else life\" by Steve jobs?", "672": "What can be added to vanilla ice-cream that most would think of as appalling, but actually is not?", "673": "How do you explain NP Complete and NP-hard to a child?", "674": "How painful is it to get a lip piercing?", "675": "How is a synchronous motor started?", "676": "What are the Aims and objectives of transportation?", "677": "How is the Eurovision Song Contest scored?", "678": "What is the difference between a ghost and a spirit?", "679": "What are soul vultures? Is it related to religion conversion or is it another spiritual procedure?", "680": "What are biggest misconceptions about Narcissistic Personality Disorder?", "681": "Why can't an electron stay inside the nucleus of atom?", "682": "Why do we yawn? What is the reason?", "683": "Can you explain how this sentence is correct grammatically?", "684": "Why is it difficult to maintain friendships?", "685": "How many CCTV cameras has Arvind Kejriwal installed in Delhi so far?", "686": "What will happen to Indian Army in future?", "687": "Why do old books smell so good?", "688": "Where was Friday Night Lights filmed?", "689": "Why does increase in price level result in increase in interest rates?", "690": "What is data science process?", "691": "What are the uses of thermal energy?", "692": "Why does Donald Trump seem to hate Obama?", "693": "What do you think of Steven Spielberg?", "694": "What is it like to be a computer programmer?", "695": "Who is God and why is he present?", "696": "What does the Indian Ocean floor look like?", "697": "What can cause the back left side of my neck to feel so tight, could it be serious? ", "698": "What are the applications of opamp?", "699": "How does the digestion of proteins begin?", "700": "Why are there spear tips on German army helmets in WW1?", "701": "Human Body: Why do I feel sleepy in the morning even after getting six hours of sleep?", "702": "For companies offering unlimited days off, how do they handle payout of days off during the transition out of an employee?", "703": "What is the difference between sarcasm and wit?", "704": "What is it like to be a loco pilot?", "705": "What is the Pacific Ocean? Where is it located?", "706": "Why do we associate love with the heart?", "707": "What does 3.3e-5 mean?", "708": "What is the reason of computer hanging?", "709": "Where do cognitive radio distinction come from?", "710": "How is \"belligerent\" used in a sentence?", "711": "How do feminists feel about Milo Yiannopoulos and his views?", "712": "What would the world economic and political balance be like if the British and French decolonization had not happened?", "713": "What are your views about marriage?", "714": "Why is high fructose corn syrup worse for me than cane sugar?", "715": "Why hasn't a space elevator been invented?", "716": "How old is trump?", "717": "What are the symptoms of protisits disease?", "718": "Why should I visit your country?", "719": "What is the molarity of the concentration of glacial acetic acid?", "720": "Why wouldn’t a father be protective of their daughter during adolescence?", "721": "What is the difference between \"his laugh\" and \"his laughter\"?", "722": "What is net banking?", "723": "What could be possible examples of Greek mythology in the modern world?", "724": "Why does the United States hate Russia and Putin?", "725": "What is the use of a damper in a boiler?", "726": "Who inspired Swami Vivekananda to attend Parliament of world's religions in 1893?", "727": "How do venture capitalists actually work?", "728": "What types of crimes does the FBI have subject matter jurisdiction?", "729": "What are Precision turned components?", "730": "Why Indian Muslim and dalit are killing because they are eating beef.?", "731": "Why doesn’t the indian television media report the crimes against indian children perpetrated by foreign NGOs?", "732": "What is the main function of the Federal Reserve Bank in Cleveland?", "733": "What is the width of instruction in 8086?", "734": "Why is Social service for children in Norway so strict?", "735": "Why is walking downhill so hard?", "736": "When do we run out of oil?", "737": "What is a plane surface?", "738": "Why are millimeters included on a ruler?", "739": "What is the absolute refractive index?", "740": "What are sharpies made of and how are they made?", "741": "What is the scope of law for girls in India?", "742": "What does \"irony of ironies\" mean?", "743": "Why are college loan interest rates so much higher than mortgage and auto loans, and the rate the banks borrow from the federal government?", "744": "Which is the correct phrase, \"pair of shoes\" or \"pairs of shoes\"? How are they used?", "745": "What is iVectorize.com?", "746": "How many birds are required for a flock?", "747": "What are correct saree accessories & make-up for women, aged 35-45? I am European and don’t want to offend or look crazy.", "748": "Orthodontics: How important is it for a child to get braces if they have relatively straight teeth (but not perfectly so)?", "749": "Why do we need study history?", "750": "Why don't photons have mass?", "751": "What are some remarkable facts about Sweden?", "752": "What is some music like the late period of Swans, considering Michael Gira is dissolving the current incarnation after this tour?", "753": "How did See full summary (2016 movie) get greenlit? What's the backstory of how the movie got made?", "754": "Why do I laugh when I'm nervous?", "755": "What is the price of Hash and weed in Kasol?", "756": "What is the meaning of modes in vibration. Is it the natural frequency of the material?", "757": "What is a normal sputum culture?", "758": "What does the media covering the White House think of Obama?", "759": "In English, why does the word “hundred” remain in its singular form regardless of the number preceding it (one hundred, two hundred, ten hundred)?", "760": "Why do I suddenly feel so sad without any reason?", "761": "How/why did Stanford develop such a strong entrepreneurial culture? Why doesn't UC Berkeley have such a strong entrepreneurial culture in comparison?", "762": "How could America improve inner cities?", "763": "Who is the worse father, Tywin Lannister or Randyll Tarly?", "764": "Why doesn't Stevia have any calories?", "765": "What kind of animals are distinct to North America?", "766": "What would happen if North and South Korea went to war again? Would it matter if the South struck preemptively?", "767": "Why India can't win medals?", "768": "How did the French and Indian War start?", "769": "What does the ºДºщ emoticon mean?", "770": "What are some interesting theories about life after death?", "771": "Who is the voice of Stewie on Family Guy?", "772": "Why is there political correctness within society?", "773": "What was the Russian Revolution's impact on the world?", "774": "How the trainer profile impact digital marketing industry?", "775": "How are Macs almost immune to viruses?", "776": "Why are there a lot more women who become porn stars than men?", "777": "How have agricultural revolutions changed the arrangement of human societies?", "778": "What causes red ear wax?", "779": "What exactly is digital art?", "780": "How does an answer get collapsed on Quora?", "781": "Why don't we seek conviction in life?", "782": "Python Web Frameworks: Is there any reason why one would use Django over Tornado?", "783": "What were the effects of the Mauna Loa eruption?", "784": "What are some common USPS' tracking problems?", "785": "What happened to Daenerys on the funeral pyre?", "786": "What is the origin of the word \"mate,\" and why do British people have a tendency to call each other that?", "787": "What's your impression of Chinese people as a \"foreign person\"?", "788": "Why dispersion of light do not occur in vaccum or air medium?", "789": "Where are we in the universe?", "790": "How do JNU students justify their anti-national slogan \"Bharath tere tukde honge, Inshallah, Inshallah (India will break into pieces)?", "791": "How did Bad Boys 3 (2017 movie) get greenlit? What's the backstory of how the movie got made?", "792": "How does Tesla tackle a plummet in gas prices?", "793": "What does cooled lava look like?", "794": "What is the Process of Lodge a Complaint against an Inspector In Charge, who mis behaved because I have not greeted before entering into the Police Station?", "795": "What is the difference between reflection and emission?", "796": "Why do we fail to achieve our goals?", "797": "What is the definition of \"dialetics\"?", "798": "Who invented poll surveys, and with what purpose?", "799": "How accurate is Fitbit's bioelectrical impedance analysis Aria scale?", "800": "What do you think of animals?", "801": "What is Gillette, Wyoming known for?", "802": "How do we know what we think are black holes aren't actually dark matter?", "803": "How does it feel when you get to know that you are just fighting to achieve goals or any other things and not living your life?", "804": "What is it in this picture and what is it's use?", "805": "How does grief over the loss of a dog differ from grief over the loss of human friend?", "806": "What is Wikianswers.com?", "807": "How come the moon has enough gravity to affect tides but very little gravity on its surface?", "808": "How does the three dimensional structure of Carbon, Oxygen, and Nitrogen cause them to form polar and non-polar molecules?", "809": "Why are disposable razor blades so expensive?", "810": "What is negative energy in physics?", "811": "Why is Kim Kardashian famous for nothing?", "812": "Can something be built under power lines? If not, why?", "813": "What is the difference between being agender and simply not caring about gender roles or stereotypes?", "814": "Where was the film If Only filmed in the Lake District?", "815": "What defies time?", "816": "How does terrorism effect all of us?", "817": "What is it like to live and work at Yakutsk, Russia?", "818": "What is the origin of the word o'clock?", "819": "Why are gravitational waves transverse?", "820": "What's the future of AngularJS?", "821": "How serious is racism in Poland?", "822": "How long did you work at the Rocky Mt post?", "823": "Why there are no more moon expeditions since 1972?", "824": "How do you imagine the power of gogetrunks in Dragon Ball?", "825": "What sort of symptoms should you experience if you are 3 weeks and 6 days pregnant?", "826": "How does one open his or her chakras?", "827": "Why do African women love wigs so much?", "828": "What is the remainder when 3^1000 is divided by 7?", "829": "What does \"LHS\" mean in math?", "830": "How is Christopher Columbus important in history?", "831": "What is difference between moving coil and moving iron ammeter?", "832": "What are some disadvantages of correlational research and what are some advantages?", "833": "What is the effect of altitude on the performance of Carburetor?", "834": "Why don't space organizations try to send spacecraft to planets like Neptune or Pluto?", "835": "How does Hubspot CRM know if a Contact has website Activity?", "836": "How credible is science daily website, especially their health and medicine with their news about nano medicine and stem cell breakthrough?", "837": "What do you mean by fee based products and fund based products?", "838": "What is the difference between an Abstract Class and an Interface in C++?", "839": "What is the grade of UltraTech Cement?", "840": "What are the benefits of long distance running?", "841": "How did Carole King and James Taylor meet?", "842": "What is the etymology of Sanskrit word 'Yoga'?", "843": "What are the arguments supporting/against dropping out of school and focus on self-studying through MOOC instead?", "844": "What factors are stifling the startup entrepreneurship ecosystem in China?", "845": "How does airconsole.com works? Is it a simple websocket made on Node.js or any other technoglogy?", "846": "Recreational Vehicles: What does it feel like to live year-round in an RV?", "847": "What is the difference between ministers of state with independent charges and ministers of state?", "848": "How do clogging and tap dancing differ?", "849": "Why do I feel anxious?", "850": "How did the end of the Cold War change the international system?", "851": "What is it that makes you angry?", "852": "What is the name of the cartoon (or anime) that was telecasted 10 years ago where the characters unleashed swords and they would be on dragons, while the dragons were inside the Robotic Zords?", "853": "Why are statistics important in research?", "854": "What are some examples of decomposers that could be found in a pond?", "855": "What rhymes with beds?", "856": "In countries like the US and Japan, how does the police measure the speed of cars?", "857": "Names of tanks in fury?", "858": "How is campho-phenique used in kids?", "859": "What is the plot summary of Anton Chekhov's \"The Bet\"?", "860": "Why so much anger against Tarek Fatah, Tathagat Roy comment that dead terrorists should be buried in pigskin?", "861": "Why can I see both the moon and the sun in the sky?", "862": "Why isn't email encrypted?", "863": "Why does a bad person become good?", "864": "What is the Value of infinity ×1?", "865": "What is the relationship between Mongolia and Tibet?", "866": "Why isn’t it possible to simultaneously see all twelve dots in the image below?", "867": "How does the film adaptation of \"A Clockwork Orange\" differ from the novel?", "868": "Why is climaxing early commonly seen as shameful in men?", "869": "Which is heavier: sand or water?", "870": "Which one of the numbers does not belong in the following series? 2 - 3 - 6 - 7 - 8 - 14 - 15 – 30", "871": "What does Jimmy Wales think of Karl Marx?", "872": "What happens if a domain name auction finishes without any bid in GoDaddy?", "873": "Why am I called anti-national if I say anything against Modi?", "874": "Condoms: How is the working culture at Durex?", "875": "Why do we bury people in coffins?", "876": "What is THE typical indian habit?", "877": "Why does a narcissist forget or ruin your birthday?", "878": "How do people misunderstand one another?", "879": "Why do so few people listen to classical music today compared to forms of popular music?", "880": "Why do I feel slightly ill after drinking coffee?", "881": "Why do Americans have such different political attitudes to (Western) Europeans. Why is it that Government is distrusted more in the US than in Europe?", "882": "Why does everyone hate me :(?", "883": "What does \"client transfer prohibited\" on whois status mean?", "884": "How do you know if your boss is a sociopath?", "885": "Why do Muslims and Jews not eat pork?", "886": "Why doesn't everybody in Avatar The last Airbender, have the power to bend?", "887": "Who is Eduardo Saverin?", "888": "Miracle: If any, what is the scientific mystery behind the Tilma of the Lady of Guadalupe?", "889": "Why do pizzerias offer anchovies?", "890": "Why do some computer programmers develop amazing software or new concepts, while some are stuck with basic programming work?", "891": "How many lobes does a liver have?", "892": "Where did Christopher Nolan get the idea for Inception?", "893": "Why is the PM not intervening on the Cauvery issue?", "894": "What is the expected cutoff for KVPY SA 2015?", "895": "Why is brinjal considered fruit?", "896": "Why are there male feminists?", "897": "What is the decomposition of dinitrogen oxide (nitrous oxide) gas into its elements?", "898": "In 1995, who won the Super Bowl?", "899": "What is the difference between since, for and from?", "900": "What is excitation system?", "901": "What is the British perspective of India's struggle for independence?", "902": "Error: expected '=', ',', ';', 'asm' or '__attribute__' before ' {' token {in code chef?", "903": "Where was the final scene of Star Wars: The Force Awakens filmed?", "904": "How does jealousy become a sin?", "905": "Why there is 2 theta instead of theta in the XRD technique?", "906": "What are the pros and cons of using biofuel?", "907": "How can the Indian government ensure gender equality in India?", "908": "What are cool facts about the ocean?", "909": "How did monkeys get to South America from Africa or Asia? Aliens? God? Magic?", "910": "What does \"even achilles was only as strong as his heel\" mean?", "911": "How is extra time in soccer calculated and rules regarding cards?", "912": "What is the surface of Mercury like?", "913": "How is biomass converted to ethanol? How is this product used?", "914": "How does Narendra Modi visiting so many countries help India? Will signing various deals help us immediately? Is it necessary now, when there are many important issues yet to be solved?", "915": "What is card to cash payment?", "916": "What are the pros and cons of large dams?", "917": "Why can't some people accept that women rape men too?", "918": "What exactly happened on 2017 New Year's Eve in Bengaluru? What could be causes of this?", "919": "How dangerous is to punch someone in the temple?", "920": "What is the corporate culture like at Roper Industries? How is the culture different than other companies?", "921": "What are the applications of a separately excited DC motor?", "922": "If the temperature inside the car is colder than outside, will water droplets form on the inside of the window or outside or both? Why?", "923": "What is the corporate culture like at Etsy? How is the culture different than other companies?", "924": "Why are people in Seattle often characterized as passive-aggressive?", "925": "How is the AAP government doing in Delhi?", "926": "What happens when you die?", "927": "What is the reaction between silver nitrate and water?", "928": "Who is Morgan Stanley?", "929": "What is the difference between \"precise\" and \"accurate\"?", "930": "What is the difference between a crayfish and a crawfish?", "931": "How many companies exist in the world?", "932": "What does Omega-3 Fatty Acid do for dogs?", "933": "What does it mean to invest in stocks?", "934": "What answers are management consulting firms' interviewers looking for when they ask \"Why McKinsey/Bain/BCG/Strategy&?\"?", "935": "What are debentures?", "936": "When did Jayalalitha's mother die?", "937": "Where did the posh English accent come from?", "938": "What's this mean نام ايع و أبهى لسينيغاثقادواظا نمت العصر?", "939": "Who controls the IAS officers?", "940": "Why doesn't God provide scientific proof of His existence?", "941": "What does it mean if a girl makes you nervous?", "942": "Looking for the correct Latin to English translation of Devovi. It is a group's name and we think it means we are devoted. What does it actually mean?", "943": "Where does the Norwegian language come from?", "944": "How is chief minister Jayalalitha's health condition?", "945": "What is the type of cell receptors in body?", "946": "How well does oral history match up with written history?", "947": "What are some examples of greenhouse gases?", "948": "Why can't we just replace the human heart with some blood pumping machine and make the body immortal?", "949": "The Amazing Spider-Man 2 (2014 movie): How does Rhino's origin story differ from what was originally introduced in the comics?", "950": "What are great uses for chives?", "951": "How do you say \"life\" in Italian?", "952": "Why are there two days of Rosh Hashanah, even in Israel?", "953": "What does the word \"humba\" mean in English?", "954": "Why does Lord Shiva always meditate?", "955": "Why is playing chess against a person and computer different?", "956": "If human feces carries e coli bacteria, why don't we get sick before we poop?", "957": "Why is Quebec the most bilingual province in Canada?", "958": "How competitive is the hiring process at Unisys?", "959": "Why is Bogota cold?", "960": "What cut of meat is known as the saddle?", "961": "What was airport security like prior to the 1970s?", "962": "Why does India buys fighter jet rather than building one?", "963": "Why is 'geometric' progression called so?", "964": "What are the rules to chant \"vishnu sahasranamam\"? When and how should it be recited?", "965": "What is the skin effect on conductors?", "966": "How did Rocco's Old-School Tattoo Balm decide to sponsor the L.A. Kings ice girls?", "967": "What excites a boy about a girl. What is boys weakness about girls?", "968": "What was it like to work with Elvis Presley?", "969": "Why do you hate people, but like individuals?", "970": "What is the relationship between joules and watts?", "971": "What are water talkies?", "972": "What is the meaning of the Bible verse about footprints in the sand?", "973": "What do Croats think of Turks?", "974": "In Spanish, what is the meaning of the word \"bueno\"?", "975": "Why do people hate India?", "976": "How is persuasion transformed by certainty?", "977": "What is it like to be a drug dealer?", "978": "Why are a lot of homes in India dirty and unhygienic? Is it just about income or also about a lack of desire to keep things clean?", "979": "What is it like to be a detective?", "980": "Why is the design of shopping trolleys so uniform? Is there no room for improvement?", "981": "What are the strengths and weaknesses of the US economy?", "982": "What is socialism? What are the pros and cons?", "983": "What is Hilary Clinton's email controversy about?", "984": "Politics: What is the difference between Conservative, Liberal, Centrist, Leftist, Right Wing Parties in the modern world?", "985": "What is politics?", "986": "How do \"trippy films\" (e.g. qatsi trilogy, Baraka, Samsara) affect the relative ratio of brain waves (alpha/beta/gamma/theta/delta)? How do those effects differ from those of meditation?", "987": "Why are the quadcopters being termed as drones nowadays? Isn't this a misnomer?", "988": "How did Luxembourg become a wealthy country?", "989": "How does a typical day in IIM A pass by?", "990": "How will humans be 100 years from now?", "991": "What are the metric units of distance? How are they used?", "992": "Why is semen white in colour?", "993": "What characteristics do bullies have?", "994": "What is the \"Anaar ke chilke ka totka \" of GD Vasistha for debt returning?", "995": "Why dominos stopped making double burst pizza?", "996": "Why do you want to become a doctor?", "997": "What's it like to be tased?", "998": "Why water is acidic?", "999": "What is meant by biasing of a transistor?"}