{"0": "Has Ancient Japan been scientifically tested?", "1": "Who updates the information on Google?", "2": "What is the best gaming PC under 30000?", "3": "Has Ancient Japan been scientifically tested?", "4": "Is the Recommender Systems Handbook a good book to read?", "5": "Can you summarise your investment/trading strategy?", "6": "Has Ancient Japan been scientifically tested?", "7": "If WWII lasted another year, and jet engines were not yet invented, what aircraft do you think might have been fielded by the countries involved?", "8": "What is a good cheap microphone for YouTube videos in India?", "9": "Has Ancient Japan been scientifically tested?", "10": "Where do you see India 15-20 years from now? What changes you want to see and how do you see yourself contributing to that?", "11": "Has Ancient Japan been scientifically tested?", "12": "What is it like to study Applied Physics at IITs?", "13": "Who's the most effective method for an eCommerce website, SEO or PPC?", "14": "Has Ancient Japan been scientifically tested?", "15": "What is the most optimal 24 Hour Fitness gym membership option?", "16": "Which is the best college for M Sc in Maths in Maharashtra?", "17": "What are the investment trends of VC's in India?", "18": "Has Ancient Japan been scientifically tested?", "19": "Has Ancient Japan been scientifically tested?", "20": "What universities does ConAgra Foods recruit new grads from? What majors are they looking for?", "21": "What are good books on graphic design for beginners?", "22": "Has Ancient Japan been scientifically tested?", "23": "What are some good phrases, expressions and tips to use in a conversation to make a non-native speaker appear to be fluent in English?", "24": "What one song makes you cry and smile at the same time?", "25": "What are the best, short hair styles?", "26": "For those of you who know what pixelblock is and use it does it actually work? Is there something with the same purpose which is better (Read more)..", "27": "Why not to feel demotivated when you see someone less qualified than you getting better opportunities in life because of the reservation system in India?", "28": "What is standup comedy?", "29": "What are some major social faux pas to avoid when visiting France?", "30": "Has Ancient Japan been scientifically tested?", "31": "What is your most favourite memory linked to DU Beat?", "32": "Has Ancient Japan been scientifically tested?", "33": "What are some good perfumes for women?", "34": "What are some of the best comedy TV series after 2005?", "35": "Has Ancient Japan been scientifically tested?", "36": "What are some examples of excellent relationship advice?", "37": "What is best, average, worst case time complexities of merge and quick sorts?", "38": "Has Ancient Japan been scientifically tested?", "39": "Has Ancient Japan been scientifically tested?", "40": "What are some good old songs?", "41": "Has Ancient Japan been scientifically tested?", "42": "Has Ancient Japan been scientifically tested?", "43": "Has Ancient Japan been scientifically tested?", "44": "What's your biggest fear?", "45": "Can you just list some best sad songs in Hindi?", "46": "What are some funniest South Indian movie titles (translated in Hindi)?", "47": "What are the most important things to check when buying a second hand car in tamil nadu for a budget of 2 Lakhs?", "48": "Has Ancient Japan been scientifically tested?", "49": "What is the best school for Jiu Jitsu in California?", "50": "What are some good coupons available for Sleep Number beds?", "51": "Which is the most popular and erotic adult film ever made? And why?", "52": "Has Ancient Japan been scientifically tested?", "53": "What are the best places in Lucknow for eating as well as hangout with friends?", "54": "Has Ancient Japan been scientifically tested?", "55": "Has Ancient Japan been scientifically tested?", "56": "Has Ancient Japan been scientifically tested?", "57": "Has Ancient Japan been scientifically tested?", "58": "Has Ancient Japan been scientifically tested?", "59": "Has Ancient Japan been scientifically tested?", "60": "Which is the best graphics card (1 and 2 GB) to opt for Windows 10 PC with 4 GB RAM?", "61": "Has Ancient Japan been scientifically tested?", "62": "Has Ancient Japan been scientifically tested?", "63": "Has Ancient Japan been scientifically tested?", "64": "Which is biggest city in the world?", "65": "Who is the most powerful, a judge or an IAS officer?", "66": "Who would you chose, an physically attractive person with unpleasant personality, or an unattractive but pleasant person?", "67": "Has Ancient Japan been scientifically tested?", "68": "I have three years of work experience ie;16 months at a big 4 and about 21 months at a start up, I am looking for a change in my job now. My focus is to build a good profile for MBA applications, Should I apply to an MNC or a start up?", "69": "Has Ancient Japan been scientifically tested?", "70": "What are the best engineering majors to major for the future or should I move into Computer science?", "71": "Which foreign countries did Hitler visit before World War II as an ordinary civilian?", "72": "Has Ancient Japan been scientifically tested?", "73": "Which is the best book to study about Indian share market basics in kannada?", "74": "Has Ancient Japan been scientifically tested?", "75": "Can you give a name that should be represent a group of girls?", "76": "What are the common questions asked in interviews?", "77": "Has Ancient Japan been scientifically tested?", "78": "Has Ancient Japan been scientifically tested?", "79": "Which modules suit me as I completed computer science in 2014 and I'm working as a back end developer in SD and PP modules? I want to choose a perfect module. Which one is the best?", "80": "What are some examples of police misconduct?", "81": "Has Ancient Japan been scientifically tested?", "82": "Who is your favorite male singer?", "83": "Has Ancient Japan been scientifically tested?", "84": "What is the biggest irony of Canada?", "85": "Which cell phone should I buy under 12k?", "86": "Has Ancient Japan been scientifically tested?", "87": "Has Ancient Japan been scientifically tested?", "88": "What is you favorite app on your phone? Why?", "89": "As a civil engineer, what's the best skills set to have for the next 5-10 years?", "90": "What books can you recommend about Entrepreneurship?", "91": "Has Ancient Japan been scientifically tested?", "92": "How is the placement at Top IIMs who complete their MBA degree in 3 Years?", "93": "Has Ancient Japan been scientifically tested?", "94": "Has Ancient Japan been scientifically tested?", "95": "Are there any internet startups acquired close to 5 Billion dollars or more than that?", "96": "Who are the 5 most beautiful actresses in Hollywood Movies?", "97": "What are some good apps for learning programming?", "98": "Has Ancient Japan been scientifically tested?", "99": "Has Ancient Japan been scientifically tested?", "100": "What are some good companies in India to get an internship in any field of ECE for a third year?", "101": "Which language should be learned first ?", "102": "What are some applications of machine learning in education?", "103": "Has Ancient Japan been scientifically tested?", "104": "What is the job profile of a trainee engineer?", "105": "What fictional character reminds you of yourself?", "106": "Has Ancient Japan been scientifically tested?", "107": "What is best source of protein?", "108": "What is the best thing that was ever done for your parents?", "109": "On what basis does Canadian universities select Indian students for graduations?", "110": "What are the best dark chocolate brands?", "111": "What is the best service to keep a virtual stock portfolio online?", "112": "What are some things new employees should know going into their first day at Eagle Materials?", "113": "What are some of DC's best comic story arcs?", "114": "Has Ancient Japan been scientifically tested?", "115": "Which of the following is correct if for a certain equation, AAAC + B4 = AAC0?", "116": "Has Ancient Japan been scientifically tested?", "117": "Who are the contemporary Hindi poets I must follow as a Hindi poetry fan and amateur writer?", "118": "Has Ancient Japan been scientifically tested?", "119": "Who will win in Pakistan vs Ireland in the 2015 Cricket World Cup?", "120": "Which is the best spy software for a Windows phone?", "121": "Which is a good solar panel installation provider in Inglewood, California?", "122": "Which is the best online shopping site for buying laptops in liberia?", "123": "Which hand should be on abdomen while doing the Heimlich maneuver?", "124": "What should humans fear most?", "125": "Has Ancient Japan been scientifically tested?", "126": "Has Ancient Japan been scientifically tested?", "127": "What would be the build time (from source) of OS X Mavericks on an entry-level MacBook Pro?", "128": "What teas have the most and the least caffeine?", "129": "Has Ancient Japan been scientifically tested?", "130": "Has Ancient Japan been scientifically tested?", "131": "Which mail server is used for messaging in AT&T company (for employees)? Exchange or Domino/Notes? or another?", "132": "Has Ancient Japan been scientifically tested?", "133": "What is it like to go through Course 10 at MIT?", "134": "What are some beautiful pure Tamil names and their meanings?", "135": "Entrepreneurs, What's the best approach to finding a problem that needs to be fixed when all problems seem to have a solution already?", "136": "What are some good animes?", "137": "What are some good questions to ask yourself in your diary?", "138": "Which is the best book on tensors?", "139": "How actually is the life at IIT Bombay? What do you really learn there?", "140": "Has Ancient Japan been scientifically tested?", "141": "Has Ancient Japan been scientifically tested?", "142": "What is the craziest thing someone has ever done?", "143": "Has Ancient Japan been scientifically tested?", "144": "What are some good topics to discuss in school for free period?", "145": "What's the craziest excuse you have had an employee/coworker tell you showing up late to work?", "146": "Which is better: CSE at DTU or BITS Hyderabad Chemical?", "147": "Has Ancient Japan been scientifically tested?", "148": "Has Ancient Japan been scientifically tested?", "149": "I n your opinion, what are some aspects you have to consider before coming up with your personal response to a work? (any work)?", "150": "If I were to list all of my numerous motherboards, discrete GPU's & RAM that I have on-hand. Can someone help me choose the best matches for them all?", "151": "What is the most painful thing after breakup?", "152": "How many maths papers do IGCSE extended students write?", "153": "Has Ancient Japan been scientifically tested?", "154": "What is the difference between Electronics Engineering and Electrical Engineering?", "155": "What are the best Skrillex remixes?", "156": "My niece is coming from abroad to india for the first time … what should I gift her?", "157": "How much do the coaching teachers in Kota earn per annum?", "158": "Where is one of the best Videocon refrigerator repair center in Hyderabad?", "159": "Has Ancient Japan been scientifically tested?", "160": "Has Ancient Japan been scientifically tested?", "161": "Has Ancient Japan been scientifically tested?", "162": "Is there any app to read novels offline and for free?", "163": "What is the best online cake delivery web site in Hyderabad?", "164": "What are the best technologies for a web application?", "165": "Has Ancient Japan been scientifically tested?", "166": "Has Ancient Japan been scientifically tested?", "167": "What will be exam pattern of IBPS PO pre exam 2016?", "168": "What made you want to be a computer engineer and how did you prepare for the career?", "169": "What is the interview process in Google?", "170": "Has Ancient Japan been scientifically tested?", "171": "Who is the most famous poets?", "172": "How many designers work at Apple?", "173": "What is your favorite class in Team Fortress 2 and why?", "174": "Has Ancient Japan been scientifically tested?", "175": "What's the best site for printing high-end photo books?", "176": "Has Ancient Japan been scientifically tested?", "177": "Has Ancient Japan been scientifically tested?", "178": "What's the best vodka to mix with coke?", "179": "Has Ancient Japan been scientifically tested?", "180": "What are the most important things for living a good life?", "181": "What's more attractive to a man?", "182": "What are the biggest lies you told in school?", "183": "Which are the best educational resources for studying psychometrics for human resource management?", "184": "Which book is the best for maths and science for class 10 (CBSE)?", "185": "Has Ancient Japan been scientifically tested?", "186": "Has Ancient Japan been scientifically tested?", "187": "At the end of the day, what matters the most?", "188": "For mobile apps requiring a credit card number in-app (e.g., to allow in-app purchase), what share of downloaders end up inputting their CC data?", "189": "Has Ancient Japan been scientifically tested?", "190": "What are the website to get employees relationship videos presentation?", "191": "What is the next number in the following sequence: 0 0 1 2 2 4 3 6 4 8 5?", "192": "Has Ancient Japan been scientifically tested?", "193": "Has Ancient Japan been scientifically tested?", "194": "Has Ancient Japan been scientifically tested?", "195": "What are some great project ideas for Mechanical Engineering students?", "196": "What is the most likely way scientist will find extraterrestial life?", "197": "Where is the most beautiful sunset in India?", "198": "What are the top 5 beard oils in India?", "199": "Has Ancient Japan been scientifically tested?", "200": "Has Ancient Japan been scientifically tested?", "201": "Which of the following conditions are for rusting?", "202": "Has Ancient Japan been scientifically tested?", "203": "What is the most badass thing about Kanye West?", "204": "Has Ancient Japan been scientifically tested?", "205": "Who is the most badass CEO?", "206": "What is the most popular cartoon character?", "207": "Has Ancient Japan been scientifically tested?", "208": "Has Ancient Japan been scientifically tested?", "209": "What advice would you give to a 18 year old IAS aspirant?", "210": "What was the most surprising thing you heard someone say?", "211": "Which is the best online site for learning to play the guitar?", "212": "Which of these Bollywood Actresses will succeed in Hollywood: Deepika Padukone (XXX: The Return of Xander Cage) or Priyanka Chopra (Baywatch)?", "213": "What is your best idea?", "214": "When did you realize that your best friend wasn't your best friend anymore?", "215": "What is the most selfless act you have experienced?", "216": "What's the craziest thing you have ever done to express your feelings?", "217": "What are the major movie blogs and movie industry blogs and how do they compare?", "218": "What's the best advice you've ever given or been given in terms of decision making in organizations?", "219": "How has the year 2016 been for you?", "220": "What are the best business cards ever created?", "221": "Where can one find the best excel tutorials?", "222": "What is the corporate culture like at Premier? How is the culture different than other companies?", "223": "Has Ancient Japan been scientifically tested?", "224": "Has Ancient Japan been scientifically tested?", "225": "Has Ancient Japan been scientifically tested?", "226": "Which is better 640 GMAT or 314 GRE?", "227": "What do you wish people knew about you?", "228": "What are some of the really hot ASIC startups in the Bay Area?", "229": "Who are the top media print journalists in India?", "230": "Who is your favorite Motown song and why?", "231": "Has Ancient Japan been scientifically tested?", "232": "What is your review of The Next Warrior: Proving Grounds - Part 4?", "233": "What are some project ideas for a civil engineering student?", "234": "What are some of the cheap options for watching a 3D movie at home?", "235": "What was the best advice your grandparents ever gave you?", "236": "Has Ancient Japan been scientifically tested?", "237": "GRE: 303 (Q153 V149) , 7.2cgpa, 1 project at ISRO, 2 at college, working on research paper. What are my possibilities for masters In Electronics US?", "238": "Has Ancient Japan been scientifically tested?", "239": "What is the best place you want to visit in China?", "240": "Which is the best company to work for in India?", "241": "Has Ancient Japan been scientifically tested?", "242": "What are the working days of a post office in India?", "243": "Has Ancient Japan been scientifically tested?", "244": "Has Ancient Japan been scientifically tested?", "245": "What is a CDAC course?", "246": "What was your strategy for ESE in Electrical Engineering?", "247": "What is an example of a good personal statement?", "248": "What are some things new employees should know going into their first day at McKesson?", "249": "What are some innovative food advertising campaigns out there?", "250": "When was the last time you made love with someone?", "251": "Has Ancient Japan been scientifically tested?", "252": "Which companies in the UK give Indian Java Developer visa sponsorship?", "253": "Who is better for India: Donald Trump or Hillary Clinton?", "254": "Has Ancient Japan been scientifically tested?", "255": "What is the most important thing to being successful?", "256": "What are the best places to buy road bikes in San Francisco?", "257": "What is the highest marks in Indian economy paper in economic services obtained by a student?", "258": "Which is the better nucleophile alcohol or water?", "259": "Has Ancient Japan been scientifically tested?", "260": "Has Ancient Japan been scientifically tested?", "261": "What are some interesting startups of 2014?", "262": "Has Ancient Japan been scientifically tested?", "263": "What subjects do you need to do if you want to be an actor?", "264": "Has Ancient Japan been scientifically tested?", "265": "What are some good automotive hacks and tips?", "266": "What are the best podcasts on investment?", "267": "What is the mobile app that will help me to improve my coding skills?", "268": "What are the most annoying questions that you come across in Quora?", "269": "Has Ancient Japan been scientifically tested?", "270": "Has Ancient Japan been scientifically tested?", "271": "What's the average number of years a software engineer stays at Apple?", "272": "Has Ancient Japan been scientifically tested?", "273": "What is the best thing that you have ever bought?", "274": "What desserts go with pizza?", "275": "Which is your best gadget?", "276": "What is a Software Engineer?", "277": "Has Ancient Japan been scientifically tested?", "278": "How useful is the techno syllabus which is being taught in sri Chaitanya useful in future studies?", "279": "What are some petroleum engineering thesis topics I can use for my final year project?", "280": "Which is better TV series: The originals, or Game of Thrones?", "281": "Which USA universities have late deadline for master in AI , ML or vision? (For Fall)", "282": "What is it that makes you available for everyone to help and there is no one when you need it?", "283": "What is the worst decision one has ever made in life?", "284": "Has Ancient Japan been scientifically tested?", "285": "What is the best company for VLSI training in India?", "286": "What are some of your favorite sayings?", "287": "Which is the longest organ in human body?", "288": "Has Ancient Japan been scientifically tested?", "289": "What does an Athletic Director do at a college?", "290": "I want to join a regular classroom program for preparation for GATE in Pune. Which one should I choose, Gateforum or Made Easy?", "291": "Which has the best beach life, Australia or Costa Rica?", "292": "What are some of the advantages and disadvantages of laser technology?", "293": "Has Ancient Japan been scientifically tested?", "294": "What are the best aspects of living in Campos Dos Goytacazes, Brazil as a young adult?", "295": "What is the rudest way someone has ever used your age against you?", "296": "What are the top 5 b-schools/colleges in India which accept MAT score?", "297": "Who is your favorite model?", "298": "What are the top five biggest challenges faced by startups?", "299": "What is the average number of questions asked per day by a normal Quora user?", "300": "Has Ancient Japan been scientifically tested?", "301": "What are the top 10 things that you want to do on your bucket list?", "302": "Has Ancient Japan been scientifically tested?", "303": "What is the best app for editing pictures in iOS?", "304": "What European car models are offered in yellow?", "305": "What interview questions does Google ask their user experience designer candidates?", "306": "What are the best Indian TV series for youth?", "307": "Has Ancient Japan been scientifically tested?", "308": "Has Ancient Japan been scientifically tested?", "309": "Has Ancient Japan been scientifically tested?", "310": "Has Ancient Japan been scientifically tested?", "311": "Has Ancient Japan been scientifically tested?", "312": "Has Ancient Japan been scientifically tested?", "313": "How are job fairs in University of Utah for MSIS students?", "314": "Has Ancient Japan been scientifically tested?", "315": "What is a good weight gainer diet?", "316": "Has Ancient Japan been scientifically tested?", "317": "What are some animals native to New Zealand?", "318": "Among Spanish, German, and Russian, which language is easiest to learn, considering the fact that I am fluent in English?", "319": "Has Ancient Japan been scientifically tested?", "320": "What fields are the top focus areas for analytics in 2016?", "321": "What should I wear for concert?", "322": "Has Ancient Japan been scientifically tested?", "323": "Which colleges in India offer Biotechnology for PCB students?", "324": "What is a suitable inpatient drug and alcohol rehab center near Jackson County AL?", "325": "Has Ancient Japan been scientifically tested?", "326": "Which one is better android or windows phone?", "327": "Has Ancient Japan been scientifically tested?", "328": "What is the best gun in Mafia II?", "329": "What are the best things in Quora that some people don't know?", "330": "What is the best story you have about your life?", "331": "Has Ancient Japan been scientifically tested?", "332": "Has Ancient Japan been scientifically tested?", "333": "Laptop Recommendations: Which is the best 2 in 1 laptop?", "334": "Has Ancient Japan been scientifically tested?", "335": "Which will be the best product to export from India to USA?", "336": "Has Ancient Japan been scientifically tested?", "337": "Has Ancient Japan been scientifically tested?", "338": "Has Ancient Japan been scientifically tested?", "339": "Which is the best institute for ethical hacking in India?", "340": "What are some Tinder hacks for men in India?", "341": "What is the scope for MBA marketing graduates in hospitality sector sales & marketing?", "342": "Who did you vote for in the 2016 election? Why?", "343": "What parameters are considered in selection of Forbes' 74 most powerful people?", "344": "Has Ancient Japan been scientifically tested?", "345": "What are your wishes for the year 2017?", "346": "What can we learn from Mahendra Singh Dhoni?", "347": "How many students of NIT Agartala are south Indians?", "348": "What are good survey questions?", "349": "Has Ancient Japan been scientifically tested?", "350": "What are the best tools to manage online marketing requests, reviews and approvals?", "351": "Has Ancient Japan been scientifically tested?", "352": "What should the rest of the world learn from India?", "353": "Where is the best place to vacation?", "354": "What are the leading computer science universities in Poland?", "355": "Has Ancient Japan been scientifically tested?", "356": "Has Ancient Japan been scientifically tested?", "357": "What are some odd and unusual canned foods?", "358": "How is the best makeup artist for wedding?", "359": "Has Ancient Japan been scientifically tested?", "360": "What is the best song ever to make a girl listen to it?", "361": "Who do you think will win the 2016 US presidential elections and whom do you want to win and why?", "362": "Has Ancient Japan been scientifically tested?", "363": "What is the best Japanese/English online translator?", "364": "Who are some lesser known important historical figures of Gabon and what should people know about them?", "365": "Has Ancient Japan been scientifically tested?", "366": "Has Ancient Japan been scientifically tested?", "367": "Who are the 2015 summer interns in Silicon Valley?", "368": "What are some Must watch movies and documentaries for motivating programmers?", "369": "What should I eat this summer?", "370": "Who are the agents for the biggest actors and directors in Hollywood?", "371": "What advice would you give to a 24-year-old woman?", "372": "What is the latest trend amongst the youth in India?", "373": "Has Ancient Japan been scientifically tested?", "374": "What is your preferred website for blogging professors?", "375": "Which are the new MBA specializations that are being offered by top colleges with lot of scope in the future?", "376": "Where do technology sites get their news from?", "377": "What are some of the most beautiful English rhyming poems by Indian poets?", "378": "Has Ancient Japan been scientifically tested?", "379": "What things go surprisingly well with cinnamon?", "380": "What's the most profitable business ever?", "381": "Quebec or Spain, which is better for travel?", "382": "What would be the worst curse?", "383": "What are some things new employees should know going into their first day at American Airlines?", "384": "Has Ancient Japan been scientifically tested?", "385": "Which laptop with an Intel Core i5 quad-core processor, 8GB RAM, 1TB HDD and 2GB of graphics memory has 6-8 hours of battery backup?", "386": "What are some great advertisements?", "387": "Who Is Most Powerful Astrologer In FIROZPUR PB GURU JI N K RAI?", "388": "Has Ancient Japan been scientifically tested?", "389": "Has Ancient Japan been scientifically tested?", "390": "Has Ancient Japan been scientifically tested?", "391": "What are the best places for hiking and mountaineering in India?", "392": "Which college is better Zakir Hussain, PGDAV, Ramanujan, Satyawati. Please rank them?", "393": "What are the cheapest airlines in USA?", "394": "What is it like to attend Johns Hopkins University as an undergraduate?", "395": "What is the best feature of Fallout: New Vegas (2010 game)?", "396": "What was your worst wardrobe malfunction story?", "397": "Has Ancient Japan been scientifically tested?", "398": "Has Ancient Japan been scientifically tested?", "399": "Has Ancient Japan been scientifically tested?", "400": "Has Ancient Japan been scientifically tested?", "401": "What are some of the best communications blogs?", "402": "Has Ancient Japan been scientifically tested?", "403": "What are the chances of getting jobs in London after doing Data Science course from Springboard?", "404": "Has Ancient Japan been scientifically tested?", "405": "What are the pros and cons of being the provider of a family?", "406": "what is the best book for mechanical competitive examinations?", "407": "How is the Department of Additive Manufacturing at NIT Warangal for an MTech? Is the faculty supportive? How are the labs and placements?", "408": "What factors have influenced your career choice of consulting?", "409": "Life Experiences: weirdest places where you have masturbated?", "410": "Honda CBR 250R vs KTM RC 390 vs Kawasaki Ninja 300. Which one should I buy in India?", "411": "Has Ancient Japan been scientifically tested?", "412": "Has Ancient Japan been scientifically tested?", "413": "Who has proved to be the best prime minister and president pair in India?", "414": "What’s the best used car for under 7000?", "415": "What are the secondary markets in industrials?", "416": "What is the best biography on Alan Turing?", "417": "Has Ancient Japan been scientifically tested?", "418": "What are the best travel blogs and why?", "419": "What are the heaviest metals?", "420": "Has Ancient Japan been scientifically tested?", "421": "Has Ancient Japan been scientifically tested?", "422": "What should we do to be best software developer?", "423": "Has Ancient Japan been scientifically tested?", "424": "Which is better TCS or c.a.technologies?", "425": "Has Ancient Japan been scientifically tested?", "426": "Which is better to visit in thailand -ko phi phi or phuket?", "427": "What resources are good for coding test interviews?", "428": "Has Ancient Japan been scientifically tested?", "429": "Has Ancient Japan been scientifically tested?", "430": "Which browser do you like and why?", "431": "Which is the best bank to open an NRE account with?", "432": "What products are the best to export to qatar?", "433": "Which is the best printer for home use?", "434": "What are the best Skullcandy earbuds and headphones and what makes them great?", "435": "What are the job openings after doing a B.Tech in chemical engineering?", "436": "Has Ancient Japan been scientifically tested?", "437": "Has Ancient Japan been scientifically tested?", "438": "Has Ancient Japan been scientifically tested?", "439": "What is the best Telugu book that I can give my best friend?", "440": "Has Ancient Japan been scientifically tested?", "441": "What are some of the dirty and unethical tactics that companies use to market their products?", "442": "What is the best game on steam under 5 dollars?", "443": "Has Ancient Japan been scientifically tested?", "444": "Which books Roman Saini read for self development?", "445": "\"Which is better One Plus Three or Samsung Galaxy A7 (2016)?\"", "446": "I m a fresher btech in civil eng and want to join bigdata and data scientist, which is better for me?", "447": "What are the best seasonal experiences? Ex. Apple cider donuts in the fall, lobster rolls in the summer, sailing in the late spring.", "448": "Which city will most likely replace London as Europe's financial centre after Brexit?", "449": "Has Ancient Japan been scientifically tested?", "450": "What are some of the reasons that some smart people might be underutilized at work and not advance very quickly, despite being ambitious with a good work ethic?", "451": "Has Ancient Japan been scientifically tested?", "452": "Has Ancient Japan been scientifically tested?", "453": "Has Ancient Japan been scientifically tested?", "454": "What is the most popular trend of 2016?", "455": "What's the most amount of money you've ever found?", "456": "I am an RN learning programming in the hopes of improving on existing UI/UX for healthcare software (which is horrendous). Healthcare IT advice?", "457": "What are good thesis topic for mechanical engineering management?", "458": "Has Ancient Japan been scientifically tested?", "459": "Has Ancient Japan been scientifically tested?", "460": "What makes New York City the greatest city in the world?", "461": "Has Ancient Japan been scientifically tested?", "462": "What is the best software for a web designer to use?", "463": "If you had the possibility to get the right answer to one question, which question would you ask?", "464": "Which are worst movies ever made in Bollywood?", "465": "What is a perfect number?", "466": "Which are the best 5 star hotels in Goa?", "467": "Which is the best earphone under 1000?", "468": "Has Ancient Japan been scientifically tested?", "469": "Has Ancient Japan been scientifically tested?", "470": "Has Ancient Japan been scientifically tested?", "471": "What are all the govt jobs for mechanical engineering?", "472": "Has Ancient Japan been scientifically tested?", "473": "Has Ancient Japan been scientifically tested?", "474": "What are the best places for vacation in Australia?", "475": "Has Ancient Japan been scientifically tested?", "476": "What will be a better choice between XLRI and IIFT?", "477": "Has Ancient Japan been scientifically tested?", "478": "Has Ancient Japan been scientifically tested?", "479": "Has Ancient Japan been scientifically tested?", "480": "Studying engineering in IIT or MBBS in AIIMS, which is best in India?", "481": "What are the best and worst things about public transit in Francisco Morato, Brazil? How could it be improved?", "482": "How reliable is makemytrip.com for international hotel bookings?", "483": "Has Ancient Japan been scientifically tested?", "484": "Which research labs work on tendinopathies in France?", "485": "What is the best shoe brand?", "486": "Name a good book for laymen on the subject of Multiverse Theory?", "487": "What are some innovative apps?", "488": "Has Ancient Japan been scientifically tested?", "489": "What is the best/fastest way to learn to speak a second language?", "490": "What are some good cigar/scotch pairings?", "491": "What universities does Pacific Ethanol recruit new grads from? What majors are they looking for?", "492": "What are the best free image search  APIs out there?", "493": "What novel should I read?", "494": "What are some beautiful Urdu/Hindi couplets?", "495": "Who is the best dancer of Tollywood?", "496": "Has Ancient Japan been scientifically tested?", "497": "Pakistani mangoes vs Indian mangoes, which is the best?", "498": "What is the coldest substance known to man?", "499": "What's a good vacation?", "500": "What are currently hot topics in computer engineering research?", "501": "What are some examples of a storage device?", "502": "What are some songs for a sweet airy mezzo voice?", "503": "Has Ancient Japan been scientifically tested?", "504": "Has Ancient Japan been scientifically tested?", "505": "What is the best Java tutorial for beginners?", "506": "Has Ancient Japan been scientifically tested?", "507": "What are the best kitchen knives?", "508": "What were the highlights of Google I/O 2015?", "509": "What was the shortest kicked NFL football field goal?", "510": "Has Ancient Japan been scientifically tested?", "511": "What should an ideal statement of purpose for admissions to top graduate schools be like?", "512": "What person should I choose for the lives that make a difference competition?", "513": "What is the most courageous thing you have seen somebody do?", "514": "Which car services are available in Detroit? How good are they compared to taxis and relative to each other?", "515": "Which is better, beer or wine?", "516": "Has Ancient Japan been scientifically tested?", "517": "Which are the manga related episodes in 'Naruto Shippuden' anime?", "518": "Who is eligible for big data's Hadoop training?", "519": "What do men find attractive in a woman?", "520": "Who writes the speeches given by academic toppers at various places?", "521": "Which are some of the best good morning / motivatonal messages?", "522": "What is procedural language? How is it best used?", "523": "What was your most shocking experience?", "524": "Has Ancient Japan been scientifically tested?", "525": "What's a reasonable hourly labor rate for an auto mechanic?", "526": "Which is better AMD Radeon R5 M330 or Nvidia Geforce 820M?", "527": "Has Ancient Japan been scientifically tested?", "528": "What are some things new employees should know going into their first day at RTI International Materials?", "529": "Has Ancient Japan been scientifically tested?", "530": "What is the greatest contribution of the Americans to our culture and literature?", "531": "Where is teach mashal art?", "532": "Which is better: snow tire chains or cables?", "533": "What is a good arguable thesis for Jane Eyre?", "534": "Has Ancient Japan been scientifically tested?", "535": "Has Ancient Japan been scientifically tested?", "536": "What are good songs which describe college life and family life?", "537": "Which are the best books to learn C++?", "538": "What is the average salary of lead generation specialist in SF?", "539": "Has Ancient Japan been scientifically tested?", "540": "What is the best learning path for SDN from scratch for non technical person?", "541": "What type of programming languages should I learn to be a successful web developer?", "542": "Has Ancient Japan been scientifically tested?", "543": "Has Ancient Japan been scientifically tested?", "544": "How is HCL Leap Program benefitial for freshers of mechanical engineer?", "545": "What are good topics for research?", "546": "What is the best gift a student can give to teacher in graduation?", "547": "Has Ancient Japan been scientifically tested?", "548": "What is the expected cse cut off for BITSAT 2016?", "549": "What do you feel is the biggest challenge facing today's youth?", "550": "Has Ancient Japan been scientifically tested?", "551": "What is the best course to do after B.E in mechanical for a freshman?", "552": "What is the prerequisite to learn calculus?", "553": "What is the scope of automation testing or manual testing in the future?", "554": "What is best diet for muscles building?", "555": "What invasive species could be introduced to a garden as a senior prank?", "556": "What are the best stories that your mom or dad shared with you?", "557": "Who are the best (currently active) French mathematicians?", "558": "What is the biggest difference in British culture and American culture?", "559": "Has Ancient Japan been scientifically tested?", "560": "Has Ancient Japan been scientifically tested?", "561": "If you could change one event of history which would it be and why?", "562": "What is the average salary of a school teacher in India?", "563": "What are some recent important applications of artificial neural networks?", "564": "Has Ancient Japan been scientifically tested?", "565": "Has Ancient Japan been scientifically tested?", "566": "Has Ancient Japan been scientifically tested?", "567": "Has Ancient Japan been scientifically tested?", "568": "Has Ancient Japan been scientifically tested?", "569": "Has Ancient Japan been scientifically tested?", "570": "What is important in human life?", "571": "What are some good team names for a college fest?", "572": "What is the best graduation present you have got?", "573": "Has Ancient Japan been scientifically tested?", "574": "What are some Vlogging Youtube name ideas for the name Ella?", "575": "Has Ancient Japan been scientifically tested?", "576": "What is the real world example of waterfall model regarding software?", "577": "Has Ancient Japan been scientifically tested?", "578": "Has Ancient Japan been scientifically tested?", "579": "What are the best spyware and adware remover and why?", "580": "What are reducing agents? What are some of the best reducing agents?", "581": "What are the best turn-based strategy games?", "582": "Has Ancient Japan been scientifically tested?", "583": "Has Ancient Japan been scientifically tested?", "584": "Has Ancient Japan been scientifically tested?", "585": "What are some profound proverbs in your native language?", "586": "What are some of the best profile pictures ever?", "587": "What are some things new employees should know going into their first day at Axiall?", "588": "As an English speaker, what are the most common language mistakes you have seen in non native English speakers?", "589": "Which is the best two wheeler for ladies in India - TVS Jupiter or Honda Activa?", "590": "Has Ancient Japan been scientifically tested?", "591": "What is the scope for electrical engineer in Mumbai for his core subject?", "592": "What cities are on Quora?", "593": "What is it like to work in the first IT company?", "594": "Has Ancient Japan been scientifically tested?", "595": "Which is better AMD Radeon R5 M335 or Nvidia Geforce 950M?", "596": "What will be the future image search engines in 2025?", "597": "What is the best country to live in and why?", "598": "Life hack for automobile engineers?", "599": "Has Ancient Japan been scientifically tested?", "600": "Where are you from and why do you like your country?", "601": "Which is the best tool for backlinks?", "602": "What is the salary of Indian foreign service officer?", "603": "What is the demand of biomedical engineers? Which stream is better Biomedical or Biotechnology?", "604": "Has Ancient Japan been scientifically tested?", "605": "How are the placements at Manipal university Jaipur for MBA?", "606": "Which type of morphosyntactic alignment would be more difficult to learn as a second language?", "607": "\"the best thing is to never have been born, second best thing is to die quickly\" why people continue to live even after loosing all vitality in life?", "608": "What are trending jobs in india in computer engineering field at present or in future? And which programming lang. Should you learn now? For above jobs", "609": "Has Ancient Japan been scientifically tested?", "610": "Between Welingkar and SITM which one is a better choice?", "611": "What are some good lyrical dance moves for \"Purpose\" by Justin Bieber?", "612": "What is the best short-term health insurance to get if you are planning to travel internationally?", "613": "Has Ancient Japan been scientifically tested?", "614": "Has Ancient Japan been scientifically tested?", "615": "What are the some of the best Books adapted Romantic movies?", "616": "What is the best 2016 film released so far?", "617": "What was the most unexpected military victory in History?", "618": "Has Ancient Japan been scientifically tested?", "619": "Which data analytics course is useful for job in market Research?", "620": "Who is the most stupid actor / actress in Bollywood?", "621": "Which company provides the best professional SEO service in India?", "622": "What are the books that can sail me though IAS prelims?", "623": "Has Ancient Japan been scientifically tested?", "624": "What language is this in?", "625": "What are some new business ideas with lesser investment?", "626": "Has Ancient Japan been scientifically tested?", "627": "Has Ancient Japan been scientifically tested?", "628": "Which is the best train to travel from Trivandrum to Bangalore?", "629": "To what extent Hindu practice chhaupadi is good?", "630": "Has Ancient Japan been scientifically tested?", "631": "What is linux driver development?", "632": "Has Ancient Japan been scientifically tested?", "633": "Has Ancient Japan been scientifically tested?", "634": "What are some examples of good manga names?", "635": "Has Ancient Japan been scientifically tested?", "636": "Has Ancient Japan been scientifically tested?", "637": "What is the best thing you've ever eaten in prison?", "638": "I got admits from Karlsruhe Institute of Technology and University of British Columbia in MS Computer Science. Which one should I pick?", "639": "Where is a good online resource for learning Django quickly?", "640": "What is the best way to write first chapter of your novel?", "641": "Has Ancient Japan been scientifically tested?", "642": "Has Ancient Japan been scientifically tested?", "643": "When did you realize you weren't as amazing as people had told you when you were growing up?", "644": "What is the biggest lesson you have learned in your married life?", "645": "Has Ancient Japan been scientifically tested?", "646": "What is the best Christmas gift you've ever received?", "647": "What are some things that you think a child should know before they are 18?", "648": "What is a simple breakdown of the four different writing styles?", "649": "Which is the latest arm processor?", "650": "Has Ancient Japan been scientifically tested?", "651": "Has Ancient Japan been scientifically tested?", "652": "Has Ancient Japan been scientifically tested?", "653": "Has Ancient Japan been scientifically tested?", "654": "What is best to drink in the morning? A glass of water, lemon water, green tea, or milk with honey?", "655": "Has Ancient Japan been scientifically tested?", "656": "Which is the craziest moment of your college life?", "657": "Which are the best books for reference for JEE Mains?", "658": "What is the level of difficulty to get a job in Google?", "659": "Which is the best operating system for coding?", "660": "Has Ancient Japan been scientifically tested?", "661": "Has Ancient Japan been scientifically tested?", "662": "Has Ancient Japan been scientifically tested?", "663": "Has Ancient Japan been scientifically tested?", "664": "What are some short stories about ''girls will be girls\"?", "665": "Has Ancient Japan been scientifically tested?", "666": "Has Ancient Japan been scientifically tested?", "667": "Has Ancient Japan been scientifically tested?", "668": "What are some things new employees should know going into their first day at Nuance Communications?", "669": "What are some great things about NIT Jalandhar?", "670": "When is the ideal time to eat fruits and vegetables? Before or after food?", "671": "Which type of project should I select as my final year project for electrical communication engineering?", "672": "What is the best room temperature for productivity?", "673": "What are best topics for a seminar?", "674": "What are the best Berkeley classrooms/rooms/places to be in while on acid/psychedelics?", "675": "What are some lesser-known sights to see when visiting Mopti, Mali?", "676": "What is a good Amazon gift card generator for Android?", "677": "What are some of the best free courses on udemy?", "678": "Which is the best washing machine repair center in Hyderabad?", "679": "What is a Quora credit value?", "680": "What are todays best deals on Google Play or iTunes gift cards?", "681": "Has Ancient Japan been scientifically tested?", "682": "Has Ancient Japan been scientifically tested?", "683": "Chess: Who was better, Fischer or Kasparov?", "684": "Has Ancient Japan been scientifically tested?", "685": "What are some of the saddest movies ever made?", "686": "Has Ancient Japan been scientifically tested?", "687": "Has Ancient Japan been scientifically tested?", "688": "Has Ancient Japan been scientifically tested?", "689": "Has Ancient Japan been scientifically tested?", "690": "Where is the best Whole Foods Market in Los Angeles?", "691": "What is the best online resource for learning how to learn?", "692": "Has Ancient Japan been scientifically tested?", "693": "What is the most believable paranormal experience you have had or heard of?", "694": "Which are the best coaching centers for CSAT in Delhi?", "695": "Has Ancient Japan been scientifically tested?", "696": "What is your go-to joke?", "697": "What is the best shampoo/conditioner remedy for very dry and frizzy hair in India?", "698": "What is a good, reliable, unbiased daily world news source?", "699": "What are some good bodyweight exercises for traps/neck?", "700": "Has Ancient Japan been scientifically tested?", "701": "What are the best keywords for mobile company website and why?", "702": "How did you decide what you wanted to do as a career?", "703": "Which parts of Mainland China did most people in Taiwan come from?", "704": "Which are the best countries for sociologists.?", "705": "Which is faster, better, and cheaper UPS, FedEx, or USPS?", "706": "Has Ancient Japan been scientifically tested?", "707": "What is the most overrated tech device in 2016?", "708": "Has Ancient Japan been scientifically tested?", "709": "Has Ancient Japan been scientifically tested?", "710": "What are some good websites/books that I can use to learn c++?", "711": "Social Media Analytics: What are examples of startups providing solutions to market research, consumer insights?", "712": "Has Ancient Japan been scientifically tested?", "713": "What is the best program for 2D animation?", "714": "Has Ancient Japan been scientifically tested?", "715": "Has Ancient Japan been scientifically tested?", "716": "What are the best Adobe Premiere third party plugins?", "717": "What is the best market product to remove sun tan?", "718": "Has Ancient Japan been scientifically tested?", "719": "Who is the most famous man in the history of the world?", "720": "Has Ancient Japan been scientifically tested?", "721": "Which is the best law college in india other than NLU'S in terms of campus recruitment?", "722": "Which country has a better economic future: Bangladesh or Nepal?", "723": "What is the best travel place in Kerala?", "724": "Has Ancient Japan been scientifically tested?", "725": "Has Ancient Japan been scientifically tested?", "726": "Has Ancient Japan been scientifically tested?", "727": "What are 5 scientific challenges faced by big cities due to urbanization?", "728": "Has Ancient Japan been scientifically tested?", "729": "What are the trends in online foruns?", "730": "Has Ancient Japan been scientifically tested?", "731": "Has Ancient Japan been scientifically tested?", "732": "Who has the best first tweet on Twitter?", "733": "Has Ancient Japan been scientifically tested?", "734": "Has Ancient Japan been scientifically tested?", "735": "Has Ancient Japan been scientifically tested?", "736": "Has Ancient Japan been scientifically tested?", "737": "What's the best gift parents can give?", "738": "Has Ancient Japan been scientifically tested?", "739": "Which is the best CAT coaching centre in Pune?", "740": "What comes next in the following sequence: 61, 52, 63, 94, and 46?", "741": "Has Ancient Japan been scientifically tested?", "742": "What is the most important study habit you've developed?", "743": "Has Ancient Japan been scientifically tested?", "744": "Has Ancient Japan been scientifically tested?", "745": "Which are famous cartoons in India?", "746": "What are some of your guilty pleasure?", "747": "What are your experiences with \"Neuro-Linguistic Programming\"?", "748": "What are the most important turning points of your life?", "749": "Has Ancient Japan been scientifically tested?", "750": "Has Ancient Japan been scientifically tested?", "751": "What holiday is your favorite to blog about?", "752": "Which is a suitable inpatient drug and alcohol rehab center in Adams County CO?", "753": "If you live in Belgium, what Amazon site do you shop at?", "754": "Has Ancient Japan been scientifically tested?", "755": "Who will be a stronger military force between India Japan and Israel?", "756": "Who is the best guitarist?", "757": "What's the best caption for this Photo?", "758": "What is your review of Google Alerts?", "759": "What are the best websites or apps to download free ebooks?", "760": "Has Ancient Japan been scientifically tested?", "761": "What are the best jokes about jokes?", "762": "I'm looking for a music video in which a guy catches a mermaid with the head of a fish of a girl and they dance together?", "763": "Has Ancient Japan been scientifically tested?", "764": "Has Ancient Japan been scientifically tested?", "765": "Has Ancient Japan been scientifically tested?", "766": "Has Ancient Japan been scientifically tested?", "767": "Has Ancient Japan been scientifically tested?", "768": "In which mutual fund should I invest through SIP for a better return?", "769": "What is your wish before you die?", "770": "What education is required to get into isro?", "771": "Has Ancient Japan been scientifically tested?", "772": "Has Ancient Japan been scientifically tested?", "773": "Has Ancient Japan been scientifically tested?", "774": "What are the best apps for writing journal on my programming activities?", "775": "How is the college life in Massachusetts?", "776": "Has Ancient Japan been scientifically tested?", "777": "What are some good smoothie recipes?", "778": "What is the best theory in science?", "779": "What kinds of games did you play in the schoolyard as a child and who taught you them?", "780": "What are some books that a teen girl can read?", "781": "Has Ancient Japan been scientifically tested?", "782": "What are the most popular goods exported from India to Australia?", "783": "Has Ancient Japan been scientifically tested?", "784": "What daily questions could improve your life significantly?", "785": "What masters programs can transition me into a human-centered/experience design career from digital marketing?", "786": "Who is/was the most evil person?", "787": "Has Ancient Japan been scientifically tested?", "788": "Has Ancient Japan been scientifically tested?", "789": "Has Ancient Japan been scientifically tested?", "790": "Most depressing piano piece?", "791": "If given a chance to be reborn in a country of your choice, what country would you choose over your native country?", "792": "What are some Project ideas for mechanical engineering students?", "793": "What is the scope for one in india who has read all CFA or finance subjects but have only an MBA from distance education and nothing else?", "794": "Which is longest river in India?", "795": "Which opinions are correct?", "796": "Has Ancient Japan been scientifically tested?", "797": "Which is the best iOS dev team in NYC?", "798": "Has Ancient Japan been scientifically tested?", "799": "How is CDAC KP placements for DAC course? Do any product companies come for placements?", "800": "What is the most common full time job and what is the most common part time job?", "801": "What universities does Citigroup recruit new grads from? What majors are they looking for?", "802": "What are TV series that are similar to Homeland series?", "803": "What are some examples of non-biodegradable waste?", "804": "Which are the MNC companies for PHP in India?", "805": "What are some cultural faux pas at LinkedIn?", "806": "What will be the biggest changes in Scotland if it leaves the UK?", "807": "I want to read a book (fiction) set in Sri Lanka. What are some good bets?", "808": "What are some good creative concepts or themes in dance?", "809": "Has Ancient Japan been scientifically tested?", "810": "Which country do you like the most, UK or USA? Why?", "811": "Has Ancient Japan been scientifically tested?", "812": "Canon Eos 750 d vs. Eos 1200 d which one is better?", "813": "Which is the most romantic way to propose a girl?", "814": "Has Ancient Japan been scientifically tested?", "815": "What is the best way to describe a person?", "816": "What are some good English language podcasts about China?", "817": "Which are the most polluted cities in South India?", "818": "Who is/was your favourite cartoon character and why?", "819": "Has Ancient Japan been scientifically tested?", "820": "Has Ancient Japan been scientifically tested?", "821": "What are the best Twitter accounts to follow for geography?", "822": "What are some of the most sexist answers on Quora?", "823": "Has Ancient Japan been scientifically tested?", "824": "What are cool things to have in an office?", "825": "Has Ancient Japan been scientifically tested?", "826": "What are some favorite effective cold remedies?", "827": "Has Ancient Japan been scientifically tested?", "828": "Has Ancient Japan been scientifically tested?", "829": "What is the most expensive item that people are willing to buy for your dog?", "830": "What are some great side dish ideas for salmon?", "831": "Where you can hire best PHP developer at low cost?", "832": "What do computer science engineers learn beyond programming?", "833": "Which steps can one follow in learning a new language?", "834": "Has Ancient Japan been scientifically tested?", "835": "What are must-read romantic books?", "836": "If I calculate the number of divisors by the prime factors, what would be the time complexity of that code?", "837": "What is the job profile of control system engineer in the field of aeronautics? What technical skills do they require?", "838": "Which is the largest hedge fund in India?", "839": "Who are some of the notable British people who have contributed greatly to the development of India and the Indian Society?", "840": "What is a typical day in class in law school like?", "841": "If someone were to make a movie about your life, who would you hope would play you?", "842": "Which tools are mostly used by game development companies in India?", "843": "What is a list of all of the subfields of algebraic geometry?", "844": "What lessons have you learned from life?", "845": "What are some best tourist places near Kanniyakumari?", "846": "What are the most prominent constellations of the Southern Hemisphere?", "847": "Which one is best and has the most scope? BSc biotechnology/microbiology or biochemistry", "848": "Quora User Feedback: When will Quora add sorting answers to questions by date?", "849": "Has Ancient Japan been scientifically tested?", "850": "Is SRM University better than local Anna affiliated colleges like SSN, Sairam etc? How does it compare to top colleges in the state like Madras Institute of Technology and CEG (College of Engineering Guindy)?", "851": "Which book should I read to make my math stronger for competitive programming?", "852": "Who is the most skillful football player the world ever seen?", "853": "Has Ancient Japan been scientifically tested?", "854": "What do women love most about men?", "855": "Has Ancient Japan been scientifically tested?", "856": "What are the career options after M tech in electrical engineering?", "857": "What are the most common problems that physically disabled people face daily?", "858": "What are some major social faux pas to avoid when visiting Laos?", "859": "Who was the first person in Game of Thrones you hated? Joffrey? Cersei?", "860": "Has Ancient Japan been scientifically tested?", "861": "Has Ancient Japan been scientifically tested?", "862": "Has Ancient Japan been scientifically tested?", "863": "Has Ancient Japan been scientifically tested?", "864": "Which is the best Anurag Kashyap movie?", "865": "Has Ancient Japan been scientifically tested?", "866": "Has Ancient Japan been scientifically tested?", "867": "What are some good books for applied thermodynamics?", "868": "Has Ancient Japan been scientifically tested?", "869": "Has Ancient Japan been scientifically tested?", "870": "Has Ancient Japan been scientifically tested?", "871": "What is the most vigorous workout an asthmatic teenager can do to start off exercising?", "872": "What objections would you raise to having your email hosted in Office365?", "873": "Has Ancient Japan been scientifically tested?", "874": "Did anyone know from which source (i.e, either from which book or website) AMCAT questions are mostly asked?", "875": "Has Ancient Japan been scientifically tested?", "876": "What were some of the most ridiculous profiles that you came across on Indian Matrimonial Sites?", "877": "Has Ancient Japan been scientifically tested?", "878": "What Are Some Examples Of Online Casino Games?", "879": "Has Ancient Japan been scientifically tested?", "880": "Has Ancient Japan been scientifically tested?", "881": "Has Ancient Japan been scientifically tested?", "882": "Has Ancient Japan been scientifically tested?", "883": "What is the most humane method of killing a chicken (for food)?", "884": "What are examples of alloys in everyday life?", "885": "Has Ancient Japan been scientifically tested?", "886": "Has Ancient Japan been scientifically tested?", "887": "Has Ancient Japan been scientifically tested?", "888": "What are the medicines that are available in the Indian market that effectively increases sexual stamina?", "889": "Has Ancient Japan been scientifically tested?", "890": "Has Ancient Japan been scientifically tested?", "891": "What are some sad and emotional songs that could make me cry?", "892": "Has Ancient Japan been scientifically tested?", "893": "Has Ancient Japan been scientifically tested?", "894": "Which universities in Germany offers masters in Robotics?", "895": "Has Ancient Japan been scientifically tested?", "896": "Has Ancient Japan been scientifically tested?", "897": "Which is the best hill station in Maharashtra?", "898": "What are the best web design companies in New York?", "899": "Which phone is better: Lenovo K3 Note or Motorola (Moto) G3?", "900": "Which JS framework is best, Backbone, Ember or Angular?", "901": "Which is better OS between Ubuntu and windows 10?", "902": "How Mashable finds Most-Shared Ads on YouTube?", "903": "Has Ancient Japan been scientifically tested?", "904": "What are some examples of pulleys in everyday life?", "905": "Has Ancient Japan been scientifically tested?", "906": "What is the best degree to get for the future?", "907": "I am presently 48 and shall be retiring after 10 years. To maintain the existing living standard, what are the best investment avenues for post retirement period?", "908": "What are your eating habits?", "909": "In the USA, how is the University of Southern California (USC) regarded as an undergraduate institution?", "910": "What is the most important invention of the last 300 years?", "911": "What are some mind-blowing mobile inventions that exist that most people don't know about?", "912": "Has Ancient Japan been scientifically tested?", "913": "What are some major controversies that have to do with marriage?", "914": "What are qualities of a good driver?", "915": "Where are the third year CS students of NITK interning in Summer 2014?", "916": "What is the best country to start a tech startup?", "917": "Has Ancient Japan been scientifically tested?", "918": "What kind of software do you need for your business?", "919": "If I want to sell goods from one state to another, then what kind of taxes are to be paid?", "920": "Which is the best data science training institute in NCR?", "921": "What is a good website for learning manual testing?", "922": "What are the best telugu 90's songs (melodies)?", "923": "Which is the best country to do mbbs?", "924": "Has Ancient Japan been scientifically tested?", "925": "What are some of the best examples of media hypocrisy in India?", "926": "What services are from Google: Facebook, YouTube or Twitter?", "927": "Your cat has to write a letter of recommendation for you. What do they say?", "928": "Has Ancient Japan been scientifically tested?", "929": "Which is the best logo designing company?", "930": "Which is the best trimmer in India?", "931": "What are some places to spend the weekend near Pune?", "932": "What is the nearest airport to Daytona Beach, and how do this cities tourist attractions compare to Missoula's?", "933": "What is the worst question or answer ever posted on Quora?", "934": "What are the top MNC for M.E software engineering providing high salary?", "935": "What are your favorite clothes?", "936": "Has Ancient Japan been scientifically tested?", "937": "Has Ancient Japan been scientifically tested?", "938": "Has Ancient Japan been scientifically tested?", "939": "Has Ancient Japan been scientifically tested?", "940": "Has Ancient Japan been scientifically tested?", "941": "What is the website of RD Sharma 12 class maths solved numerical?", "942": "What are the legal materials to print for a commercial use?", "943": "Has Ancient Japan been scientifically tested?", "944": "What are some major/bloody battles or conflicts that were fought on major holidays?", "945": "Has Ancient Japan been scientifically tested?", "946": "What are the best books to read regarding Chanakya's life?", "947": "What do you dislike most about the culture of your country?", "948": "Has Ancient Japan been scientifically tested?", "949": "What are the proper terminologies for a complex computer setup at home?", "950": "What books best depict the culture of Bahrain? How do they do it so well?", "951": "What are good conversation starters?", "952": "Has Ancient Japan been scientifically tested?", "953": "What is your success story?", "954": "Has Ancient Japan been scientifically tested?", "955": "Has Ancient Japan been scientifically tested?", "956": "What are the best sites for downloading free copies of electronic books?", "957": "Has Ancient Japan been scientifically tested?", "958": "I'm doing MBA now and I'm Handicap can anyone suggest me which sector is good for me to work? And which company will you suggest me?", "959": "Has Ancient Japan been scientifically tested?", "960": "What is the best way to broaden visions about the world?", "961": "Has Ancient Japan been scientifically tested?", "962": "Has Ancient Japan been scientifically tested?", "963": "Has Ancient Japan been scientifically tested?", "964": "What is the best game development company to work for?", "965": "Has Ancient Japan been scientifically tested?", "966": "If you have one crore rupees and had to spend it in one day, what would you do?", "967": "What laptops have M.2 NVMe SSD? If not, how come and what are the best (internal and external) SSDs available to laptops?", "968": "Has Ancient Japan been scientifically tested?", "969": "Has Ancient Japan been scientifically tested?", "970": "Has Ancient Japan been scientifically tested?", "971": "What is the best place in the Bay Area to buy a Golden Retriever puppy?", "972": "Who is the best politician in India? Why?", "973": "What is the bloodiest war in the U.S. history?", "974": "What are the biggest misconceptions about sex?", "975": "Has Ancient Japan been scientifically tested?", "976": "What are some of the best and affordable places/stores in Mumbai to shop for wedding clothes/trousseaus?", "977": "Which are the best colleges for MBA in corresspondence?", "978": "Has Ancient Japan been scientifically tested?", "979": "Which are the best coaching institutes for preparation of SSC CGL in Chandigarh?", "980": "Has Ancient Japan been scientifically tested?", "981": "What is the best laptop under 25000 in India?", "982": "Which is a good solar panel installation provider near Campbell, California CA?", "983": "What universities does Kaiser Aluminum recruit new grads from? What majors are they looking for?", "984": "What are the most interesting products and innovations that U.S. Steel is coming out with in 2016?", "985": "Which exam is best after B.Tech? GRE OR IELTS?", "986": "Is there anything which moves faster than light in the world?", "987": "Has Ancient Japan been scientifically tested?", "988": "If you died and God would give you another chance to life for 1 day what would you correct?", "989": "What are some best power banks?", "990": "What are the best corporate jobs for people who are bad at math?", "991": "What is the best app on iOS for downloading YouTube videos?", "992": "Has Ancient Japan been scientifically tested?", "993": "What is the best thriller novel of all time?", "994": "Which is best performing IITJEE coaching institute in India?", "995": "Has Ancient Japan been scientifically tested?", "996": "Has Ancient Japan been scientifically tested?", "997": "Has Ancient Japan been scientifically tested?", "998": "Has Ancient Japan been scientifically tested?", "999": "Which colleges are open for admission for MBA / PG?"}