{"0": "Which is the best Javascript Framework for beginners?", "1": "Out of Ancient Greece, Rome, the Medieval Ages, and the Renaissance, which would you think contributed the most to our society today economically?", "2": "Has Ancient Japan been scientifically tested?", "3": "Has Ancient Japan been scientifically tested?", "4": "Has Ancient Japan been scientifically tested?", "5": "What products do people buy the most online in a year?", "6": "What are the best photos of World War II?", "7": "Which is the best career option after +2 with non medical stream?", "8": "What are the subjects to study UPSC?", "9": "What are some cool cmd tricks?", "10": "What are some cute pictures to draw?", "11": "Has Ancient Japan been scientifically tested?", "12": "What time of year is it best to visit Democratic Republic of the Congo?", "13": "Has Ancient Japan been scientifically tested?", "14": "Which is the most inspirational movie ever?", "15": "To which planet in our Solar System would you like to go on a vacation if they were habitable?", "16": "Has Ancient Japan been scientifically tested?", "17": "How good is an MBA in sports management at Symbiosis School of Sports Sciences?", "18": "What are some of the most strange and unusual habits you have (you can go anonymous if you wish to)?", "19": "Has Ancient Japan been scientifically tested?", "20": "What are some of your favorite metaphors?", "21": "It ten years who will be the five best football sides in Europe?", "22": "What universities does Q2 recruit new grads from? What majors are they looking for?", "23": "What website do you think has great design?", "24": "Which countries provide financial help to India?", "25": "Has Ancient Japan been scientifically tested?", "26": "Has Ancient Japan been scientifically tested?", "27": "Has Ancient Japan been scientifically tested?", "28": "Has Ancient Japan been scientifically tested?", "29": "Has Ancient Japan been scientifically tested?", "30": "Which is better for aerospace engineering, UCLA or Imperial College London?", "31": "Has Ancient Japan been scientifically tested?", "32": "Has Ancient Japan been scientifically tested?", "33": "Has Ancient Japan been scientifically tested?", "34": "What are major project idea related to wind energy for final year be electrical and electronics engineering?", "35": "What NFL teams have won the most Super Bowl rings?", "36": "Has Ancient Japan been scientifically tested?", "37": "Has Ancient Japan been scientifically tested?", "38": "Has Ancient Japan been scientifically tested?", "39": "What are the essential skills of the project management?", "40": "What are some unexpected things first-time visitors to Kazakhstan notice?", "41": "Has Ancient Japan been scientifically tested?", "42": "What is UDAY for DISComs?", "43": "What are some of the best sites that you visit everyday?", "44": "Which one is better Snapdragon 820 or Helio P15?", "45": "Has Ancient Japan been scientifically tested?", "46": "Has Ancient Japan been scientifically tested?", "47": "What are the best foods for weight gain?", "48": "What are the most important articles or information WikiLeaks has released?", "49": "What are the most important components needed to create a compelling startup video?", "50": "What are some life lessons you learned from following the 1988 Presidential election that are helpful for other aspects of life?", "51": "Has Ancient Japan been scientifically tested?", "52": "Who will be the next president of US ?", "53": "With the success of Super 8, what are the most intriguing and nostalgic films of the last 4 decades that feature children and a coming of age story?", "54": "What is the training given to service dogs?", "55": "Review for we shine academy?", "56": "Which is better China or Taiwan?", "57": "Has Ancient Japan been scientifically tested?", "58": "Other than humans, what are some examples of the smartest mammals?", "59": "Has Ancient Japan been scientifically tested?", "60": "What good vs. bad habits have expats picked up after coming to Singapore?", "61": "What are some cute outfits to wear to a party?", "62": "What is your favourite Quote?", "63": "Has Ancient Japan been scientifically tested?", "64": "What are some awesome things to do in Copenhagen that are not in the standard guide books?", "65": "What should the philosophy of a student be?", "66": "What are the best college textbooks in English?", "67": "What are some of the best books on computer science?", "68": "Has Ancient Japan been scientifically tested?", "69": "What's the quote which inspired you the most?", "70": "Where is the best place to buy an electric guitar in India?", "71": "Has Ancient Japan been scientifically tested?", "72": "What are the best colleges in India for a BBA?", "73": "Has Ancient Japan been scientifically tested?", "74": "Has Ancient Japan been scientifically tested?", "75": "Has Ancient Japan been scientifically tested?", "76": "Are there any Quora Top Writers from 2010, 2011, or 2012?", "77": "Has Ancient Japan been scientifically tested?", "78": "Has Ancient Japan been scientifically tested?", "79": "Has Ancient Japan been scientifically tested?", "80": "Has Ancient Japan been scientifically tested?", "81": "Has Ancient Japan been scientifically tested?", "82": "Has Ancient Japan been scientifically tested?", "83": "What are the best stocks to invest in India for 2017?", "84": "What are the best casinos in the U.S.?", "85": "Which is better 4 years marine engineering after diploma in mechanical or 2 years pre-sea training(DME)?", "86": "Has Ancient Japan been scientifically tested?", "87": "What are the prices of the most beautiful commercial or condos tower in the world (2011+)?", "88": "Has Ancient Japan been scientifically tested?", "89": "Has Ancient Japan been scientifically tested?", "90": "What is the best investment I can make with $10,000?", "91": "How good are John Deere motorcycles?", "92": "Which T-Mobile phones have Wi-Fi calling?", "93": "What is a good solar panel installation provider near Scottsdale, Arizona AZ?", "94": "Which startups are hiring data scientists?", "95": "What is a good business plan for a group home?", "96": "What are some books you recommend for learning French?", "97": "Which are some of the big decisions you have made in life?", "98": "Has Ancient Japan been scientifically tested?", "99": "What are some startups in India?", "100": "Has Ancient Japan been scientifically tested?", "101": "What household chore do you hate to do the most?", "102": "What are your best sex experiences?", "103": "Who is the CEO of IBM？", "104": "What is the Best start up idea?", "105": "What is the best Windows laptop under $1000?", "106": "What are the works to be carried out as an assistant executive officer in mechanical department in ONGC?", "107": "What thing in your life has made you cry and cry and cry?", "108": "Has Ancient Japan been scientifically tested?", "109": "Has Ancient Japan been scientifically tested?", "110": "Has Ancient Japan been scientifically tested?", "111": "Has Ancient Japan been scientifically tested?", "112": "Has Ancient Japan been scientifically tested?", "113": "What is the toughest major at UC Berkeley?", "114": "Which is a better investment idea? Real estate investment vs stock market", "115": "Which woman has world's most attractive belly button?", "116": "What are some of the biggest lies that you have ever told?", "117": "What is a good thesis topic for a masters in public administration?", "118": "What is your favorite Prabhas movie and why?", "119": "How can we find the best SEO service provider company in India?", "120": "Has Ancient Japan been scientifically tested?", "121": "Has Ancient Japan been scientifically tested?", "122": "What are the most interesting places in the USA?", "123": "Which startups in London offer free lunch?", "124": "What are some things new employees should know going into their first day at Knight Trans?", "125": "Which is/are your favorite super commando dhruv comics?", "126": "Has Ancient Japan been scientifically tested?", "127": "Has Ancient Japan been scientifically tested?", "128": "Has Ancient Japan been scientifically tested?", "129": "Automobile parts manufacturing case studies?", "130": "Which Yamaha service center is best in Chennai?", "131": "Has Ancient Japan been scientifically tested?", "132": "What is most dangerous drug at present?", "133": "What are the advantages and disadvantages of studying an MBBS in China?", "134": "Has Ancient Japan been scientifically tested?", "135": "Has Ancient Japan been scientifically tested?", "136": "Has Ancient Japan been scientifically tested?", "137": "What are the most popular high-end restaurants and bars frequented by the \"Power Brokers\" of the burgeoning Digital Technology Venture Startup Scene in New York City?", "138": "Which is the most logical movie in the world?", "139": "What is the best novel to increase my writing skills?", "140": "If China and the US became one country (Chimerica) and conducted a democratic election for leader, what class (type) of candidates would run, and which would win?", "141": "What is the best way to find job in Dubai?", "142": "What is the craziest thing you have ever done with your professor?", "143": "What is the best book for Fuzzy logic?", "144": "Has Ancient Japan been scientifically tested?", "145": "Has Ancient Japan been scientifically tested?", "146": "What are some of the worst business decisions of all time?", "147": "Has Ancient Japan been scientifically tested?", "148": "Who is your favorite dictator and why?", "149": "What possible career would you get from graduating AB/BA Philosophy?", "150": "What is a suitable inpatient drug and alcohol rehab center in Keokuk County IA?", "151": "What are some hacks on booking cheap flight tickets?", "152": "Has Ancient Japan been scientifically tested?", "153": "What are the best love stories in Hollywood?", "154": "What are good examples of first-order thinking?", "155": "What should I have learned from a father?", "156": "Which is a good solar panel installation provider in Alhambra, California CA?", "157": "What game engine has the best graphics of them all?", "158": "Has Ancient Japan been scientifically tested?", "159": "What are the alternate options for packing material apart from plastic and paper bags?", "160": "What are some good websites or blogs that one can follow, to gain and update one's knowledge of History, Politics and Economics of India?", "161": "Has Ancient Japan been scientifically tested?", "162": "Between a 3 year LLB course or a 5 year BA LLB course, which one is better?", "163": "Has Ancient Japan been scientifically tested?", "164": "What’s the funniest thing that’s ever happened to you?", "165": "Has Ancient Japan been scientifically tested?", "166": "Which is best Dell laptop under 80000?", "167": "What is the best thing to eat after after a long run?", "168": "Which is better CA or an MBA?", "169": "Has Ancient Japan been scientifically tested?", "170": "What are the best motivational songs in English?", "171": "Has Ancient Japan been scientifically tested?", "172": "Has Ancient Japan been scientifically tested?", "173": "What is the most embarrassing thing that can happen to a professor?", "174": "Which is the better eCommerce platform, Webnexs, PrestaShop or Magento? Why?", "175": "What is lowest calorie food?", "176": "Has Ancient Japan been scientifically tested?", "177": "Has Ancient Japan been scientifically tested?", "178": "Has Ancient Japan been scientifically tested?", "179": "What are movies that everyone should see?", "180": "Has Ancient Japan been scientifically tested?", "181": "Which is the best GRE coaching center in Chennai?", "182": "Has Ancient Japan been scientifically tested?", "183": "Has Ancient Japan been scientifically tested?", "184": "What are some good substitutes for flake salt?", "185": "What universities does Pacific Biosciences recruit new grads from? What majors are they looking for?", "186": "What is the best thing you ever did for your mom?", "187": "Who are the best personal financial advisors in Fayetteville, AR for people saving for retirement? What were your experiences with them?", "188": "Has Ancient Japan been scientifically tested?", "189": "Has Ancient Japan been scientifically tested?", "190": "What songs make you cry?", "191": "Has Ancient Japan been scientifically tested?", "192": "Has Ancient Japan been scientifically tested?", "193": "Has Ancient Japan been scientifically tested?", "194": "Has Ancient Japan been scientifically tested?", "195": "Which candidate provided the better response to the question regarding Muslim Americans during the second debate?", "196": "Has Ancient Japan been scientifically tested?", "197": "Has Ancient Japan been scientifically tested?", "198": "Who is the best artist?", "199": "Which is better: the iPhone 6S Plus or the Samsung Galaxy S7 Edge?", "200": "What is the most famous thing in Slovenia?", "201": "Has Ancient Japan been scientifically tested?", "202": "Which writer should I follow for computer architecture (GATE oriented)? Hamacher or Patterson?", "203": "Has Ancient Japan been scientifically tested?", "204": "Has Ancient Japan been scientifically tested?", "205": "Has Ancient Japan been scientifically tested?", "206": "What are the best second hand bookstores in mumbai?", "207": "Has Ancient Japan been scientifically tested?", "208": "Has Ancient Japan been scientifically tested?", "209": "Has Ancient Japan been scientifically tested?", "210": "What universities does Logmein recruit new grads from? What majors are they looking for?", "211": "Which one is a better processor: 1.8 GHz Intel quad core or a 1.7 GHz Snapdragon Octacor?", "212": "Has Ancient Japan been scientifically tested?", "213": "Has Ancient Japan been scientifically tested?", "214": "If you as a low level employee have the opportunity to share a quality time with your general manager in a 1:1, what would you talk about?", "215": "Has Ancient Japan been scientifically tested?", "216": "What are some taboos in science?", "217": "What is the best and most powerful Kernel programming language so that I can use it to share Kernel data?", "218": "Has Ancient Japan been scientifically tested?", "219": "Has Ancient Japan been scientifically tested?", "220": "Has Ancient Japan been scientifically tested?", "221": "Has Ancient Japan been scientifically tested?", "222": "What is the best mixed drink to get at a bar?", "223": "Has Ancient Japan been scientifically tested?", "224": "Has Ancient Japan been scientifically tested?", "225": "What are some fun things to do in Delhi?", "226": "Is Memrise or Duolingo better for learning a new language? Or is something even better?", "227": "Has Ancient Japan been scientifically tested?", "228": "What are some of the things you think should change in your life?", "229": "What Linux distro are good alternatives to elementary OS?", "230": "What are some examples of an incomplete flower?", "231": "Has Ancient Japan been scientifically tested?", "232": "Which company is good for internship if I am a B.Tech 3rd year student from the CSE stream? How can I apply for the government companies?", "233": "Has Ancient Japan been scientifically tested?", "234": "Has Ancient Japan been scientifically tested?", "235": "Which is a good inpatient drug and alcohol rehab center in Guthrie County IA?", "236": "HR Technology: Who has experience using WageWorks or TASC as their benefits and flex spending administrator for a company with less than 500 employees? Which do you prefer and why? Are there issues with either systems?", "237": "Has Ancient Japan been scientifically tested?", "238": "What are some really good earphones to buy with a price range below Rs. 1000?", "239": "Has Ancient Japan been scientifically tested?", "240": "Where is the best place to have sex in public?", "241": "Latest global competitiveness report shows marked improvement in India's ranking. As a business owner or executive do you feel the improvement?", "242": "What are some best horror movies?", "243": "Has Ancient Japan been scientifically tested?", "244": "Has Ancient Japan been scientifically tested?", "245": "Has Ancient Japan been scientifically tested?", "246": "What are some of the most mind-blowing facts about Finland?", "247": "Has Ancient Japan been scientifically tested?", "248": "What are your worst sex experiences with your partner?", "249": "What is the most convincing evidence for extraterrestrial life/UFO's found on Earth?", "250": "What objections would you raise to having your email hosted in Office365?", "251": "What's the best place for a bachelor party in Mumbai?", "252": "Which programming languages are most fun to use and why?", "253": "Has Ancient Japan been scientifically tested?", "254": "What is the scariest Chinese ghost story?", "255": "What are the pros and cons of working in the real estate industry?", "256": "What were the best science podcasts?", "257": "What is the most truthful statement?", "258": "Has Ancient Japan been scientifically tested?", "259": "Has Ancient Japan been scientifically tested?", "260": "Has Ancient Japan been scientifically tested?", "261": "Are there any direct flights between Leeds and Ibiza, and what are Ibiza`s main tourist attractions?", "262": "If you ever write a book, what would it be about?", "263": "How important is it to do 4 years of foreign language in high school for college admissions?", "264": "Has Ancient Japan been scientifically tested?", "265": "Has Ancient Japan been scientifically tested?", "266": "What are the pros and cons of being a real estate agent?", "267": "What are the best countries worth visiting?", "268": "Which wild animal would you most like to see in its natural environment?", "269": "Has Ancient Japan been scientifically tested?", "270": "Has Ancient Japan been scientifically tested?", "271": "Which group is more \"prestigous\" to work for, the MIT Lincoln Laboratory or the Charles Stark Draper Laboratory?", "272": "Has Ancient Japan been scientifically tested?", "273": "Has Ancient Japan been scientifically tested?", "274": "What are the best Dragon Ball Z films? Why?", "275": "What is the best laptop for architects?", "276": "Which is a good solar panel installation provider in Queen Creek, Arizona AZ?", "277": "What are some must-have qualities in a leader?", "278": "What are the best tools to promote your website business?", "279": "Has Ancient Japan been scientifically tested?", "280": "Who is a great app developer to partner with if I have an app idea?", "281": "Which is the best book for basic c language?", "282": "What are the facilities provided to a GC in OTA chennai?", "283": "What are your favorite APIs and why?", "284": "Which Reddit user has the least amount of comment karma?", "285": "Which is the best app/website to get knowledge about world politics?", "286": "Has Ancient Japan been scientifically tested?", "287": "Which company is best for fresher?", "288": "Has Ancient Japan been scientifically tested?", "289": "What types of car sales/transfers are there? (person2person, auction/dealer-dealer, dealer-person, fleet-auction) Any good reference sites? Thxs!", "290": "I am new to video editing. I am good at Filmora. What other advanced video editing software and supporting software should I learn?", "291": "Which processor is better (faster/more efficient), Snapdragon or Intel Core?", "292": "Which is the best institute to do digital marketing in Delhi?", "293": "What are the best Top 10 Binary Options Brokers and Bonuses?", "294": "Has Ancient Japan been scientifically tested?", "295": "What are some foods that start with the letter I?", "296": "Who is the most interesting person on Quora?", "297": "If two polyglots could communicate in several languages, how would they choose which language to use?", "298": "What are some things that can be recycled?", "299": "Has Ancient Japan been scientifically tested?", "300": "Which country's number system is the oldest and most organized?", "301": "What color should I paint my nails?", "302": "What are some of the fascinating 4-digit numbers?", "303": "What are some of the most important things you would tell your 19 year old self?", "304": "Which countries are the easiest to get permanent residency in?", "305": "Which bank is better for mutual fund?", "306": "How competitive is the hiring process at 1-800-Flowers.com?", "307": "What are your 3 favorite Halloween movies?", "308": "Which other jobs do massage therapists tend to have?", "309": "How senior is an editor?", "310": "Name some inspiring books to gift for retiring person?", "311": "Has Ancient Japan been scientifically tested?", "312": "Has Ancient Japan been scientifically tested?", "313": "Which is Shahrukh Khan's best movie?", "314": "What are the best bus services between Delhi and Manali?", "315": "Has Ancient Japan been scientifically tested?", "316": "What are some must read books for teenagers?", "317": "What are the best places to share your YouTube videos?", "318": "What is the worst thing a child can do to a parent?", "319": "At an academic conference, how does the selection committee choose which paper winds the \"best paper award\"?", "320": "Who are the founders of Google?", "321": "What are some romantic things you can do for a girl?", "322": "Which physics journal publishes the fastest?", "323": "Has Ancient Japan been scientifically tested?", "324": "Has Ancient Japan been scientifically tested?", "325": "Has Ancient Japan been scientifically tested?", "326": "At what age do humans look the most physically attractive?", "327": "Which gaming console should I buy: PS4 or Xbox One?", "328": "Has Ancient Japan been scientifically tested?", "329": "Has Ancient Japan been scientifically tested?", "330": "Has Ancient Japan been scientifically tested?", "331": "What's the range of a very good GRE score?", "332": "What should everyone know about the Business Model Canvas?", "333": "What is isaac and how it can help me? I m b.tech student of 3rd year of electronics and instrumentation branch.", "334": "Has Ancient Japan been scientifically tested?", "335": "Has Ancient Japan been scientifically tested?", "336": "How many branches are there in mechanical engineering?", "337": "When it comes to saving money on travel, what is the biggest difference when you started and now?", "338": "What is the best gift for my sister in law?", "339": "If Barack Obama was not a presidential candidate in the 2008 election, who would most likely have been the Democratic nominee?", "340": "Has Ancient Japan been scientifically tested?", "341": "What kind of training does an IAS officer get?", "342": "Which is the best laptop under 50000 considering all prospects?", "343": "Has Ancient Japan been scientifically tested?", "344": "Has Ancient Japan been scientifically tested?", "345": "Has Ancient Japan been scientifically tested?", "346": "Has Ancient Japan been scientifically tested?", "347": "Has Ancient Japan been scientifically tested?", "348": "What is the best bartending school in Toronto? What are the requirements to attend this school?", "349": "What is the day in the life like for a venture capitalist?", "350": "Has Ancient Japan been scientifically tested?", "351": "What is it like to go through basic training in the army?", "352": "What are the best chrome extensions for web development?", "353": "What are the places to see in Coorg?", "354": "If you could tell your younger self one thing, what would it be and why?", "355": "What is better auto mobile or it engineering?", "356": "Which is the best institute for research and for a regular MBBS / MD / MS: AIIMS, PGIMER or JIPMER?", "357": "If North-East India is better than other parts of the country, why don't people rush to make their lives there instead of going to metropolitan cities?", "358": "Has Ancient Japan been scientifically tested?", "359": "What's the dress code for an interview at Amazon?", "360": "What are the best places (other than famous ones) to visit in India?", "361": "Has Ancient Japan been scientifically tested?", "362": "What are some good non-fiction books on altruism?", "363": "Has Ancient Japan been scientifically tested?", "364": "Has Ancient Japan been scientifically tested?", "365": "Which things a student should know about IITs and NITs before taking an admission in it?", "366": "What would a good fan fiction for Naruto be on?", "367": "What was your medical residency like?", "368": "What is the best audio file type?", "369": "Has Ancient Japan been scientifically tested?", "370": "What are small business options in india?", "371": "Has Ancient Japan been scientifically tested?", "372": "Has Ancient Japan been scientifically tested?", "373": "What are the best ways to propose homosexual sex to someone you've never met before in your country / culture?", "374": "Arrange Marriage: What should be the checklist before choosing your life partner?", "375": "Working models for maths for class 9th?", "376": "Which big 4 is easier to get a job into?", "377": "Has Ancient Japan been scientifically tested?", "378": "Has Ancient Japan been scientifically tested?", "379": "What is the best bank to open a corporate bank account with?", "380": "Has Ancient Japan been scientifically tested?", "381": "Out of everything you've drawn, what's your favorite doodle and why?", "382": "Has Ancient Japan been scientifically tested?", "383": "Has Ancient Japan been scientifically tested?", "384": "Has Ancient Japan been scientifically tested?", "385": "Has Ancient Japan been scientifically tested?", "386": "What are the best online clothing shops that offer worldwide delivery and have reasonable prices?", "387": "Has Ancient Japan been scientifically tested?", "388": "What are the electronics in U.S. passports?", "389": "Mobile App Distribution Platforms: What are the post popular Android app stores in India?", "390": "What would an ideal high school math club look like?", "391": "Which university is best for an M.S in mechanical engineering?", "392": "How many people are in job in india?", "393": "What are the best research topics in civil engineering for undergraduates?", "394": "What are some of the best compliments which I can give to a singer?", "395": "What are the chances in MBA if I score 95% in class 10, 90% in class 12 and 60% in graduation?", "396": "Who is more powerful IAS or an Army Commissioned officer?", "397": "What is the most efficient way to be updated with a lot of news sources?", "398": "What's the best resource to learn about web scraping?", "399": "Has Ancient Japan been scientifically tested?", "400": "What makes a good sales person?", "401": "What is the most significant book that you have read and why?", "402": "Has Ancient Japan been scientifically tested?", "403": "What is the hardest thing(s) about raising children in Norway?", "404": "Has Ancient Japan been scientifically tested?", "405": "Has Ancient Japan been scientifically tested?", "406": "Has Ancient Japan been scientifically tested?", "407": "What should BJP do to win upcoming UP Elections?", "408": "How did you become a CEO?", "409": "Has Ancient Japan been scientifically tested?", "410": "Has Ancient Japan been scientifically tested?", "411": "What is the best way to prepare for IITJEE 2017?", "412": "Has Ancient Japan been scientifically tested?", "413": "If I were to start an insurance agency, what company would you recommend?", "414": "What are some of the best ways to invest Rs. 25 lakhs in India to get best returns? Both short-term and long-term investments are OK.", "415": "What's a good score for the GRE subject test in Mathematics?", "416": "Which is better The Walking Dead or Game of Thrones? What do you guys think?", "417": "Has Ancient Japan been scientifically tested?", "418": "What do you want in life?", "419": "What salary shall be expected with 2 years of experience as a technical support?", "420": "What are some mind-blowing vehicles that exist in 2016 that most people don't know about?", "421": "What's a good Python editor/IDE?", "422": "Has Ancient Japan been scientifically tested?", "423": "I have passed 12 this year and I am interested in law. What are the courses and colleges in India?", "424": "Has Ancient Japan been scientifically tested?", "425": "Which are the sources availablefor APPSC AEE General studies preparation?", "426": "What are some good examples of Minimal Viable Products?", "427": "Has Ancient Japan been scientifically tested?", "428": "Harvey Specter versus Sheldon Cooper. Who is the best for you? Why?", "429": "Has Ancient Japan been scientifically tested?", "430": "Which is the best resume ever any by whom?", "431": "Has Ancient Japan been scientifically tested?", "432": "What should I want to do get core industry job? As electronics engineer", "433": "What universities does Banner recruit new grads from? What majors are they looking for?", "434": "What Beatles songs have the best bass lines?", "435": "Has Ancient Japan been scientifically tested?", "436": "What are the recent social media trends to follow?", "437": "Which software applications do most hospitals use?", "438": "Has Ancient Japan been scientifically tested?", "439": "What are the best human resources?", "440": "What modern films will become classics?", "441": "Who is the most famous poets?", "442": "Which programs or services are best for IELTS preparation?", "443": "Has Ancient Japan been scientifically tested?", "444": "Has Ancient Japan been scientifically tested?", "445": "Has Ancient Japan been scientifically tested?", "446": "What is the application deadline for Arizona State University for admissions in Fall 2016?", "447": "Who writes the speeches given by academic toppers at various places?", "448": "Who is the next US president in your think?", "449": "What are the job prospects of civil engineers in Australia?", "450": "What are the trends in mobile technology of 2015?", "451": "What do you usually wear to sleep?", "452": "What are some places to visit in Mumbai, Thane, UpTo Kalyan it should include temples, national parks, zoo, historical places etc.?", "453": "Computer science graduate schools and low GPA?", "454": "What are some wonders of the ancient world?", "455": "What is the cutest thing your pet has ever done?", "456": "Has Ancient Japan been scientifically tested?", "457": "Has Ancient Japan been scientifically tested?", "458": "Has Ancient Japan been scientifically tested?", "459": "What are some of the best quotes from the Netflix series Peaky Blinders?", "460": "What question would you really like to be asked?", "461": "What is the best bedding from dELiA*s?", "462": "What is the most impactful anyone has done in their life?", "463": "What actor would play you in a movie about your life?", "464": "What are some amazing scientific experiment that we can conduct at home?", "465": "How was your experience at Codechef Snackdown 2016 on-site Finale?", "466": "Has Ancient Japan been scientifically tested?", "467": "What are the exams for getting a job in the central armed police force?", "468": "What are some beautiful Arabic or Urdu names for a new house?", "469": "Has Ancient Japan been scientifically tested?", "470": "What is the best advice you have given on Quora?", "471": "What are some of the best examples of \"beauty with brains\"?", "472": "What email tracking service allows me to see what type of device the recipient opened the email on?", "473": "Who would have been the best choice to play Anakin Skywalker in the Star Wars prequel trilogy?", "474": "What are the pros and cons of Pulsar RS 200? Is it reliable and refined? Can I get a detailed review?", "475": "Which is the best online coaching institute for SSC CGL?", "476": "Has Ancient Japan been scientifically tested?", "477": "What are some of the best (or worst) instances of sledging in cricket?", "478": "What NSE/BSE stocks can be used for scalping on a daily basis?", "479": "What is the best dermatologist/cosmetology clinic in bangalore, preferably in South Bangalore?", "480": "What is the job profile of fresh IEM graduates? Which departments and roles do they take up?", "481": "What do you like about the hospitality industry?", "482": "Has Ancient Japan been scientifically tested?", "483": "As an entrepreneur, what is the biggest mistake you have made and how would you advise others not to make the same mistake?", "484": "What should we really be learning at school?", "485": "What are some examples of universal solvents?", "486": "Has Ancient Japan been scientifically tested?", "487": "Which is the best bicycle to buy in India around the range of 10000 and for commuting purposes?", "488": "Which is the best place in mumbai, near borivali, for a candle light dinner?", "489": "What is the best TV Series in Hindi? Why?", "490": "Which should I learn first, data base or data structure?", "491": "Which is the easiest science graduate course for Calcutta university?", "492": "What are some things new employees should know going into their first day at Champion Iron?", "493": "Book to learn draw?", "494": "What is the best hostel in Sydney, Australia?", "495": "What are the tastiest Indian vegetarian dish?", "496": "What is the latest fad among the youth of Russia?", "497": "Has Ancient Japan been scientifically tested?", "498": "Has Ancient Japan been scientifically tested?", "499": "Has Ancient Japan been scientifically tested?", "500": "Has Ancient Japan been scientifically tested?", "501": "Has Ancient Japan been scientifically tested?", "502": "Has Ancient Japan been scientifically tested?", "503": "If you have one crore rupees and had to spend it in one day, what would you do?", "504": "Life Advice: What are some of the most important things that we should be informed about in life?", "505": "I want to learn to code. Which programming language should I start with?", "506": "What are currently topics in algorithms and software engineering for research in computer sceince?", "507": "What company provides the best SEO services in India?", "508": "Has Ancient Japan been scientifically tested?", "509": "What is the best picture you have seen ever?", "510": "Which are the best books in Gujarati literature one must read at present time?", "511": "What colour is this dress?", "512": "Has Ancient Japan been scientifically tested?", "513": "Which photo booth is the best in Sydney?", "514": "Has Ancient Japan been scientifically tested?", "515": "What's it like to work at E.W. Scripps for your first job?", "516": "Which specialization for an M.S. in electronics and communication engineering has the best scope in Canada in terms of job demand and pay?", "517": "Has Ancient Japan been scientifically tested?", "518": "What are some of the best startups of 2014?", "519": "What is the cutoff for mechanical engineering in BITS Goa?", "520": "What websites have the best user experience?", "521": "What do you have for breakfast, lunch, or dinner?", "522": "What is a good business idea for a 16-18 year old in school?", "523": "What is the language that most people want to learn?", "524": "What is the most epic historical battle ever?", "525": "Which rap recordings are most accessible to people outside the African-American community?", "526": "Has Ancient Japan been scientifically tested?", "527": "What is the best time to have fruits?", "528": "Has Ancient Japan been scientifically tested?", "529": "Has Ancient Japan been scientifically tested?", "530": "What were some things India did but wasn't credited for?", "531": "What are the best Wordpress marketing plugins?", "532": "How much does it cost to develop an Android app in India?", "533": "What is the ultimate aim of politics?", "534": "Has Ancient Japan been scientifically tested?", "535": "In which other countries, apart from India, is the national anthem required to be played in movie theatres before screening?", "536": "Has Ancient Japan been scientifically tested?", "537": "What is the best washing machine around 25000?", "538": "Which is the best method to store text document, images and videos together on a graph node?", "539": "What qualities a good guy want in his girlfriend?", "540": "What's the best way to spend your weekend in Hyderabad?", "541": "Has Ancient Japan been scientifically tested?", "542": "What is the most arrogant thing you have ever done?", "543": "What is business model for e commerce?", "544": "Has Ancient Japan been scientifically tested?", "545": "What does it take to be a great theoretical physicist in today's academic market?", "546": "What are the things that are used today in the same way as they were used 40-50 years ago?", "547": "What are some teen horror films set in the suburbs?", "548": "Has Ancient Japan been scientifically tested?", "549": "What is the best and cheapest place to shop for handbags online? Then ship worldwide?", "550": "Has Ancient Japan been scientifically tested?", "551": "Has Ancient Japan been scientifically tested?", "552": "What is the greatest number that will divide 43, 91 and 183 so as to leave the same remainder in each case?", "553": "Has Ancient Japan been scientifically tested?", "554": "Which is the best laptop to buy under 60k in India?", "555": "What are the complete set of tools required for building an web application from scratch?", "556": "What sort of food do you like?", "557": "What is your favorite tf2 class, and why?", "558": "Has Ancient Japan been scientifically tested?", "559": "What courses are available generally in spot round in nsit?", "560": "What is a good web site for online chiropractic CE and chiropractic webinars approved in Iowa?", "561": "What are the interview questions asked in KPMG Partner's round interview?", "562": "Has Ancient Japan been scientifically tested?", "563": "What are the basic requirements to start a solar power plant?", "564": "Has Ancient Japan been scientifically tested?", "565": "Has Ancient Japan been scientifically tested?", "566": "What are the most important financial KPIs for Adidas?", "567": "Has Ancient Japan been scientifically tested?", "568": "Has Ancient Japan been scientifically tested?", "569": "Where is the world's longest escalator?", "570": "How good are the professors at NITK Surathkal in the chemical department? What are the hours per week per semester for the branch?", "571": "What are the best lyrics pranc songs for your friends?", "572": "What Youtube videos do you watch?", "573": "How many photographers are there in the US in 2016?", "574": "I need a portable speaker with woofer in it. Which brand should I prefer?", "575": "When should you exercise Employee Stock Options?", "576": "What is your notebook 1?", "577": "Which mobile is better under 7k with 5.5 inches size?", "578": "As an MBA graduate what difference can I make in the society?", "579": "If you had five years to travel the world to learn and improve yourself where would you go?", "580": "Has Ancient Japan been scientifically tested?", "581": "Where is your favorite place you have traveled to?", "582": "What's your favourite liquid foundation?", "583": "Has Ancient Japan been scientifically tested?", "584": "What is a good alternative to powered by?", "585": "What do you need to become a famous lawyer?", "586": "Has Ancient Japan been scientifically tested?", "587": "Which one is better mobile leeco le 2 or red mi note 3 32 GB.?", "588": "Which Windows laptops come closest to the the build quality of MacBooks?", "589": "Has Ancient Japan been scientifically tested?", "590": "What is the right profession for an introvert?", "591": "What are the requirements for a foreign graduated mechanical engineer to get an engineering job in USA?", "592": "What are some good names for imaginary animals?", "593": "Has Ancient Japan been scientifically tested?", "594": "What are some weird things that people fear?", "595": "Which studio does the best ecommerce photography Delhi?", "596": "What are some good restaurants in Manhattan?", "597": "Has Ancient Japan been scientifically tested?", "598": "I'm a 5 letter word. I am normally below you. If you remove my 1st letter, you'll find me above you. If you remove my 1st & 2nd letters, you can't see me. What am I?", "599": "What is the average score of pte academic?", "600": "What are the necessary requirements for the GRE exams?", "601": "Has Ancient Japan been scientifically tested?", "602": "Has Ancient Japan been scientifically tested?", "603": "Has Ancient Japan been scientifically tested?", "604": "Which operators cannot be overloaded in C++?", "605": "Has Ancient Japan been scientifically tested?", "606": "What are your best 5 videos which you want to see again & again on YouTube?", "607": "Which part of the brain works while programming?", "608": "In what ways is the IB programme difficult?", "609": "Where can I found beautiful wedding cakes to suit a range of wedding themes at Gold Coast?", "610": "Has Ancient Japan been scientifically tested?", "611": "What are the best resources online to self-study German?", "612": "Who runs YouTube's mergers and acquisitions team?", "613": "If God could grant you one wish - and you could ask for absolutely anything you wanted, like Solomon, what would you ask for?", "614": "Has Ancient Japan been scientifically tested?", "615": "What are all the Career opportunities in cricket in India?", "616": "Has Ancient Japan been scientifically tested?", "617": "What is the most popular Chinese food in the United States?", "618": "Which are the top places to visit in Texas?", "619": "How important are high school friends in life?", "620": "Has Ancient Japan been scientifically tested?", "621": "What is the most believable paranormal experience you have had or heard of?", "622": "How do I find the list of the US companies that are expanding into India in 2015 and beyond?", "623": "Has Ancient Japan been scientifically tested?", "624": "What are the best alternatives to Trello?", "625": "What are the best venture capital funds in Asia?", "626": "What is the best optional subject for civil service examination?", "627": "What are some good Hindi songs (female) for an audition?", "628": "What is the present situation regarding job opportunities in USA after doing MS in CS?", "629": "Has Ancient Japan been scientifically tested?", "630": "Iitjee coaching centre in Kolkata?", "631": "Who all are attending Grace Hopper Celebration of Women in Computing, India in Bangalore 2015?", "632": "What is the output of the following program?", "633": "What's the creepiest/scariest teacher experience you've had?", "634": "What are some mind-blowing Wallets that most people should have?", "635": "What is your biggest life lesson?", "636": "Has Ancient Japan been scientifically tested?", "637": "Has Ancient Japan been scientifically tested?", "638": "What are the best VR roller coaster apps?", "639": "Who was the best actor in Game of Thrones season 1?", "640": "Has Ancient Japan been scientifically tested?", "641": "Has Ancient Japan been scientifically tested?", "642": "Where do you think Machine Learning fits within Design?", "643": "What is the largest open world game?", "644": "Which type of SEO has a more percentage of organic traffic, on-page or off-page?", "645": "Which is the most astonishing piece of code you've ever seen in your life?", "646": "Who makes the best tattoo machines and kits?", "647": "Which are the best ovreseas placement consultancies in Pune?", "648": "What are the best rock climbing magazines?", "649": "What should be taught to kids?", "650": "Which app lets you watch live football for free?", "651": "How are the job opportunities after taking an MS in computer science from NYU Poly?", "652": "Has Ancient Japan been scientifically tested?", "653": "What should be ones score in JEE mains to get innto dtu or iiitd or nitd with obc category and outside delhi region? 2017", "654": "What iOS calendar/planning app allows you to mark both an event and tasks as completed?", "655": "What are the main industries available in Chhattisgarh?", "656": "What are the upcoming hackathons in India in 2016 ? Is there no place where we can get all this Info?", "657": "Has Ancient Japan been scientifically tested?", "658": "Who are the other French-speaking people on Quora?", "659": "What is logger buffer size in android developer options?", "660": "What is the best WordPress booking plugin?", "661": "Has Ancient Japan been scientifically tested?", "662": "What are the mandatory features of an MDM product (master data management)?", "663": "What limits the popularity of IIST and IISER in comparison with IIT?", "664": "I have an upper ear cartilage piercing. What type of earrings are best for that type of piercing?", "665": "Which are the best universities in Germany for getting a degree in electrical engineering?", "666": "How do students choose their specialization, while applying for Masters (MS) in U.S?", "667": "What is a suitable inpatient drug and alcohol rehab center in Lake County IL?", "668": "What are the data sources of LinkedIn big data architecture?", "669": "What are the best open source ITSM tools?", "670": "Which is best online store to buy running gear and clothes?", "671": "Who is one of your favourite children's book illustrators?", "672": "Has Ancient Japan been scientifically tested?", "673": "Has Ancient Japan been scientifically tested?", "674": "What universities does CVS Health recruit new grads from? What majors are they looking for?", "675": "Has Ancient Japan been scientifically tested?", "676": "Has Ancient Japan been scientifically tested?", "677": "Has Ancient Japan been scientifically tested?", "678": "What will be your best advice for long road travel in bike? Share your experiences if any?", "679": "Has Ancient Japan been scientifically tested?", "680": "Has Ancient Japan been scientifically tested?", "681": "What are the best sites to learn web develepment?", "682": "I have a Bsc in microbiology and I want to go for my masters degree and am thinking of two options either public health or clinical and infectious disease. Which of the option is more advisable for me to go for?", "683": "What is the best way to write an opinion essay if you only have 30 minutes?", "684": "Has Ancient Japan been scientifically tested?", "685": "Has Ancient Japan been scientifically tested?", "686": "Has Ancient Japan been scientifically tested?", "687": "What are the best novels/memoirs of 2016 (especially from the second half of 2016)?", "688": "How important is competitive programming to machine learning?", "689": "What is the best tool to automatically transcribe audio files?", "690": "What is the best thing we can do when we are angry?", "691": "What is a good solar panel installation provider near Aguanga, California CA?", "692": "Which is a best mobile I can get at a price lower than 10,000?", "693": "What is your favorite Disney character? Why?", "694": "Who are some of the best professors in IIEST, Shibpur ? (Formerly BESUS)", "695": "What is a good college for computer science?", "696": "What is the difference between various contact lens solutions and which one is the best?", "697": "What are the best ski resorts in Chicago?", "698": "Has Ancient Japan been scientifically tested?", "699": "What skills do all successful salespeople have in common?", "700": "What are the most common SEO mistakes?", "701": "What pattern are you repeating in your life that you'd like to break?", "702": "What is the best subject in senior secondary to get through ipm after school?", "703": "What are the pros and cons in marrying a girl older than you?", "704": "Has Ancient Japan been scientifically tested?", "705": "What are some of the worst strategies for making the world a better place?", "706": "What are some of the basic problems in the education system of BITS Pilani?", "707": "What are some things new employees should know going into their first day at Western Liberty Bank?", "708": "What is a good news source?", "709": "Can you suggest a software to write simple programs in C?", "710": "What is the most unexpected things paradox you have saw?", "711": "What are good gifts for a foreign visitor to bring when they're invited to someone's home in Bangladesh for the first time?", "712": "Has Ancient Japan been scientifically tested?", "713": "What are the best courses of Business Analytics in the world?", "714": "Has Ancient Japan been scientifically tested?", "715": "What are the Top ten strongest dragon ball z characters?", "716": "Has Ancient Japan been scientifically tested?", "717": "Has Ancient Japan been scientifically tested?", "718": "What are the best books to learn Java and Sql from basics?", "719": "What are some examples of vertebrates?", "720": "What are some of the best projects to work on in a gas plant?", "721": "Has Ancient Japan been scientifically tested?", "722": "What are some good ideas for a bachelorette party in Hyderabad?", "723": "Has Ancient Japan been scientifically tested?", "724": "What are the safest treatments for impotence?", "725": "Has Ancient Japan been scientifically tested?", "726": "Which is better for a CSE, IEM or HIT-K?", "727": "Has Ancient Japan been scientifically tested?", "728": "Has Ancient Japan been scientifically tested?", "729": "Has Ancient Japan been scientifically tested?", "730": "What is the best engineering major for the future?", "731": "What are some time-saving tips that every Facebook user should know?", "732": "What changes can I make to have a successful life?", "733": "Has Ancient Japan been scientifically tested?", "734": "Which movie site offers the more accurate ratings? IMDB or Rotten Tomatoes?", "735": "Has Ancient Japan been scientifically tested?", "736": "Has Ancient Japan been scientifically tested?", "737": "What is a good salary for a single person in Zurich?", "738": "What are the best websites for graphic design?", "739": "Has Ancient Japan been scientifically tested?", "740": "Which movie will win the 2015 Best Original Screenplay Academy Award and which movie should win?", "741": "What will tech recruiting look like in the next 5-10 years?", "742": "I am a HR professional, I want to do SAS course. I have statistics, Mathematics and Economics background. What is the use of SAS in HR field and How?", "743": "Which gaming system is better for sport games such as Madden and NBA, Xbox or Playstation?", "744": "Which business/startup should I start in Nagpur which will have best chances of survival?", "745": "What's the best book you've never read, and never will?", "746": "Has Ancient Japan been scientifically tested?", "747": "What are the best Payday loans to acquire?", "748": "Has Ancient Japan been scientifically tested?", "749": "Has Ancient Japan been scientifically tested?", "750": "Who is the best mutual fund manager in India?", "751": "Are there Reggio Emilia preschools in Montréal? If so, what are the good ones?", "752": "What are the spots in this Car engine?", "753": "Which is a good solar panel installation provider near Circle City, Arizona AZ?", "754": "Has Ancient Japan been scientifically tested?", "755": "Has Ancient Japan been scientifically tested?", "756": "Overall, How is Shiv Nadar University?", "757": "What are some success stories from online Learning to Program websites?", "758": "What is the most convincing proof for extra terrestrials?", "759": "What universities does Copa Airlines recruit new grads from? What majors are they looking for?", "760": "Has Ancient Japan been scientifically tested?", "761": "What is the best reference book for the Management Aptitude Exam (MAT) for an MBA?", "762": "What are some of the best feelings in life?", "763": "What are the most fun things to do in Cancun?", "764": "What would be your strategy for a supermarket shopping spree?", "765": "What is the future scope for programming languages like Java, .NET, PHP, Python, etc.?", "766": "What motors are used in railways? Is AC or DC", "767": "What are good games to play through text?", "768": "Which Institute is best for industry oriented training and placement for instrumentation engineers?", "769": "How do MIT, Princeton, Wharton and Columbia's financial engineering schools compare?", "770": "What does Stephen Fry read? What are his favorite books?", "771": "What's a good video course for job interviewing?", "772": "What's an alternative site to bookfi.net?", "773": "Which country is the most difficult to invade?", "774": "Which is the best library in Mumbai?", "775": "What products have you used to treat your tinnitus?", "776": "What's that one thing which makes you proud of yourself?", "777": "Which are the best photo editing apps for Android?", "778": "Has Ancient Japan been scientifically tested?", "779": "What is the salary of an SBI PO officer?", "780": "What are some of the best questions/answers asked/given by kids?", "781": "F.R.I.E.N.D.S or The Big Bang Theory: Which one is more comical and why? Also which is the one that can be watched with family.", "782": "What are some examples of exceptional customer experience?", "783": "Which university is better UET vs NUST?", "784": "I'm gonna get a new phone this Christmas/New year. Which one should I get. IPhone 6s in 64GB or iPhone 7 in 32GB?", "785": "Has Ancient Japan been scientifically tested?", "786": "What do you like to do?", "787": "What should international students do to study at MIT on a scholarship?", "788": "Has Ancient Japan been scientifically tested?", "789": "Which one should I buy as a beginner keyboard? Yamaha PSR-E353 or PSR E-453?", "790": "What are some good PMP training classroom sessions in Delhi, NCR?", "791": "What universities does Agilent Technologies recruit new grads from? What majors are they looking for?", "792": "Has Ancient Japan been scientifically tested?", "793": "What is the creepiest dejavu experience that you ever had?", "794": "Which is the best way to learn to play the violin?", "795": "What is the use of database in programing?", "796": "Has Ancient Japan been scientifically tested?", "797": "Has Ancient Japan been scientifically tested?", "798": "Has Ancient Japan been scientifically tested?", "799": "What is the best joke you know?", "800": "Looking for second hand Innova car in Mumbai, if any one has any information? Please inform me.", "801": "Has Ancient Japan been scientifically tested?", "802": "Has Ancient Japan been scientifically tested?", "803": "What are all the sex positions?", "804": "Has Ancient Japan been scientifically tested?", "805": "What are some classes you wish you took in high school?", "806": "Has Ancient Japan been scientifically tested?", "807": "Has Ancient Japan been scientifically tested?", "808": "Has Ancient Japan been scientifically tested?", "809": "What is best book to learn computer science from basics?", "810": "Has Ancient Japan been scientifically tested?", "811": "I want to become a hacker for the CIA or something cool like that. What's the best programming language to use for hacking?", "812": "Has Ancient Japan been scientifically tested?", "813": "What are the best sources for free (and paid) e-books?", "814": "Which is better, Selenium or QTP? Why?", "815": "Wedding gifts for a guy?", "816": "Has Ancient Japan been scientifically tested?", "817": "What serial killer has the most kills?", "818": "Has Ancient Japan been scientifically tested?", "819": "What can sales people learn from marketers and marketers learn from sales people?", "820": "What are the best things in Pune?", "821": "What is the most stupid question asked on Quora?", "822": "What is your \"whatever goes around comes around\" moment?", "823": "What are the highest paying careers?", "824": "Has Ancient Japan been scientifically tested?", "825": "Has Ancient Japan been scientifically tested?", "826": "Has Ancient Japan been scientifically tested?", "827": "HOw to get prepare for placements at IHM Mumbai and which book should we refer to get through managment trainne program?", "828": "What is this app called?", "829": "What is the best Dota 2 hero to raise MMR in the 3.5 - 4k bracket?", "830": "Yanis Varoufakis: Which five books on monetary policy and banking would you suggest to an interested layman?", "831": "Has Ancient Japan been scientifically tested?", "832": "Has Ancient Japan been scientifically tested?", "833": "What are some practical skills every man must know?", "834": "Has Ancient Japan been scientifically tested?", "835": "Which is the best browser for Quora?", "836": "Has Ancient Japan been scientifically tested?", "837": "Which are the places to go backpacking solo in India, if you're a girl?", "838": "Has Ancient Japan been scientifically tested?", "839": "What are some good words to describe snow?", "840": "Has Ancient Japan been scientifically tested?", "841": "What is the merit or demerits of redmi 3s?", "842": "Has Ancient Japan been scientifically tested?", "843": "Which is the most expensive car in the world?", "844": "Has Ancient Japan been scientifically tested?", "845": "Has Ancient Japan been scientifically tested?", "846": "Which college is best for aerospace engineering other than IITs?", "847": "What are the best two liner poems in Hindi? (English translation must be provided)", "848": "What is the best open source mind mapping software and why?", "849": "What is the best platform or tool to use if you want to teach a 10 years old girl basic programming skills and techniques in a fun, logic and inspiring way?", "850": "What are the most exciting places to see in Singapore as a tourist? Why?", "851": "If you had to have a mathematical equation tattooed on your body, which one would you choose, and why?", "852": "What are some of the biggest problems that philosophers have solved?", "853": "Has Ancient Japan been scientifically tested?", "854": "What are the best and worst things about public transit in Changchun, Jilin, China? How could it be improved?", "855": "Has Ancient Japan been scientifically tested?", "856": "What are some of your favorite lines from a song?", "857": "What is the best story you can write in only one sentence?", "858": "What is the financial market?", "859": "Has Ancient Japan been scientifically tested?", "860": "Has Ancient Japan been scientifically tested?", "861": "Has Ancient Japan been scientifically tested?", "862": "Which phone can I buy under ₹20000?", "863": "Which laptop is better, Dell or Lenovo?", "864": "What is best web designing or web development?", "865": "Who provides DJs for a private function in Sydney?", "866": "What is the current research topics in operations and supply chain management?", "867": "Has Ancient Japan been scientifically tested?", "868": "What are some of the best Bob Dylan lyrics?", "869": "What advice would you give to a very optimistic (sometimes foolishly optimistic) 17 year old girl?", "870": "Has Ancient Japan been scientifically tested?", "871": "[UPSC] : Which paper of political science & international ralations should be studied first as optional subject?", "872": "What kind of glasses frame and hairstyle suit a long, oblong male Indian face?", "873": "I have an offer from Polaris and Aricent in Gurgaon. Polaris is paying more than Aricent. Which company should I join?", "874": "What is one of the best conversation starters?", "875": "What is the best time to eat raw garlic?", "876": "What is the latest trend (lingo, fashion, hobbies etc.) among the youth of India?", "877": "Has Ancient Japan been scientifically tested?", "878": "Has Ancient Japan been scientifically tested?", "879": "Has Ancient Japan been scientifically tested?", "880": "What are some good jobs for MBA with BE graduate in India?", "881": "Has Ancient Japan been scientifically tested?", "882": "What have you learnt from your life until now?", "883": "Has Ancient Japan been scientifically tested?", "884": "Which is the best book for competitve exams for chemistry?", "885": "What are the most interesting products and innovations that Charming Shoppes is coming out with in 2016?", "886": "What are some things in which you believe but almost no one else agrees with?", "887": "Which tempered glass should I buy for an OnePlus 3?", "888": "What is the most overrated book ever written?", "889": "Has Ancient Japan been scientifically tested?", "890": "What languages can Prince Philip of the UK speak?", "891": "What hobbies are attractive to women?", "892": "How much Python should I know, before I start contributing to Open Source?", "893": "What are the best mutual funds to invest in india for 5 years?", "894": "What are the hardest karaoke songs to sing?", "895": "Has Ancient Japan been scientifically tested?", "896": "Has Ancient Japan been scientifically tested?", "897": "Which is the best best book of quantitative aptitude?", "898": "Which porn actress is best in bed?", "899": "Which is better for medical entrance coaching Jodhpur or Udaipur?", "900": "Has Ancient Japan been scientifically tested?", "901": "What email service is the best?", "902": "What are the requirements needed to immigrate in to Canada from the United States?", "903": "Has Ancient Japan been scientifically tested?", "904": "Has Ancient Japan been scientifically tested?", "905": "Has Ancient Japan been scientifically tested?", "906": "Has Ancient Japan been scientifically tested?", "907": "How does an MBA degree from INSEAD compare with a degree from a top US school such as Wharton or Stanford GSB?", "908": "What is the best Ola hack for UNLIMITED Ola Money? I know there is a coupon for that.", "909": "Has Ancient Japan been scientifically tested?", "910": "Has Ancient Japan been scientifically tested?", "911": "What is the best option according to you? Would you take the JEE Mains exam online or offline?", "912": "Has Ancient Japan been scientifically tested?", "913": "Who were the first black presidents?", "914": "What's the better investment: ZoomInfo, Hoovers, LeadzGen, InsideView, Jigsaw, DiscoverOrg or CRUSH Reports and why?", "915": "Has Ancient Japan been scientifically tested?", "916": "Which is the overall best coaching institute in Lucknow for the SSC CGL and banking?", "917": "Has Ancient Japan been scientifically tested?", "918": "Has Ancient Japan been scientifically tested?", "919": "Has Ancient Japan been scientifically tested?", "920": "Has Ancient Japan been scientifically tested?", "921": "What is the typical salary offered by different companies in IISc Bangalore?", "922": "Which is the best website to learn object oriented programming in c++?", "923": "What video camera does the YouTuber BluMaan use?", "924": "What is your favourite part of history?", "925": "What's the nicest thing you've seen someone do?", "926": "As a teacher, what was your biggest facepalm moment?", "927": "Has Ancient Japan been scientifically tested?", "928": "What is it like to be Trained at Infosys Mysore Campus?", "929": "What's it like to work at HFF for your first job?", "930": "What is some life advice that never Changes when dealing with people?", "931": "Recommendations for songs that are similar to Young and Beautiful by Lana Del Rey?", "932": "Has Ancient Japan been scientifically tested?", "933": "What are the best heart rate monitors?", "934": "What is the funniest thing ever?", "935": "Has Ancient Japan been scientifically tested?", "936": "What is it like to attend Carleton College?", "937": "What are the free beginner courses I can take online to learn the basics of being a CEO?", "938": "What rank in IES is required to get into ITS?", "939": "Has Ancient Japan been scientifically tested?", "940": "What skills do I need to have to get a job at a financial consultancy firm after my engineering?", "941": "Has Ancient Japan been scientifically tested?", "942": "What smartphones do celebrities use?", "943": "Has Ancient Japan been scientifically tested?", "944": "What is the most daring thing you have done in your life?", "945": "Has Ancient Japan been scientifically tested?", "946": "Has Ancient Japan been scientifically tested?", "947": "Has Ancient Japan been scientifically tested?", "948": "What is the most reputable Android app market in China?", "949": "What are the best spiritual books in the world?", "950": "Which are the top web CMS trends for 2016 and beyond?", "951": "What is the best anime series everyone should watch?", "952": "Has Ancient Japan been scientifically tested?", "953": "Has Ancient Japan been scientifically tested?", "954": "What are some inspirational quotes and stories?", "955": "Has Ancient Japan been scientifically tested?", "956": "Has Ancient Japan been scientifically tested?", "957": "Has Ancient Japan been scientifically tested?", "958": "Has Ancient Japan been scientifically tested?", "959": "What is the scariest or creepiest book you have ever read?", "960": "What is the most expensive meal you have eaten? How good did it taste?", "961": "How much is the average salary after the MAFED program from SDA Bocconi?", "962": "Has Ancient Japan been scientifically tested?", "963": "What are some of the few coaching classes in Bangalore to crack the NID DAT exam for UG?", "964": "Which is a suitable solar panel installation provider near Napa, California CA?", "965": "What is a good one-year anniversary gift for a spouse?", "966": "I am looking for good harem anime with a male lead do you think you could suggest some anime?", "967": "Has Ancient Japan been scientifically tested?", "968": "Which coaching prepares you the best for civil services GS notes/materials?", "969": "What is the best HD led TV under 20000 rupees?", "970": "Which one is better: a PGDM-BKFS at TAPMI or a PGDM at Great Lakes Institute of Management?", "971": "Has Ancient Japan been scientifically tested?", "972": "Has Ancient Japan been scientifically tested?", "973": "Which approach or which device is used for security in Google Cloud Messaging service?", "974": "What kind of works do Intel engineers do?", "975": "Has Ancient Japan been scientifically tested?", "976": "What color shirt goes best with sky blue shorts for someone who has a fair skin tone?", "977": "Has Ancient Japan been scientifically tested?", "978": "Which state is the best among Texas, Florida, and California?", "979": "Which is harder to learn: Polish or Russian?", "980": "How is the hostel life at IISc for undergraduates?", "981": "What is the largest state in India in terms of area and what is its population? How does this compare to the largest state in Germany?", "982": "What are the best small business strategies?", "983": "What order should I read Tolstoy's books?", "984": "Has Ancient Japan been scientifically tested?", "985": "Which is the latest arm processor?", "986": "What's it like to go on a date where you answer most or all of these 36 questions?", "987": "What is the typical career path for someone who becomes a professor in education?", "988": "Assuming a viral-based zombie apocalypse outbreak is reported to be spreading rapidly across the world, what do you do during the first 60 minutes?", "989": "What is the best way to learn animation as a beginner? And what are the recommended books, sites, software that may help?", "990": "Has Ancient Japan been scientifically tested?", "991": "Has Ancient Japan been scientifically tested?", "992": "Which bra to wear over 36dd breast?", "993": "What was your most terrifying experience?", "994": "Has Ancient Japan been scientifically tested?", "995": "Has Ancient Japan been scientifically tested?", "996": "What are good examples of Human-Artificial Intelligence cooperation?", "997": "If you had only one chance for a “do-over” in life, what would you do differently?", "998": "What's it like to work at U.S. Steel for your first job?", "999": "Has Ancient Japan been scientifically tested?"}