{"0": "What is the best way to get certified in Salesforce?", "1": "How can I improve my art? What do you think of my drawing?", "2": "Has Ancient Japan been scientifically tested?", "3": "Has Ancient Japan been scientifically tested?", "4": "Has Ancient Japan been scientifically tested?", "5": "I currently own a Twitter account with over 30k active followers, how do I make money from it?", "6": "How do I delete items on Kindle?", "7": "What is the best way to monetize my 9apps.com mobile app?", "8": "How do I invite a prospect in network marketing?", "9": "How can I reset the \"service engine soon\" light in a Nissan?", "10": "How can I save Google images on my android phone to view it later when I am offline?", "11": "Has Ancient Japan been scientifically tested?", "12": "I love someone who is older than me nearly 25 years. How can I forget gim forever?", "13": "Has Ancient Japan been scientifically tested?", "14": "What should I do if someone has created a fake Facebook account?", "15": "How can I join the Indian Army at the age of 26?", "16": "Has Ancient Japan been scientifically tested?", "17": "How can I become a cardiac surgeon?", "18": "How can you determine the chemical formula for iodine propanone?", "19": "Has Ancient Japan been scientifically tested?", "20": "How can you hack a cell phone?", "21": "How can I get to work and live in Jamaica as an office employee, being German?", "22": "I want to build a website much better than Facebook.Front end I will use html and css.What should I use server side?", "23": "I'm a 17-year-old boy. I'm straight and have a hard time making it serious with girls. How do I change this without being mean/cocky?", "24": "What can happen if my dog ate chocolate cake? How dangerous can it be?", "25": "Has Ancient Japan been scientifically tested?", "26": "Has Ancient Japan been scientifically tested?", "27": "Has Ancient Japan been scientifically tested?", "28": "Has Ancient Japan been scientifically tested?", "29": "Has Ancient Japan been scientifically tested?", "30": "What is the best recipe for making Buffalo Wild Wings' macaroni and cheese?", "31": "Has Ancient Japan been scientifically tested?", "32": "Has Ancient Japan been scientifically tested?", "33": "Has Ancient Japan been scientifically tested?", "34": "How can I overcome social anxiety?", "35": "How can I learn coding within three days?", "36": "Has Ancient Japan been scientifically tested?", "37": "Has Ancient Japan been scientifically tested?", "38": "Has Ancient Japan been scientifically tested?", "39": "How do I get a job in cloud computing as a fresher with no experience?", "40": "How do I add a code in Stack Overflow?", "41": "Has Ancient Japan been scientifically tested?", "42": "How do I reset Vizio TV? What is the easiest way to fix it?", "43": "How can we grab all the YouTube videos title from a selected YouTube channel?", "44": "What should you do if you add too much garlic to a recipe?", "45": "Has Ancient Japan been scientifically tested?", "46": "Has Ancient Japan been scientifically tested?", "47": "How do I convert a numerical value in Indian rupees into words in an Excel sheet?", "48": "How do I get rid of a bad roommate?", "49": "How do I get rid of a double chin?", "50": "How can electrical engineer get an an oil rig job?", "51": "Has Ancient Japan been scientifically tested?", "52": "Why am I a failure?", "53": "Why can't I modify my answer on Quora anymore?", "54": "How should I make myself more comfortable while I'm talking to girls?", "55": "How can I improve myself in studies?", "56": "What is some advice for an incoming high school freshman?", "57": "Has Ancient Japan been scientifically tested?", "58": "How can I improve my aim (rifle shooting)?", "59": "Has Ancient Japan been scientifically tested?", "60": "How do I recover deleted messages in whatsapp if i didn't backup the messages?", "61": "How can I satisfy a man sexually?", "62": "How to use  random forests for anomaly detection with any known Data mining package?", "63": "Has Ancient Japan been scientifically tested?", "64": "How can I raise money for charity through running?", "65": "I have developed a prediction tool for Alzheimer's as my PhD thesis. What are my options to make it available to general public?", "66": "How do I choose the right lamp dimmer?", "67": "How can reading novels help me improve my English?", "68": "Has Ancient Japan been scientifically tested?", "69": "My female 'sc'. Friend is marrying a Hindu baniya man. Boys parents are unaware of this. What should they do?", "70": "What are 5 ways to instantly make yourself feel more confident?", "71": "Has Ancient Japan been scientifically tested?", "72": "How do I clean air conditioner coils?", "73": "Has Ancient Japan been scientifically tested?", "74": "Has Ancient Japan been scientifically tested?", "75": "Has Ancient Japan been scientifically tested?", "76": "Are there any natural method to make water sticky or hard?", "77": "Has Ancient Japan been scientifically tested?", "78": "Has Ancient Japan been scientifically tested?", "79": "Has Ancient Japan been scientifically tested?", "80": "Has Ancient Japan been scientifically tested?", "81": "Has Ancient Japan been scientifically tested?", "82": "Has Ancient Japan been scientifically tested?", "83": "How do I fight corruption in Bulgaria?", "84": "How do I check my Quora credit?", "85": "What is netwaiting.exe? Should I keep it in my computer?", "86": "Has Ancient Japan been scientifically tested?", "87": "How do I identify DDR1, DDR2,DDR3 RAM for pc?", "88": "Has Ancient Japan been scientifically tested?", "89": "Has Ancient Japan been scientifically tested?", "90": "How do you check Dish's TV account?", "91": "How can I be productive in sales?", "92": "What are some simple ways to save money?", "93": "How do I set a featured video for my Facebook Page?", "94": "WhatsApp: How can I restore deleted messages from WhatsApp?", "95": "How do I say meet in different languages?", "96": "How can I register for net banking SBI without visiting to branch?", "97": "What are some tips on making it through the job interview process at South Jersey?", "98": "Has Ancient Japan been scientifically tested?", "99": "How can you track the data of a science fair project?", "100": "Has Ancient Japan been scientifically tested?", "101": "How do I register in the alternatives of Kickass torrents like kickasstorrentsas and others?", "102": "How do I lose my fear of fighting?", "103": "Where can I get most affordable emergency plumbing service in Randwick?", "104": "How do I treat a friend that takes me for granted?", "105": "How do I write blog posts fast?", "106": "How do I learn self-learning?", "107": "I live in rohini and I want to spend some time with orphan. Whom should I contact?", "108": "Has Ancient Japan been scientifically tested?", "109": "Has Ancient Japan been scientifically tested?", "110": "Has Ancient Japan been scientifically tested?", "111": "Has Ancient Japan been scientifically tested?", "112": "Has Ancient Japan been scientifically tested?", "113": "How should I live my life?", "114": "What happens after you send your SAT scores to universities?", "115": "Where can I buy belly dance belts in Mumbai?", "116": "How can we prevent mass shooting?", "117": "How do I set up the program of Budzar program?", "118": "How to activate windows 10?", "119": "How can I ask good questions?", "120": "Has Ancient Japan been scientifically tested?", "121": "Has Ancient Japan been scientifically tested?", "122": "How do I get rid of open pores on my nose?", "123": "What’s the best way to learn how to DJ?", "124": "How could you tell if someone is bisexual?", "125": "What should I do to make a girl who I have not seen for 3 years love me? She did not love me  3 years ago. Now I will see her again. How can I encourage her to love me?", "126": "Has Ancient Japan been scientifically tested?", "127": "Has Ancient Japan been scientifically tested?", "128": "Has Ancient Japan been scientifically tested?", "129": "Can somebody explain to me how to do this problem with steps?", "130": "What are some tips for building a house in the woods?", "131": "Has Ancient Japan been scientifically tested?", "132": "How do I tackle this?", "133": "How do I avoid plagiarism of my article before it is published?", "134": "Has Ancient Japan been scientifically tested?", "135": "Has Ancient Japan been scientifically tested?", "136": "Has Ancient Japan been scientifically tested?", "137": "How do I get the hairstyle of the guys in this picture?", "138": "What should I do if the books don't get downloaded even after the purchase of the book in kindle?", "139": "How do you deal with bullies as an adult?", "140": "How can I fix and iPod 5 that doesn't turn on?", "141": "How do you live a green life?", "142": "How do you recover deleted texts on an Android phone?", "143": "How do i solve Windows 10 stuck at the spinning dots screen before login?", "144": "Has Ancient Japan been scientifically tested?", "145": "Has Ancient Japan been scientifically tested?", "146": "How can you get pregnant during miscarriage?", "147": "Has Ancient Japan been scientifically tested?", "148": "Where do I find CA final law amendments for Nov 2016?", "149": "I can’t add annotation or do any enhancement on my YouTube video. How do I resolve flash player plugin issue on my YouTube video?", "150": "How do I solve this JEE Advanced question?", "151": "How can Netflix charge me with just my debit card number , date and CVV? without the pin number/OTP/Verification num.", "152": "Has Ancient Japan been scientifically tested?", "153": "How do I cure acne marks and scars?", "154": "How can I make sure, if something ever has to happen to me, my parents are taken care of?", "155": "I hate the strict way of writing the Russian alphabet. Are there any optional ways to make the alphabet more casual and friendly?", "156": "What if I know nothing about myself?", "157": "How do I really know what I want?", "158": "Has Ancient Japan been scientifically tested?", "159": "How do I balance a hard university course with personal life?", "160": "How can I view someone's Facebook if they have blocked you?", "161": "Has Ancient Japan been scientifically tested?", "162": "Can you offer me any advice on how to lose weight?", "163": "Has Ancient Japan been scientifically tested?", "164": "My secondary education is not equivalent to 12 years. What can I do to complete this so that I can apply to US universities as soon as possible?", "165": "Has Ancient Japan been scientifically tested?", "166": "What is a good, free alternative to Adobe Acrobat in Windows for creating an editable PDF?", "167": "How do you improve your shot in basketball?", "168": "What is simple way to learn english?", "169": "Has Ancient Japan been scientifically tested?", "170": "How do I deal with abusive teachers?", "171": "Has Ancient Japan been scientifically tested?", "172": "Has Ancient Japan been scientifically tested?", "173": "How does meditation help a college student?", "174": "What should I do for the rest of my life?", "175": "How do I sustain motivation?", "176": "Has Ancient Japan been scientifically tested?", "177": "Has Ancient Japan been scientifically tested?", "178": "Has Ancient Japan been scientifically tested?", "179": "How can I pass a UA for meth if I ate some 2 days ago?", "180": "Has Ancient Japan been scientifically tested?", "181": "What is the best way to fix a hole in a pair of jeans ?", "182": "Has Ancient Japan been scientifically tested?", "183": "Has Ancient Japan been scientifically tested?", "184": "How can I use a satellite TV dish for internet?", "185": "I want to become pilot, what should I do for that?", "186": "How do you increase your earning sources?", "187": "Where can I find a mentor for setting up an ecommerce shop?", "188": "Has Ancient Japan been scientifically tested?", "189": "Why does my stomach always hurt after I eat porridge? How can I stop it?", "190": "I have to implement BPT framework for automation. How do I start learning for the same?", "191": "Has Ancient Japan been scientifically tested?", "192": "Has Ancient Japan been scientifically tested?", "193": "Has Ancient Japan been scientifically tested?", "194": "Has Ancient Japan been scientifically tested?", "195": "What can I do after completing BSc IT?", "196": "Has Ancient Japan been scientifically tested?", "197": "Has Ancient Japan been scientifically tested?", "198": "Where can I get safely asbestos removing services in Sydney?", "199": "What is the best way to change your life?", "200": "How does one become a celebrity assistant?", "201": "Has Ancient Japan been scientifically tested?", "202": "Where can I buy cheap clothes in the style of this rather expensive web shop called Unif?", "203": "Has Ancient Japan been scientifically tested?", "204": "Has Ancient Japan been scientifically tested?", "205": "Has Ancient Japan been scientifically tested?", "206": "How do I eat junk food and remain skinny?", "207": "Has Ancient Japan been scientifically tested?", "208": "Has Ancient Japan been scientifically tested?", "209": "Has Ancient Japan been scientifically tested?", "210": "I want to be a male escort. I live in Chennai. Can I have pointers?", "211": "What should we do to face campus interviews?", "212": "Has Ancient Japan been scientifically tested?", "213": "Why don't people message me back on OkCupid?", "214": "How can I get a cast?", "215": "Has Ancient Japan been scientifically tested?", "216": "How can you use an iTunes gift card?", "217": "How do bad marks in CSE affect job interviews?", "218": "Has Ancient Japan been scientifically tested?", "219": "Has Ancient Japan been scientifically tested?", "220": "Has Ancient Japan been scientifically tested?", "221": "Has Ancient Japan been scientifically tested?", "222": "How do you cope with yourself when your career seems stuck at the bottom for a long time, when everyone else you know has been successful?", "223": "Has Ancient Japan been scientifically tested?", "224": "Has Ancient Japan been scientifically tested?", "225": "How can I start making money with my gaming laptop?", "226": "How can I get really good at deducing things like Sherlock Holmes?", "227": "Has Ancient Japan been scientifically tested?", "228": "How can you fix an overbite without braces?", "229": "How can I learn autocad from home?", "230": "How can I see the number used to contact me on messenger?", "231": "Has Ancient Japan been scientifically tested?", "232": "What can I learn on my own?", "233": "Has Ancient Japan been scientifically tested?", "234": "Has Ancient Japan been scientifically tested?", "235": "What happens when I message someone who is not on my contact list on facebook?", "236": "How can I Transfer Music from iPhone to Mac without iTunes?", "237": "Has Ancient Japan been scientifically tested?", "238": "How can you read quickly but deeply?", "239": "Has Ancient Japan been scientifically tested?", "240": "What are are some ways to lose 25 pounds in 1 month?", "241": "How can I grow full and thick beard?", "242": "How can I recover deleted iPhone text messages, remotely, without requiring the phone or Apple ID or password?", "243": "Has Ancient Japan been scientifically tested?", "244": "Has Ancient Japan been scientifically tested?", "245": "Has Ancient Japan been scientifically tested?", "246": "How can you determine electronic charges?", "247": "Has Ancient Japan been scientifically tested?", "248": "How do I make a vr game?", "249": "How does a retailer decide what to sell when arriving to a new market?", "250": "I am unable to format the SD card. Even if I am able to continue through the process by chance, the data gets restored again. What is some help?", "251": "I’ve started a game development project and still in the early days. How could I fund my software licensing along the way?", "252": "What's the best way to enter the data science/analytics career field?", "253": "Has Ancient Japan been scientifically tested?", "254": "How much physical activity should I do daily in order to live a healthy life?", "255": "How do I improve my communications and writing skills?", "256": "I'm a software developer. How do I freelance on projects on the side? Are there ways to find clients other than odesk and elance?", "257": "How effective is starvation for losing weight?", "258": "Has Ancient Japan been scientifically tested?", "259": "Has Ancient Japan been scientifically tested?", "260": "Has Ancient Japan been scientifically tested?", "261": "As a Catholic, how would you persuade an atheist to convert to Catholicism?", "262": "How can I get abs without going to the gym?", "263": "How can I become a writer?", "264": "Has Ancient Japan been scientifically tested?", "265": "Has Ancient Japan been scientifically tested?", "266": "How do I impress my wife?", "267": "How do I come to terms with the painful regret of the past as a result of my mental health?", "268": "Where can I buy a rain oil lamp?", "269": "Has Ancient Japan been scientifically tested?", "270": "Has Ancient Japan been scientifically tested?", "271": "What do you do to get out of depression rather than dwell in it?", "272": "Has Ancient Japan been scientifically tested?", "273": "Has Ancient Japan been scientifically tested?", "274": "How do I become a science writer?", "275": "How do you concentrate?", "276": "What if I would not be able to become a good architect?", "277": "How can one earn money through internet?", "278": "How do I find a saved wifi password in my phone?", "279": "Has Ancient Japan been scientifically tested?", "280": "Where can I get best photo booth packages in Sydney?", "281": "What is the best way to learn chess?", "282": "How do I get a large number of upvotes?", "283": "How do I lose weight only through a vegan diet?", "284": "What are some recipes for a Japanese-style fried rice?", "285": "What is the best way to kill or remove house flies?", "286": "Has Ancient Japan been scientifically tested?", "287": "What can I gift my boyfriend on his birthday?", "288": "Has Ancient Japan been scientifically tested?", "289": "I seek reassurance with any bfs I've had. I question their interest in me regularly. Why do I do this?", "290": "How can I downgrade from Windows 10 to Windows 7?", "291": "What's the best thing to do when in San Francisco?", "292": "What is the best way to write a formal email to HR?", "293": "How do I become successful in my life?", "294": "Has Ancient Japan been scientifically tested?", "295": "How can I start developing opinions about things. I read a lot, but I don't remember the stuff I read. I feel overwhelmed by all the topics in the world. How can I change, one day at a time?", "296": "Where can I use the word being… what does actually mean it?", "297": "How can I get a Chase Freedom cash advance?", "298": "How do AliExpress/Wish & Co. manage to sell at such a low price including the free shipping?", "299": "Has Ancient Japan been scientifically tested?", "300": "What combination of diet and exercise tips can result in losing belly fat and building six pack abs?", "301": "How do I mount an USB drive to a Lenovo A3000-H tablet?", "302": "How can we see travelling wave in silicon wave guide 3D COMSOL Multiphysic?", "303": "How can you convert YouTube videos to MP3 on an iPhone?", "304": "What can be done to salvage Nutella spread if it becomes stiff and unspreadable?", "305": "What are the requirements to setup a rural BPO franchise?", "306": "How can I attack effectively with hogs in Clash of Clans?", "307": "How do I lose 15 kg weight in 3 months? suggest exercise and diet plan.", "308": "What work do technical assistants do in ISRO?", "309": "How can I copy music videos from my laptop onto my iPhone?", "310": "How can I identify the websites that need blogs but don't have any?", "311": "Has Ancient Japan been scientifically tested?", "312": "Why is it so hard to get a girlfriend?", "313": "What exactly does 'doing something with your life' mean, and how can I know if I have accomplished it?", "314": "How do I change the new Google Chrome look?", "315": "Has Ancient Japan been scientifically tested?", "316": "How can one deal with toxic family members?", "317": "How do I detect virus and malwares in iPhone 6?", "318": "How should I start preparing for CLAT 2017?", "319": "Can anyone help me with income tax query?", "320": "Where can I find books on female psychology?", "321": "How can you scan a QR code through a web interface (not an app) on a mobile phone using the phone's camera?", "322": "What would you do if your friends are constantly talking about your friend's boyfriend and even if they consider you still a part of the group, they do however kinda make you feel alone? How do you go make yourself comfortable and really enjoy and have a good time?", "323": "Has Ancient Japan been scientifically tested?", "324": "Has Ancient Japan been scientifically tested?", "325": "Has Ancient Japan been scientifically tested?", "326": "Can anyone provide me information about SAP?", "327": "What do you do if you had a bad dream?", "328": "Has Ancient Japan been scientifically tested?", "329": "Has Ancient Japan been scientifically tested?", "330": "Has Ancient Japan been scientifically tested?", "331": "My fiance' comes from a royal family. He's  6 years younger than me. We love each other so much, and we have been in a relationship for 3 years now. We want to get married, but his father doesn't approve of our relationship. What can we do to get his father to accept me?", "332": "I have been talking to some girl for 2 weeks and we were hitting it off but then I sent her a picture I thought was funny but was actually weird/messed up and I didn't get a reply, how do I fix this and get to start talking to me again?", "333": "How do I stop male hair loss?", "334": "Has Ancient Japan been scientifically tested?", "335": "Has Ancient Japan been scientifically tested?", "336": "How can I calculate my attendance in percent?", "337": "Online Media: What are some possible exits for PandoDaily and why would the acquirer purchase them?", "338": "How do you blow-dry your curly hair straight?", "339": "How can I fix an invalid URL on Facebook?", "340": "Has Ancient Japan been scientifically tested?", "341": "I am a solid dribbler, but my control is sometimes off how can I get \"ball on a string\" handles?", "342": "What is the easiest way to buy Bitcoin?", "343": "Has Ancient Japan been scientifically tested?", "344": "Has Ancient Japan been scientifically tested?", "345": "Has Ancient Japan been scientifically tested?", "346": "Has Ancient Japan been scientifically tested?", "347": "Has Ancient Japan been scientifically tested?", "348": "How do half adders work?", "349": "How do you reset a Honeywell thermostat?", "350": "Has Ancient Japan been scientifically tested?", "351": "How do I stop smell petrolling?", "352": "How do I check purity of honey?", "353": "How do I hide a div tag element on the mobile view of a site?", "354": "How can I get a six pack abs?", "355": "How do I start programming a game?", "356": "What is the best way to wash lace panties?", "357": "How can I forward multiple Google voice numbers to a single phone number?", "358": "Has Ancient Japan been scientifically tested?", "359": "My Portuguese parent wants me (British, born and raised) to get a dual nationality with Portugal. What are the pros and cons to this?", "360": "How do I delete my question from Quora?", "361": "Has Ancient Japan been scientifically tested?", "362": "How can I transfer money from an ICICI ATM TO SBI account?", "363": "Has Ancient Japan been scientifically tested?", "364": "Has Ancient Japan been scientifically tested?", "365": "When should I appear for TOEFL?", "366": "I've finished the development of a system, that resulted from my PhD work. How do I address a VC if I have no networking in that area?", "367": "I'm 20 years now and I'm very thin. How do I become fat? I eat lots of food, but there is no improvement yet. Should I start using proteins? What is a good diet that can make me fat?", "368": "How do get a crew accommodation for lavish off-duty hours?", "369": "Has Ancient Japan been scientifically tested?", "370": "How can I prepare for AIPMT without any coaching classes?", "371": "Has Ancient Japan been scientifically tested?", "372": "Has Ancient Japan been scientifically tested?", "373": "How do I find out if someone got arrested?", "374": "Buying a Home: How should I approach my landlord regarding making an offer to buy the house I rent?", "375": "Why can't I relax during a massage?", "376": "What are the steps of Launching an app?", "377": "Has Ancient Japan been scientifically tested?", "378": "Has Ancient Japan been scientifically tested?", "379": "How do guys know if a girl is horny?", "380": "Has Ancient Japan been scientifically tested?", "381": "How can I improve my chances of the VA increasing my hearing impaired disability?", "382": "Has Ancient Japan been scientifically tested?", "383": "Has Ancient Japan been scientifically tested?", "384": "Has Ancient Japan been scientifically tested?", "385": "Has Ancient Japan been scientifically tested?", "386": "How do I deal with the regret of missed opportunity?", "387": "Has Ancient Japan been scientifically tested?", "388": "How do I get a job in CBI?", "389": "How can I have an attractive personality?", "390": "I've got wounds in my tongue and some under my lips. What should I do?", "391": "Where I have to submit pan documents after filling online?", "392": "How can I change my study habits fast?", "393": "How do I download contacts from iCloud to iPhone?", "394": "How can someone earn money by uploading videos on youtube?", "395": "How do I gain confidence in life?", "396": "Where can I get good scripts for short films?", "397": "How does improving selective attention affect grades at school and university?", "398": "Life after death? I need to prove it ! Any expert suggestions how to start with", "399": "Has Ancient Japan been scientifically tested?", "400": "I am getting a job offer as a Java trainer in a training institue now. If I work as a trainer for at least one year, would I able to enter into IT companies as I am an engineering graduate after one year? What post will I get then, and how would I need to apply?", "401": "How does this prove that I am not a robot?", "402": "Has Ancient Japan been scientifically tested?", "403": "How do you train an American Bulldog/Black Lab mix?", "404": "Has Ancient Japan been scientifically tested?", "405": "Has Ancient Japan been scientifically tested?", "406": "Has Ancient Japan been scientifically tested?", "407": "I got jio sim on 25th aug it is 4rth sep but still sim is not activated what I should do?", "408": "How can I avoid getting tiny black flies inside my house?", "409": "Has Ancient Japan been scientifically tested?", "410": "Has Ancient Japan been scientifically tested?", "411": "How do you make a billion dollars?", "412": "Has Ancient Japan been scientifically tested?", "413": "How can I forget someone whom I loved so deeply?", "414": "How can we make money out of blogs?", "415": "In my Samsung mobile , Samsung keyboard is not working .  if i am trying to use it , It gets  stuck &  restarts the mobile . Is there any solution to fix???", "416": "What is the best advice to become a millionaire while in my 20's?", "417": "Has Ancient Japan been scientifically tested?", "418": "How do I prepare for the GD and PI rounds for admission at an ACM course at NICMAR Pune?", "419": "I forgot my Samsung account password. How do I remove my Samsung account?", "420": "How can one become a good lawyer?", "421": "In DEAL - Director's Profile, there is no mail id given, how can I apply then? Plz suggest me and do explain the procedure.", "422": "Has Ancient Japan been scientifically tested?", "423": "How can I effortlessly look beautiful?", "424": "Has Ancient Japan been scientifically tested?", "425": "What are the different ways to save tax on a salary of 6 Lakhs/year? Is there any tax rebate on payment of education loan?", "426": "How can I talk to my child about death?", "427": "Has Ancient Japan been scientifically tested?", "428": "How can I achieve unstoppable success in Life?", "429": "Has Ancient Japan been scientifically tested?", "430": "What is the process of buying a business in UK?", "431": "Has Ancient Japan been scientifically tested?", "432": "I have a bachelors in engineering and am a chartered engineer. How much can I expect to be payed?", "433": "I think I love my classmate but having a romantic relationship with a schoolmate tops both of our lists of don'ts. (We won't change our school as it is the best one in town.) What should I do?", "434": "How can I learn Big Data on my own so that I can apply for a job in that area?", "435": "Has Ancient Japan been scientifically tested?", "436": "How do I improve sexual stamina?", "437": "What's the fastest way to build Instagram followers?", "438": "Has Ancient Japan been scientifically tested?", "439": "How do I crack UPSC dental examination?", "440": "I am on H1-B VISA in USA, What additional thing I can do in USA which can boost my career?", "441": "Where can I sell my raw amber?", "442": "What's the best way to gain a following for a B2B brand on Facebook?", "443": "Has Ancient Japan been scientifically tested?", "444": "Has Ancient Japan been scientifically tested?", "445": "Has Ancient Japan been scientifically tested?", "446": "How do I unlock my laptop keyboard?", "447": "Why am I vomiting every time after I eat?", "448": "Where can a complaint be lodged against e-tailers?", "449": "How do I get in a blood gang?", "450": "How do I learn Quantum Field Theory as a beginner?", "451": "How do I prepare for the GATE ECE exam in 4 months?", "452": "How can you lose 5 pounds in 2 weeks safely?", "453": "HW CAN I TEACH marketing MANAGEMENT in foreign University?", "454": "How do I apply for a gas connection in Bangalore?", "455": "How do you remove white-out from clothing?", "456": "Has Ancient Japan been scientifically tested?", "457": "Has Ancient Japan been scientifically tested?", "458": "Has Ancient Japan been scientifically tested?", "459": "How can we find professors, PhD & masters students from universities from Finland who would like to share their knowledge for free to record MOOCs?", "460": "I dropped my Lumia phone and while it worked after that, my WhatsApp doesn't open, claiming that the version has expired but it hasn't. What do I do?", "461": "How do i (a Java developer) get an Adobe Experience Manager (AEM) instance for learning the CMS? I'm not Adobe Parner.", "462": "How does one cheat girls?", "463": "How can I learn stage designing?", "464": "How can I prove this inequality equation?", "465": "How can I create a login page using AWS?", "466": "Has Ancient Japan been scientifically tested?", "467": "How do I get a job in the crime branch, Bangalore?", "468": "How can I read The Hindu newspaper via RSS reader?", "469": "Why do I get angered and upset so easily?", "470": "How do Lambda expressions work?", "471": "How can someone subscribe to Facebook topics on Quora?", "472": "How do I properly pronounce eo, eu, and ae in Korean?", "473": "Why am I so nervous about getting married next week when I love her so much and she loves me?", "474": "How do I import artifacts?", "475": "What is the fastest way to get a SIM card?", "476": "Has Ancient Japan been scientifically tested?", "477": "How can one merge 2 cells in Excel, A1 and A2, and then B1 and B2, C1 and C2, A3 and A4, B3 and B4, etc. without individually merging each set of cells or Copying and Pasting? *No content in the cells yet.", "478": "How can I learn communication skills?", "479": "How do we prepare for UPSC?", "480": "How do you upgrade from Windows 7 to Windows 10?", "481": "How do I prepare for SSC Junior engineer (mechanical)?", "482": "Has Ancient Japan been scientifically tested?", "483": "Can anybody let me know how to start the sentences with \"I love it when\"?", "484": "I have edited my host file of my Android to block some websites but still I can open them. What I had missed?", "485": "How can I speak American accent fluently?", "486": "Has Ancient Japan been scientifically tested?", "487": "What is the best way to learn Java on Treehouse?", "488": "What is the optimal way to think about poker?", "489": "How do I write a story for movie?", "490": "What's the best way to stop procrastinating?", "491": "What should I do if I got rejected by every college I applied to?", "492": "How could I get a non-immigrant visa for 1 year for Thailand from India with multiple entries?", "493": "Career advice for an email server administrator?", "494": "How do you calculate your net worth?", "495": "How do I jailbreak a superslim PS3?", "496": "How do you verify your Apple ID through your email?", "497": "Has Ancient Japan been scientifically tested?", "498": "Has Ancient Japan been scientifically tested?", "499": "Has Ancient Japan been scientifically tested?", "500": "Has Ancient Japan been scientifically tested?", "501": "Has Ancient Japan been scientifically tested?", "502": "Has Ancient Japan been scientifically tested?", "503": "How can I get better at writing book reviews ? whats the best way to write", "504": "How can I grow my hair longer fast?", "505": "How can I find clients for my business or businesses?", "506": "How can I make money on musical.ly?", "507": "How do I open an english school in China?", "508": "Has Ancient Japan been scientifically tested?", "509": "How do you do an assisted chin-up?", "510": "What are some ways to get better at maths?", "511": "How do I must react to math errors?", "512": "Has Ancient Japan been scientifically tested?", "513": "What would you do if you're married but in love with someone else?", "514": "Has Ancient Japan been scientifically tested?", "515": "Is there a way to change your Aadhar card name in 1-2 days?", "516": "What's the safest way to transport a desktop computer while flying?", "517": "Has Ancient Japan been scientifically tested?", "518": "How can we improve education in Thailand?", "519": "How do you repair a cracked iPad screen?", "520": "I'm a 3rd year guy in NITK and in circuit dept, my CGPA at the end of 4th sem is 5.4.. How can I increase my pointers? . Can I sit for Placements with the present pointer? . What can I do further?", "521": "How do I prepare for Oracle Certified Master, Java EE Enterprise Architect?", "522": "How do I say hi to my crush?", "523": "How do you use The Winged Dragon Of Ra?", "524": "How does ngrok work?", "525": "What's the best way to get to Machu Picchu from Lima?", "526": "Has Ancient Japan been scientifically tested?", "527": "How do you keep yourself motivated everyday?", "528": "Has Ancient Japan been scientifically tested?", "529": "Has Ancient Japan been scientifically tested?", "530": "I'm a latina 23 years old woman (Pear body) ... I've been gaining weight the last months and I want to start losing it, to feel confident and also for my health (I have diabetic people in my family), is there any diet and exercises that I could try?", "531": "How do I believe in myself?", "532": "How can I connect my ipad 2 to my car stereo?", "533": "How should I prepare UGC NET history?", "534": "Has Ancient Japan been scientifically tested?", "535": "How can I get my virginity back?", "536": "Has Ancient Japan been scientifically tested?", "537": "How do you launch a social network?", "538": "What is the easiest way to learn JavaScript?", "539": "I don't understand basic electronic tell me solution anyone?", "540": "My Acer laptop freezes frequently?", "541": "Has Ancient Japan been scientifically tested?", "542": "How does Uber work?", "543": "How do I start your own country?", "544": "Has Ancient Japan been scientifically tested?", "545": "How do I prevent instagram from being hack?", "546": "How do I keep conversation interesting?", "547": "How can you value ideas?", "548": "Has Ancient Japan been scientifically tested?", "549": "How do ad network send traffic?", "550": "Has Ancient Japan been scientifically tested?", "551": "Would you like to know how to make unlimited income at home?", "552": "How do you tell someone that thinks you like them, that you don't actually like them?", "553": "Has Ancient Japan been scientifically tested?", "554": "What is the easiest way to balance chemical equations?", "555": "How do I get Amazon Echo to work in India?", "556": "I have to use insulin but can't afford it, is there some way to get it free?", "557": "How to score 150 in JEE mains (2016) in 3 months?", "558": "Has Ancient Japan been scientifically tested?", "559": "How do I participate in The Kapil Sharma Show as audience member?", "560": "How do I share PDFs from iBooks to Android?", "561": "How do I get free uber rides in india?", "562": "Has Ancient Japan been scientifically tested?", "563": "How do I become a better doctor?", "564": "Has Ancient Japan been scientifically tested?", "565": "Has Ancient Japan been scientifically tested?", "566": "How do I get rid of a stubborn case of head lice?", "567": "Has Ancient Japan been scientifically tested?", "568": "Has Ancient Japan been scientifically tested?", "569": "What are good ways to find nth prime number in the fastest way?", "570": "How can I be sexy?", "571": "How do I cure erectile?", "572": "How can I learn new things everyday?", "573": "How can I change my voice to americanamericaAmerican?", "574": "How can I express myself?", "575": "Outdoor Activities: Where can I find a mechanical bull in the bay area?", "576": "How would I as an INTP male find and INFJ female for friendship and/or a romantic relationship?", "577": "What should I learn after HTML, CSS, JavaScript?", "578": "Can any one explain how kickstarer works? What is the process? And how much does it cost?", "579": "How can I get an engineering job without a degree? The furthest math I've done is Calculus 1.", "580": "Has Ancient Japan been scientifically tested?", "581": "What are good ways to guarantee test case coverage?", "582": "My mom want to divorce my dad. How do I cope with my family problems? I don't know what should I do.?", "583": "Has Ancient Japan been scientifically tested?", "584": "How do I satisfy the girl during sex?", "585": "How do I prepare for an art quiz?", "586": "Has Ancient Japan been scientifically tested?", "587": "What should you do if your brakes stop working?", "588": "What are some tips for being a college freshman?", "589": "Has Ancient Japan been scientifically tested?", "590": "How much does Adobe Photoshop cost? Where can I get it?", "591": "How do I improve writing skill by myself?", "592": "How can I transfer files between a computer and a Android phone by Wifi?", "593": "Has Ancient Japan been scientifically tested?", "594": "How do I apply for a Marketing/Sales job in Ubisoft, Pune?", "595": "When I use 3G on my mobile phone, how can I see what IP address has been assigned to my mobile phone?", "596": "How can I upgrade my Grand Neo to Android 4.4.2?", "597": "Has Ancient Japan been scientifically tested?", "598": "How can I find out what I really want to do with my life?", "599": "How do I use Quora in the best possible way so as to gain/share knowledge to the maximum?", "600": "How do I hack my cheating partner's phone?", "601": "Has Ancient Japan been scientifically tested?", "602": "Has Ancient Japan been scientifically tested?", "603": "Has Ancient Japan been scientifically tested?", "604": "What will smoking weed do to a baby?", "605": "Has Ancient Japan been scientifically tested?", "606": "How do I lose belly fat and gain muscle at the same time?", "607": "What would be a cool way to commit suicide?", "608": "How can I get my family out of South Africa?", "609": "Super Smash Bros. Brawl: What is the best strategy against Pit?", "610": "Has Ancient Japan been scientifically tested?", "611": "How do I download the Mengto's Design-Code book?", "612": "Where in Pune I can get butter chicken khichadi?", "613": "How can I fix my MacBook Pro when it is not turning on?", "614": "Has Ancient Japan been scientifically tested?", "615": "How can I make 1000 dollars monthly at least with no skills or investments?", "616": "Has Ancient Japan been scientifically tested?", "617": "How does one stop hosting a channel on Twitch on an iPad?", "618": "What are the job opportunities in digital marketing?", "619": "How can I become a travel agent and what are the perks?", "620": "Has Ancient Japan been scientifically tested?", "621": "How does a device connect to a wireless network?", "622": "How can I be a good product designer?", "623": "Has Ancient Japan been scientifically tested?", "624": "How do I break free of a pornographic addiction?", "625": "How do I find my first job?", "626": "How do you deposit a check at a Wells Fargo ATM?", "627": "How can I stop being a third wheel?", "628": "How many kgs can I lose in a month if I skip rope daily for 45 mins?", "629": "Has Ancient Japan been scientifically tested?", "630": "How can I get into a good MBA program right out of my undergraduate?", "631": "Where can I buy freshly prepared paneer (cottage cheese) in Bangalore (preferably near Marathahalli)? I know the packaged ones are available but they are not so good in taste.", "632": "How long should I run?", "633": "My Moto G2 mobile were stuck in startup logo I done to all but it can't what should I do?", "634": "How can one \"let loose\"?", "635": "How should one start learning Algorithms?", "636": "Has Ancient Japan been scientifically tested?", "637": "Why does my Harmon Kardon Onyx Studio 2 Bluetooth speaker only work when plugged in and only plays for a minute then shuts off?", "638": "How do I become unproductive?", "639": "Where should I promote my blog?", "640": "Has Ancient Japan been scientifically tested?", "641": "Has Ancient Japan been scientifically tested?", "642": "Virtualization: How do I configure the VirtualBox so that the OS in it can communicate with the host OS?", "643": "How do you use camouflage effectively? Do camouflaged clothes actually work?", "644": "When should you ask a girl out?", "645": "What should I do if my Moto G 2 outer glass is broken but my display and touch are working fine?", "646": "Where do I write about the topics that I love?", "647": "What are the best strategies for preparing for the LSAT?", "648": "How do I earn money by paying electricity bill?", "649": "I have a very healthy diet and always work out. How can I get rid of belly fat, quickly?", "650": "What are some tips on making it through the job interview process at Abaxis?", "651": "How can I apply for civil engineering jobs?", "652": "Has Ancient Japan been scientifically tested?", "653": "I have a time machine and I want to prevent Rome from falling. I can bring only one object with me from the future. What do I do?", "654": "How do I register my company name for voice search?", "655": "How do I get more Pokémon in Pokémon Go?", "656": "How do I learn bioinformatics?", "657": "Has Ancient Japan been scientifically tested?", "658": "Where can I find more information about the spacing between magnetic field lines?", "659": "How do I survive shooting massacre or terrorist attack in a city?", "660": "How do I write code for this?", "661": "Has Ancient Japan been scientifically tested?", "662": "How do I get my 13-year-old daughter interested in programming?", "663": "I am currently working as a government auditor. Will I be able to get a short term foreign audit assignment? If yes, how can I get that?", "664": "How can I earn more money with little money I have now?", "665": "What are the best ways to find native English speakers interested in communicating with students to improve their English as a foreign language?", "666": "How can I be a really great conversationalist?", "667": "How do I solve this K-Map?", "668": "How do I get a boy to stop following me?", "669": "How do I deescalate a situation with a dissatisfied customer in retail seeing?", "670": "What is best way to to become a good cyber security analyst?", "671": "Where can I get huge selection of floor tiles in Sydney?", "672": "Has Ancient Japan been scientifically tested?", "673": "Has Ancient Japan been scientifically tested?", "674": "I think my girlfriend will break up with me because I made her wait around. What should I tell her?", "675": "Has Ancient Japan been scientifically tested?", "676": "Has Ancient Japan been scientifically tested?", "677": "Has Ancient Japan been scientifically tested?", "678": "I'm smart but lazy and this is having a negative impact on my work and life in general. How do I motivate myself to work hard for my goals and dreams?", "679": "Has Ancient Japan been scientifically tested?", "680": "Has Ancient Japan been scientifically tested?", "681": "How do I enjoy life to the fullest in Singapore when everything is just so expensive here?", "682": "How can I earn money from Twitter?", "683": "How do you make a successful T-shirt brand?", "684": "Has Ancient Japan been scientifically tested?", "685": "Has Ancient Japan been scientifically tested?", "686": "Has Ancient Japan been scientifically tested?", "687": "How do I deal with random erections?", "688": "How can I become a witch?", "689": "How do you know if someone has blocked you on FaceTime?", "690": "How do you incorporate a startup?", "691": "How do I send one email to all of my Google contacts at one time?", "692": "What exactly is done in Cognizant Google AdWords process?", "693": "How teens are able to get more than 10k Instagram followers so fast?", "694": "Where can I download the Marvel Unlimited app?", "695": "How do I scan the Snapchat QR code?", "696": "How do you say \"Austrian Army\" in Austrian German?", "697": "How do I enter color codes in excel?", "698": "Has Ancient Japan been scientifically tested?", "699": "I have made my girlfriend angry. What can I do to bring things back to normal?", "700": "How do I get my woman back?", "701": "I blocked someone on IG to get them to unfollow me. I unblocked them after. Through a friends IG account, I saw that he/she is still following me.How?", "702": "How do you get the sapphire in Pokemon Fire Red?", "703": "How do I implement design patterns in Java?", "704": "Has Ancient Japan been scientifically tested?", "705": "How can you get rid of mosquitos in your house?", "706": "How can one make money from home?", "707": "How difficult is it to get into IIT?", "708": "How do I select multiple values from drop down list in jquery and insert them into the database?", "709": "Found out my iq is 160. What now?", "710": "How exactly can I calculate my monthly salary in India if I know my CTC and the split-ups?", "711": "How can I make women go crazy over me?", "712": "Has Ancient Japan been scientifically tested?", "713": "How do I compare two stress strain curves?", "714": "Has Ancient Japan been scientifically tested?", "715": "How do I avoid becoming the kid who sits alone at lunch in school?", "716": "Has Ancient Japan been scientifically tested?", "717": "Has Ancient Japan been scientifically tested?", "718": "How do I change my clan name on Clash of Clans?", "719": "How can I speak English like natives?", "720": "How can we find Whirlpool Service Center in Hyderabad?", "721": "Has Ancient Japan been scientifically tested?", "722": "How can I tell if someone likes me or is just being nice to me?", "723": "Has Ancient Japan been scientifically tested?", "724": "How do I increase my grasping and concentration levels?", "725": "Why do I feel sleepy while studying?", "726": "What is the best path I should take to improve my English?", "727": "Has Ancient Japan been scientifically tested?", "728": "Has Ancient Japan been scientifically tested?", "729": "Has Ancient Japan been scientifically tested?", "730": "How do you activate a Twitter account?", "731": "How do I access Pondicherry's land records online?", "732": "How do I master a song with clear and loud sound in FL Studio?", "733": "Has Ancient Japan been scientifically tested?", "734": "What should I think and do while meditating? How long should I meditate? How do I concentrate better? How do I deal with distractions?", "735": "Has Ancient Japan been scientifically tested?", "736": "Has Ancient Japan been scientifically tested?", "737": "How do I sell photos on the Internet?", "738": "How do I find people I know on Quora?", "739": "Has Ancient Japan been scientifically tested?", "740": "What should I use in my bedroom instead of cityscapes?", "741": "I'm terribly afraid of my future. What should I do?", "742": "How can I delete downloaded files on Wynk?", "743": "What do you do if you have friends that are friends with your bullies?", "744": "What can I blog about?", "745": "Is there any way I can calculate the expectancy of my life?", "746": "Has Ancient Japan been scientifically tested?", "747": "How do I become good enough for a guy?", "748": "Has Ancient Japan been scientifically tested?", "749": "Has Ancient Japan been scientifically tested?", "750": "Where can I get very professional painting service in North Sydney?", "751": "Anyone can click on the View Source of my webpage and know that I use WordPress. Is there a way I can hide this?", "752": "How do I install Ubuntu alongside Windows 10?", "753": "What if btech complete in 5 years can stiil get in gre?", "754": "Has Ancient Japan been scientifically tested?", "755": "Has Ancient Japan been scientifically tested?", "756": "How can I improve my communication effectively?", "757": "How can you troubleshoot a router that doesn't connect to the internet?", "758": "How does a reverse osmosis water purifier work?", "759": "I tried uploading a 2 - 3 second video on instagram but it says that the video is too short. Why won't instagram let me upload the video?", "760": "Has Ancient Japan been scientifically tested?", "761": "How do you find timeshare presentations?", "762": "How can storch infections be cured?", "763": "How do I get real Twitter followers for free?", "764": "If I want to start college in spring 2018, when should I apply?", "765": "How do you take a screenshot on a HTC One?", "766": "I am planning to visit Ooty with my Girlfreind from Coimbatore, suggest me to plan the trip?", "767": "How can I make time-series predictions based on historical data? Any Algorithms or Methods?", "768": "What are some home remedies for dry scalp?", "769": "How can I be a more productive teenager?", "770": "How do I prepare for the video synthesis round in Mu Sigma recruitment?", "771": "In the past few days I've felt frustrated. I feel I am wasting my time away using the internet. How can I better spend my time?", "772": "Instagram (product): Why can't I comment on a certain person's photos or like them?", "773": "What can you do with a marine biology degree?", "774": "What is the easiest way to find the oxidation number of a compound?", "775": "I currently work for a BPO and I have plans for further studies. I want to pursue an MBA in a reputed university. What are my chances?", "776": "Is there a way to save the results of a query to an HTML document from within MySQL?", "777": "What are the best techniques to learn car driving?", "778": "Has Ancient Japan been scientifically tested?", "779": "How much money can you make from youtube if you have 900,000 views and 1,800 subscribers?", "780": "How can we find happiness in our life?", "781": "How I use 4G network sim on my 3G mobile?", "782": "How can I sell my ideas to entrepreneurs?", "783": "Where NOT to store prescription drugs?", "784": "How can I find surveillance bugs in my home?", "785": "Has Ancient Japan been scientifically tested?", "786": "How do I prepare for UPSC 2018?", "787": "I have begun teaching myself a new language. I am afraid that after a month or two, my enthusiasm will fizzle out and I'll start slacking off. How can I keep myself motivated to stick with this endeavor?", "788": "Has Ancient Japan been scientifically tested?", "789": "What will I be doing as an internship analyst at Goldman Sachs?", "790": "How can I stop being scared of rejection?", "791": "I swim for one hour daily outdoors. My skin feels dry and also dark after swimming. What should I do before and after swimming?", "792": "Has Ancient Japan been scientifically tested?", "793": "How do you recover your Spotify username?", "794": "What should I definitely not do in the Netherlands?", "795": "How should I prepare for GD and PI?", "796": "Has Ancient Japan been scientifically tested?", "797": "Has Ancient Japan been scientifically tested?", "798": "Has Ancient Japan been scientifically tested?", "799": "How do you clean a lint brush?", "800": "How can I hack bank?", "801": "Has Ancient Japan been scientifically tested?", "802": "Has Ancient Japan been scientifically tested?", "803": "How can I make a Quora account?", "804": "Has Ancient Japan been scientifically tested?", "805": "How can I remove cement water stains from a car?", "806": "Has Ancient Japan been scientifically tested?", "807": "Has Ancient Japan been scientifically tested?", "808": "Has Ancient Japan been scientifically tested?", "809": "How do I start for a Gigolo?", "810": "Has Ancient Japan been scientifically tested?", "811": "How can I find a course for learning Java?", "812": "Has Ancient Japan been scientifically tested?", "813": "How do I extract \"following\" data on Twitter to Google docs or csv file?", "814": "What is the best way to add a pulsating ripple to a vector in after effects?", "815": "How can I know the IP address of a person on Facebook?", "816": "Has Ancient Japan been scientifically tested?", "817": "I got 55 lollies for Halloween! What do I do with them?", "818": "Has Ancient Japan been scientifically tested?", "819": "How do I make some money without a starting capital?", "820": "How do I find a friend who can teach me English and I would teach him/her Chinese?", "821": "How does wifi work in airplanes?", "822": "How should a boy actually reply when a girl says, \"Hmmm\"?", "823": "How do I get contact details of CEOs?", "824": "Has Ancient Japan been scientifically tested?", "825": "Has Ancient Japan been scientifically tested?", "826": "Has Ancient Japan been scientifically tested?", "827": "How can I Study Without Getting Bored?", "828": "How should I talk to this girl in my college lecture class?", "829": "How do I view tables on SQL database?", "830": "Why can't I speak English well, even though I have studied it for 11 years?", "831": "Why don't I feel secure in my relationship?", "832": "Has Ancient Japan been scientifically tested?", "833": "How can you make friends with people?", "834": "Has Ancient Japan been scientifically tested?", "835": "What is the best way to make simple app on android?", "836": "Has Ancient Japan been scientifically tested?", "837": "What are the certain steps to follow for a successful startup? I know absolutely nothing.", "838": "Has Ancient Japan been scientifically tested?", "839": "How can I watch Hindi movie Hummshakals?", "840": "Has Ancient Japan been scientifically tested?", "841": "How does Gmail's \"count\" algorithm work?", "842": "Has Ancient Japan been scientifically tested?", "843": "What should I do if my mother says I am the cause of her depression?", "844": "Has Ancient Japan been scientifically tested?", "845": "Has Ancient Japan been scientifically tested?", "846": "What can I do to improve my pronunciation (english)?", "847": "How do I find freelance jobs in Dubai?", "848": "How do you delete contacts in Instagram?", "849": "How do you evaluate [math]\\int_0^1\\frac{x-1}{\\ln x}\\, dx[/math]?", "850": "How do I get people to comment on my blog? I have tried all I can but nothing. What is the solution?", "851": "How can I get back my deleted whatsapp messages?", "852": "How can we produce electricity from plastic?", "853": "Has Ancient Japan been scientifically tested?", "854": "How do I browse Quora?", "855": "Has Ancient Japan been scientifically tested?", "856": "How can you grow your hair faster in a short period of time?", "857": "How do you get rid of the smell of fish in your home?", "858": "How do you simplify Boolean expressions on a calculator?", "859": "Has Ancient Japan been scientifically tested?", "860": "Has Ancient Japan been scientifically tested?", "861": "Has Ancient Japan been scientifically tested?", "862": "What would make my hot water faucet suddenly start groaning and running just a trickle unless I open it a full turn?", "863": "What should I do when I see my ex accidently?", "864": "How do I start preparing for GATE 2017 ME?", "865": "Where does one apply to feature in commercials in NYC area?", "866": "How do you remove a mole with apple cider vinegar?", "867": "Has Ancient Japan been scientifically tested?", "868": "How can one open a coffee shop in Amsterdam?", "869": "How can I learn to like chess more?", "870": "Has Ancient Japan been scientifically tested?", "871": "Why can't I upload a photo to my profile on Quora?", "872": "I am a 2nd year CSE student - how do I improve my coding skills?", "873": "How can I earn more credits on Quora?", "874": "How do I talk to my dead dad?", "875": "How do you keep motivated to lose weight?", "876": "How do you wash a baseball cap?", "877": "Has Ancient Japan been scientifically tested?", "878": "Has Ancient Japan been scientifically tested?", "879": "Has Ancient Japan been scientifically tested?", "880": "How can I test my real intelligence and do a reality check on myself before aiming too high in life?", "881": "Has Ancient Japan been scientifically tested?", "882": "How do I reduce the action on an acoustic guitar?", "883": "Has Ancient Japan been scientifically tested?", "884": "What is the best way to learn electronics for a computer engineer?", "885": "How do I get rid of splinters in my foot?", "886": "How clutches work?", "887": "When ever I add 4th ram windows gives me a bsod memory_management error. Any solution?", "888": "How does one remove the consumer complaints from Google?", "889": "Has Ancient Japan been scientifically tested?", "890": "I am an electrical student. I'm interested in app designing and start a new Android app. But I don't have a basic idea of programming languages. What should I do?", "891": "How do I register a food tech startup in India (Hyderabad)? What would be the cost?", "892": "How can I choose between my dad and my mom?", "893": "How do I deal with emotionally abusive and narrow minded parents?", "894": "How do I get calls for my tech support?", "895": "Has Ancient Japan been scientifically tested?", "896": "Why do I feel very lonely?", "897": "What is the best way to learn HTML?", "898": "What's a good workout routine I can do without weights?", "899": "What is the best response for tantrums, my kids cries for things they want as a response I raise my voice and I get very upset?", "900": "Has Ancient Japan been scientifically tested?", "901": "How do I properly install a VS Code with proper output results of any program? I am getting errors and no output. I am learning C language.", "902": "How do I increase SEO?", "903": "Has Ancient Japan been scientifically tested?", "904": "Has Ancient Japan been scientifically tested?", "905": "Has Ancient Japan been scientifically tested?", "906": "Has Ancient Japan been scientifically tested?", "907": "How can I be in a rescue team for a natural disasters in India?", "908": "How do I write a good provisional patent application?", "909": "Has Ancient Japan been scientifically tested?", "910": "Has Ancient Japan been scientifically tested?", "911": "How do you delete someone you are following on instagram?", "912": "Has Ancient Japan been scientifically tested?", "913": "Who can give me some advices to practice speaking English?", "914": "My Dell Inspiron 3000 series laptop has Nvidia GeForce 820m GC, 1TB HDD, 8GBDDR3 memory, Intel Core i5. Works very slow, any solution to fix it?", "915": "Has Ancient Japan been scientifically tested?", "916": "What should I do to become a professional tennis player?", "917": "Has Ancient Japan been scientifically tested?", "918": "Has Ancient Japan been scientifically tested?", "919": "Has Ancient Japan been scientifically tested?", "920": "Has Ancient Japan been scientifically tested?", "921": "How should I plan to complete my 11th and 12th portion for NEET 2017?", "922": "What should I do after my btech ece?", "923": "I want to help make America a gun-free society. What steps do I take?", "924": "How we can erase a memory?", "925": "My face, forearms and neck are darker than the rest of my body. What should I do to make it return to its original colour?", "926": "Can I pursue chess along with my engineering? What does one require to be a Grandmaster?", "927": "Has Ancient Japan been scientifically tested?", "928": "How do I stop my girlfriend from talking to the guy who had verbally abused her?", "929": "Is there a way to convert an audio file (mp3 or wav) to a MIDI file?", "930": "How do I to improve English skills everyday?", "931": "How can I improve my spoken english, what are some good resources which I can use?", "932": "Has Ancient Japan been scientifically tested?", "933": "How do I cope with fear of marriage?", "934": "How do you start your new Android project?", "935": "Has Ancient Japan been scientifically tested?", "936": "How do I stop my Pit Bull/English Bulldog mix from biting my shoes?", "937": "How do I get a stronger wifi signal from my neighbor after he agrees it's OK to use it?", "938": "I feel like committing suicide. What should I do?", "939": "Has Ancient Japan been scientifically tested?", "940": "I have made a bad habit of going 5-7 minutes late in my mid or semester exams thinking that having just a look at the notes can have a large impact but instead I forget things in the exam. I know this is wrong but it happens every time even if I try to avoid it. How should I cope with this anxiety?", "941": "Why is my brain so weak?", "942": "I have no desire to do anything. I don't enjoy my life at all. I am not depressed, but I just don't want to do anything. What do I do to regain myself?", "943": "Has Ancient Japan been scientifically tested?", "944": "How does an INFJ deal with loneliness?", "945": "Has Ancient Japan been scientifically tested?", "946": "Has Ancient Japan been scientifically tested?", "947": "Has Ancient Japan been scientifically tested?", "948": "How does the Happn app know where my location is when the app is closed on iOS?", "949": "How do I factorize this equation?", "950": "What are the licenses required to start an online grocery store without a warehouse?", "951": "How do burn blisters get popped by themselves?", "952": "Has Ancient Japan been scientifically tested?", "953": "Has Ancient Japan been scientifically tested?", "954": "How can a fresh graduate in instrumentation find an entry level job?", "955": "Has Ancient Japan been scientifically tested?", "956": "Has Ancient Japan been scientifically tested?", "957": "Has Ancient Japan been scientifically tested?", "958": "Has Ancient Japan been scientifically tested?", "959": "How much should I bid for a promoted Tweet?", "960": "How does one beat a marijuana drug test?", "961": "How can I contact Warner Bros. in their China division?", "962": "Has Ancient Japan been scientifically tested?", "963": "How can we send a WhatsApp message in bulk for free?", "964": "What is a good way to make friends? Read the details", "965": "How do I self learn LaTeX document preparation system software?", "966": "How can I do the impossible?", "967": "Has Ancient Japan been scientifically tested?", "968": "What can I do to have a better chance of getting accepted into an Ivy League school?", "969": "How do I wear a black shirt with brown shoes?", "970": "What softwares can I use to learn how to use Corel Draw?", "971": "Has Ancient Japan been scientifically tested?", "972": "Has Ancient Japan been scientifically tested?", "973": "What are some tips on making it through the job interview process at Alexander's?", "974": "I am a transfer student and made up a lie so that I wouldn’t have to go eat lunch with other students, but they found out. Any suggestions?", "975": "Has Ancient Japan been scientifically tested?", "976": "How do I motivate myself to study for exams?", "977": "Has Ancient Japan been scientifically tested?", "978": "When I copy the summary in my register by understanding it then I feel like I am forgetting it, so what should I do to make it learn confidently?", "979": "What is the best way to compete with Uber?", "980": "How can I book tatkal ticket from Mangalore to Thiruvanathapuram?", "981": "How do you use logarithmic tables?", "982": "How do I erase all my answers and question on Quora?", "983": "I am working in a freight forwarder in Peru. I sell freights for import and export. I don't have customers. How could I increase my sales?", "984": "Has Ancient Japan been scientifically tested?", "985": "What should I do if I'm in love with someone 5 years older than me?", "986": "Is there a way for me to temporarily disable my Quora account?", "987": "How should I overcome anxiety and depression?", "988": "Can anyone help me solve the error in this C Program?", "989": "How do you lose fat around your stomach?", "990": "Has Ancient Japan been scientifically tested?", "991": "Has Ancient Japan been scientifically tested?", "992": "What are tips and hacks for new ride-sharing drivers in Manhattan?", "993": "I'm 24 years old, is it too late to learn music? How can I know if I'm talented or not?", "994": "Has Ancient Japan been scientifically tested?", "995": "Has Ancient Japan been scientifically tested?", "996": "How can I make sure that sites I have found on the Deep Web are reliable?", "997": "How can I get an internship at Berkshire Hathaway?", "998": "Is there a way to find out who blocked me on Instagram?", "999": "Has Ancient Japan been scientifically tested?"}