{"0": "What is the answer to this IQ test?", "1": "How do backpackers eat while living an adventurous lifestyle? Do you guys consider your diet to be healthy?", "2": "Why has not NASA or other countries sent human to the moon again?", "3": "Why didn't the Muslim rulers of India invest in establishing universities in the subcontinent?", "4": "Where does Bugzilla store attachments?", "5": "What happens in the US if you are ill and don't have insurance?", "6": "If 1=11, 2=22, 3=33, 4=44, 5=55, 6=66, 7=77, then 11=?", "7": "What is the climate of California's coastal regions, and how does it compare to the climate in Tennessee?", "8": "We can very well smell our own fart and BO. How is it that we are so oblivious to the exact smell of our own breath?", "9": "How does electricity conduct?", "10": "How does investing in stocks provide a hedge against inflation?", "11": "Why do I fear when I am happy?", "12": "What is Binaural Beats?", "13": "What would happen if India qualifies for the FIFA World Cup?", "14": "What is the difference between any PGPs (PGDM, PGDBM etc.) and an MBA?", "15": "How do martial artists make a living?", "16": "Why is Chhath Puja celebrated?", "17": "Have any of you observed the Valak hints in Ed and Lorraine's house? During the breakfast scene and the scene where Judy sees the Nun in their house.", "18": "How logical is it that Indian Railways would charge Rs 1 per kilometer in sleeper class?", "19": "Why does the US both import and export oil?", "20": "How many algorithms is a humanoid robot using and what is responsibility of each of them?", "21": "How difficult is rocket science? Almost all difficulties are related to rocket science, so how difficult is it, really.", "22": "What is Hope?", "23": "What is San Francisco and where do we find it in U.S?", "24": "What is negotiable instruments act?", "25": "When Darth Vader isn't out killing Jedi or squashing rebellions what does he do with his free time?", "26": "What is your review of MS Dhoni: The untold story?", "27": "Why don't all cars honk the moment you lock them remotely?", "28": "When castes are based on one's occupation, why it has become birth-based?", "29": "What problems do people face?", "30": "What is the English word for the Tagalog word “kinikilig”?", "31": "What kind of love?", "32": "Why did Rangers sack Scot Symon?", "33": "Who is Sayed Khalid Faredie?", "34": "How does Google's new NOCAPTCHA reCAPTCHA work?", "35": "How do pure atheists know what is right from wrong? In other words, what is their moral compass?", "36": "What will happen in a relationship where both partners are narcissist or where they both have narcissistic tendencies?", "37": "Why are the friends who liked my Facebook page showing up in the Likes list?", "38": "Why do college students drink?", "39": "In what ways does the president check the powers of the U.S. Congress?", "40": "How much do you love your brother and why?", "41": "Where is LNMIIT located in Jaipur?", "42": "What are stars made out of?", "43": "How is the formula for strontium dichromate determined?", "44": "What is the difference between mutually exclusive and independent events?", "45": "Why are eggs so expensive?", "46": "When was the first train invented? What impact did this invention have?", "47": "How would the 2016 US Presidential elections have been different if Bernie Sanders was the Democratic nominee?", "48": "Out of boron and berilliyum, which has higher ionisation enthalpy and why?", "49": "P is a prime and m is a positive integer. How many solutions exist for the equation p^6-p= (m^2+m+6) (p-1)?", "50": "How is angular momentum conserved?", "51": "Why is glow in the dark always green?", "52": "What is the product of the reaction of cumene with KMno4? How do I predict the product?", "53": "What is the reaction between sulfuric acid and sodium nitrate?", "54": "What does it mean for a video to have 'high production value'?", "55": "How do converging and diverging mirrors compare and contrast?", "56": "What is the CHEMISTRY aspect of Ambien CR?", "57": "Why is a 2 wheeler exempt from paying tolls in India?", "58": "How do avalanche beacons work? When are they used?", "59": "Why are General Assembly development courses so expensive?", "60": "What are some of the uses of titanium?", "61": "How does internet actually work?", "62": "What does the Arabic text mean?", "63": "Which scenario would make an average American Jew to live in Israel?", "64": "How does a girl feel if she sees a guy masturbating?", "65": "What if there is an equal amount of antimatter and matter in the universe?", "66": "How will Trump's winning US- elections affect India?", "67": "How is ring size determined?", "68": "Why doesn't the USA ban GMOs like the rest of the developed world?", "69": "What is an IQ?", "70": "What is description of the churn data in telecom industry?", "71": "Why are reCAPTCHAs used?", "72": "How will banning the present 500/1000 notes fight black money if it can be exchanged?", "73": "Why do librarians need a master's of library science degree?", "74": "Why is marketing management so important?", "75": "Why do people make fun of Dory from Finding Nemo?", "76": "A,B and C can do a piece of work in 4,5 and 7 days respectively.They got Rs. 415 for the job.What is A's share?", "77": "What is the temperament of 6 week old English Bulldog puppies?", "78": "Why hasn't the Indian civilization been able to create more architectural masterpieces in modern times like the Taj Mahal?", "79": "Why did Carol suddenly start having problems with killing in Season 6 (Walking Dead)?", "80": "Why are initial values for the network's weights chosen randomly from interval (-1.0..1.0)?", "81": "Why didn't Lord Krishna marry Sri Radha?", "82": "Why do some stores allow extreme couponing?", "83": "If the President of the United States partner were male, what would he be called instead of first lady?", "84": "How will Brexit affect the English Premier League's revenue?", "85": "What is the Bible verse that Samuel L. Jackson says in Pulp Fiction?", "86": "Why was Google Chrome created?", "87": "The Dark Knight Rises (2012 movie): The same doctor that healed Bane was the guy that helped heal Bruce. Why wouldn't Bane free this man after gaining control of the Pit? Why would Bane take Bruce there knowing the doctor would heal him?", "88": "Why do cat lovers prefer cats and not mind dogs while dog lovers absolutely hate cats?", "89": "Why are people selfish towards people who are kind and selfless?", "90": "What are the social/political/economic/defensive reasons the United States is allies with Israel?", "91": "Given recent Uri attacks, who will win if there is a war between India and Pakistan?", "92": "What is functional programming?", "93": "What are the amazing facts about New Zealand?", "94": "What is the effect of injection delay on fuel pipe length in compression-ignition engines?", "95": "What are the advantages and disadvantages of a franchise?", "96": "How does an overactive amygdala affect the mind?", "97": "What is institutionalized deviance?", "98": "Why would someone have abs, but when relaxed; look fat?", "99": "How many ozone layers are there?", "100": "What would happen if an extremist Christian minority in a Muslim country started to systematically stage terror attacks against Muslims?", "101": "What are some signs that a parakeet has a tumor?", "102": "What are cool facts about the ocean?", "103": "What is the meaning of an actor tattoo?", "104": "What are the effects of bathing with hot water?", "105": "What are the main differences between amino acids and proteins?", "106": "What are all the possible rational zeros for f(x) =x^3+8x+6 What is 3 [f(x+2)] if f(x) =x^3+2x^2-4?", "107": "What is Arnab Goswami doing nowadays and what could be his plans for 2017?", "108": "Why is Kyrgyzstan cuisine underrated in America?", "109": "What makes a person exciting?", "110": "What makes a girl to fall in love with a boy?", "111": "Why do successful people work so hard?", "112": "Why should we make gun owners register their guns? Does gun registration reduce violence?", "113": "What does it mean by \"leave things be\"?", "114": "What is shear stress?", "115": "What is the full story of Shiva since their birth?", "116": "How is the percentage of child support calculated in Wyoming? What factors are taken into consideration?", "117": "What are the applications of physics in real life and how it is used?", "118": "What does my Vedic Astrology chart show?", "119": "Explanation of Newton's Third law of motion?", "120": "Why do people like to answer on Quora?", "121": "What manoeuvres can BJP undertake to get the GST bill passed in the Rajya Sabha in the upcoming assembly session?", "122": "Politics of India: How do you differentiate between an article and a schedule of the Indian Constitution?", "123": "What is the effect of snorting ground-up Viagra, Cialis, etc.?", "124": "How many stories got busted on Quora while being anonymous?", "125": "What is the difference between depreciation and devaluation of an asset?", "126": "Why is everyone annoying?", "127": "What would happen if beta particles were used in Rutherford's alpha particle experiment?", "128": "Why is a Razor Edge Pitbull so expensive?", "129": "As many of the Hindu rituals have scientific reasons behind them, what is the scientific reason behind the mandatory head bath for Hindu women after the 4th day of menstruation?", "130": "What is going to happen with gold prices in India?", "131": "Why is incest considered taboo in our society?", "132": "What are the differences between supermarket and hypermarket?", "133": "How much of a hassle is it to be in a relationship?", "134": "Why don't people answer me on Quora?", "135": "Why aren't black people eliminated or deported from America for committing so many crime?", "136": "Why are so many refugees young men?", "137": "Relationship between Turbochargers, Francis Turbine and Centrifugal Pumps?", "138": "What is the difference between artificial intelligence and neural networks?", "139": "What are the uses of chemistry in pharmacy?", "140": "How could Christianity have avoided schism?", "141": "What design and structural factors make a building more 'earthquake-safe' -- rather than less so?", "142": "What do Sunni people think about Shia and Wahhabi people?", "143": "What are the new features included in iPhone 7?", "144": "Who is owner of www.obatampuherbal.com?", "145": "Why did the USA kill Osho? And why were they scared of him and his sannyasins?", "146": "How many Sikhs live in North Korea?", "147": "Why do people who can't afford kids make babies?", "148": "What is the output of this program? ?", "149": "What happens if you take 20 painkillers?", "150": "What are the benefits of coffee over tea and vice versa?", "151": "How is Harvard Business Review Podcast's presentation PowerPoint made?", "152": "What would it be like if someone had an IQ of 1000+?", "153": "I booked a Domestic flight ticket of Air India flight and in the passenger name,last letter was missing. How could it be rectified?", "154": "How do you say \"vegan ass\" (as in buttocks) in Latin?", "155": "What has Hillary Clinton achieved?", "156": "What is social trading?", "157": "What are some of the most prevalent Mormon stereotypes?", "158": "Why does NaCl have a higher melting point than LiCl, KCl or RbCl?", "159": "How much profit is made on a typical coffee?", "160": "How is : used in a sentence? What are some examples?", "161": "Why do people say 'I'm sorry' when someone is dead, if it's not their fault?", "162": "At the end of which movie is a woman, impaled on a sword, found by her lover, who then impales himself on the same sword?", "163": "What's the song in this video?", "164": "What is application of computer network?", "165": "Why do Muslim women wear the burqa?", "166": "What is subnetting on your network?", "167": "What causes unemployment?", "168": "What is the Buffalo Wild Wings Blazin' Challenge?", "169": "Why indians never properly appreciate Works of Chanakya?", "170": "I have found this turtle. What kind of turtle is it?", "171": "Why are there no beauty pageants for men?", "172": "Who is the labour minister of india?", "173": "What does \"I always considered your feelings for your best interest. I wonder if you ever considered how I even feel about things, because you don't #needmesomealonetime\" mean?", "174": "What is the difference between a salient pole and a cylindrical pole rotor?", "175": "What are the differences between project management and business management?", "176": "Why is not tipping unfair in US?", "177": "What was it like to anchoring The Kaun Banega Crorepati Show by Vijay Raaz?", "178": "Why there is always war between India and Pakistan?", "179": "How does Hillary Clinton plan to tackle campaign finance reform?", "180": "What is your review of www.justmop.com?", "181": "What is the algorithm behind Facebook's People You May Know?", "182": "Why would a startup CEO choose to work with Michael Moritz over Roelof Botha, or Roelof Botha over Michael Moritz?", "183": "Why can't some people form emotional attachments with anyone?", "184": "How important is adrenaline during depression?", "185": "What is Hillary's policy on Africa?", "186": "What causes your feet to smell like ammonia?", "187": "What is the importance of education to the United States and how are their views of education different from Canada's?", "188": "Why do some Nepali people look like the Chinese?", "189": "What is the role ofIndo-Israel relationship in favour of India?", "190": "What is 'Khejarli Mela' and what happens there?", "191": "Why does Indiape PM Modi pay many to delete all true & factual comments on Indiape in Quora?", "192": "What is the tessellation of equilateral triangles?", "193": "Who is Rahul Gandhi? What should I know about him? What would happen if he becomes Prime Minister of India in future?", "194": "Why is the tomato considered a fruit?", "195": "What is load chat for 100w solar panel?", "196": "What really made Japan a victim of the first ever atomic bomb attack in 1945?", "197": "Why surgical masks have a blue and white side?", "198": "What is the meaning of medical symbol?", "199": "What is the Periscope app? What is it used for?", "200": "What does \"added using quick-add\" mean on Snapchat?", "201": "What will happen if the core of Earth solidifies?", "202": "What is the function of a guard cell?", "203": "Why animals should not be kept in zoos?", "204": "Why is the windmill problem (IMO 2011) considered difficult?", "205": "What's your take on relation of Modi and Yoga?", "206": "If energy cannot be destroyed then where do energy goes from blackhole?", "207": "What was it like to lose your virginity?", "208": "What is your review of Narcos Season 2?", "209": "Why did human beings become more and more intelligent via evolution, but other animals didn't?", "210": "What is Hawking radiation?", "211": "What is the difference between mirin and rice wine?", "212": "What is the use of @ in PHP?", "213": "What is the scope of animation in Tamilnadu?", "214": "How did China became a manufacturing powerhouse?", "215": "What's the purpose of life? What is life actually about?", "216": "How many people from India and are in Quora sign in Hindi ?", "217": "What are the major foreign policy issues that Mexico is working on in 2016?", "218": "Why do people always assume that Asians are smart and good at math?", "219": "Why does this deodorant makes me sweat?", "220": "Why is my blood dark red?", "221": "What was the voting age of US citizens during the Vietnam War?", "222": "What are the transaction fees for swiping debit or credit card outside India?", "223": "What would happen if world suddenly went vegetarian?", "224": "Why does a guy avoid a girl that he likes?", "225": "How does she manage her life so that she becomes seductive?", "226": "How did the Undertaker retire from the WWE?", "227": "Why does my Frigidaire refrigerator leak water?", "228": "How many Indian couples had pre-marital sex?", "229": "How do prokaryotes cells and eukaryotes cells differ?", "230": "How does it feel to born in a general category family in India?", "231": "Why are Instagram story viewers arranged in a certain way? It seems that every time I post, the order of the viewers is the same.", "232": "What is minimum and maximum value of an entropy?", "233": "Who is Richard Stallman?", "234": "What is your review of Cocteau Twins?", "235": "What is so great about Eminem?", "236": "Donald Trump has been elected US president. Why have the polls proven so spectacularly wrong?", "237": "Where is the authorised Royal Enfield Service Center in Guntur City?", "238": "How many gods are currently worshipped on earth?", "239": "Why does Jake Williams like the Fox?", "240": "What is difference LTE Huawei and LTE alcatel?", "241": "How do CCM and Bauer skates differ?", "242": "How does a restaurant POS works?", "243": "Why doesn't Spotify show me related songs all over the product?", "244": "Why is ranch dressing so popular?", "245": "Why would architects choose not to rename these registers? (It’s possible to rename them, but architects generally choose not to.)", "246": "How it is to be like a celebrity?", "247": "What would happen to Earth if an Earth-sized object crashed into the sun?", "248": "What are examples of sentences with the word \"chastisement\"?", "249": "What do you think of the hacker group Anonymous?", "250": "What happens during the cell cycle?", "251": "What is a qualitative wedding dress dropshipper (from china)?", "252": "What is the difference between the word, \"grey\" and \"gray\"?", "253": "Why was it considered unsportsmanlike when Neymar Jr performed the rainbow flick against Athletic Club in the Copa Del Rey final?", "254": "What does cervical dilation look like?", "255": "The secrets of black hole?", "256": "What is Stitch Fix?", "257": "What does IQ exactly means?", "258": "Why is snooker so hard compared to watching it?", "259": "Why are there no actual Princes in the Manaphy movie at all?", "260": "What were the major contributions of the political leaders during WW1, and how are the compared to the ones during Revolution of 1830?", "261": "According to Wikipedia, the US, Canada and Australia have some of the highest greenhouse emissions per capita. Why is that?", "262": "How did Jessica Alba manage to grow The Honest Company to be valued at $1B?", "263": "How Messi is better than Cristiano Ronaldo?", "264": "Why aren't Instagram users being notified of my comments?", "265": "Why didn't Voldemort ever wondered how Harry can speak parseltongue without being an heir of Slytherin?", "266": "The differences between adverbs and adjectives.?", "267": "How will the H1-B visa process change due to a Trump presidency?", "268": "What is the full form of AAAC?", "269": "Why did Saudi Arabia Target A Doctors Without Borders Hospital In Yemen?", "270": "Why is it that we haven't been able to tap into the full potential of our brains?", "271": "What is reason behind that water droplets are on outside of cool water bottel? How that will happen?", "272": "Why do you think humankind will survive climate change?", "273": "What will living in San Francisco be like in 2020?", "274": "How powerful is imagination?", "275": "What are the superstition about itchy foreheads?", "276": "What is soil erosion? How are plants helpful in checking it?", "277": "How is it possible for sun to have more energy than Lightning?", "278": "If water is split into Hydrogen and Oxygen, how much of each gas is produced per liter of water processed?", "279": "Why do not we feel hungry when we sleep?", "280": "What is the meaning of \"come by as you are\"?", "281": "What is the boot loader in aurdino?", "282": "In what ways would the popularity of Harry Potter be affected if his name were Larry Potter instead?", "283": "What are customer service functions?", "284": "What is freezer burn? Why does it happen?", "285": "What is the basis of astrological remedies? Have they been mentioned in the ancient Vedic texts?", "286": "Why did Ahok have to collect 1 million ID cards of Jakarta citizens?", "287": "What is microevolution and what are some examples of it?", "288": "Why eyesight deteriorates faster if you start wearing glasses more?", "289": "What is Emmentaler cheese?", "290": "How can people become gays and lesbians?", "291": "What is the difference between the White House and the US Capitol Building?", "292": "What is the derivation of this formula for computing moduli of large numbers?", "293": "How should Californians vote on 2016's Proposition 66?", "294": "Why should you love yourself?", "295": "How does political bias in media affect the audience?", "296": "What is the necessary condition for a transistor to work as an amplifier?", "297": "How did Ben Y. Zhao plan his Ph.D program when he started his career as a grad student?", "298": "How might the presence of intergalactic dust as an agent for reddening and dimming the light from ever more distant galaxies affect the determination of galactic distances assuming that galaxies all have the same brightness?", "299": "Who is Shahrukh Khan of Hollywood?", "300": "What is overloding in Java?", "301": "What are seeds made of?", "302": "How is the social life of CA students?", "303": "How is viscosity-gravity constant (VGC) used?", "304": "What is my old Gmail account?", "305": "What is it like to take ketamine and opioids together?", "306": "Facts about short gitls?", "307": "What are common programming errors or \"gotchas\" in PHP?", "308": "What is the difference between segment.com and Google analytics?", "309": "How bad is the RO purified water? What is the optimum PPM level for drinking water in India?", "310": "How do Taekwondo and Karate differ from each other?", "311": "Why do most websites load slow and some dont even load when using 5ghz wifi? The internet speed is not the problem:", "312": "What is the secret behind the success of Patanjali ayurved? Or how did the rise of Patanjali took place?", "313": "What is selective pressure?", "314": "How were the names of the oceans chosen?", "315": "What would have happened if John Lennon hadn't been shot?", "316": "How is it like to be having dimples for a male person?", "317": "If God created the universe, who created God?", "318": "What does it mean when a girl says the following?", "319": "As a teacher, how would you react to a student coming out as transgender?", "320": "What is the importance of water in our body?", "321": "How many kg of steel in 1 cubic meter?", "322": "What is the difference between stress and strain?", "323": "Why is coding important?", "324": "Who designed the nun's habit?", "325": "Where is the spare tire located on a Mini Cooper?", "326": "As a woman who has had gastritis, how does it compare to menstrual cramps?", "327": "What is ratification?", "328": "Why do I wake up drenched in sweat?", "329": "Why don't women have \"urges\" when seeing a naked man?", "330": "Why do certain ferrous metals change color when they are heated? Does it have to do with heat capacities within the alloys?", "331": "What is an IRA?", "332": "What if prostitution is legal in India?", "333": "What are the differences between 2-blade and 3-blade wind turbines?", "334": "Where does the water from the Great Lakes come from, and how does these lakes wildlife compare to Mjosa?", "335": "Why are the storylines of DC comics so relentlessly dark in tone at the moment?", "336": "How are cavities on the side of my tooth caused?", "337": "What is beyond the observable universe?", "338": "What are the secrets that cricketers shared?", "339": "How could American history have turned out if JFK had not been assassinated?", "340": "Why is Trump University considered a scam and fraud?", "341": "What exactly is a break in a relationship?", "342": "What is the difference between \"splatter\" and \"spatter\"?", "343": "Who invented the bra?", "344": "Why would Mr. Modi not abolish Article 370 from Jammu and Kashmir?", "345": "Why is Mozart considered a genius?", "346": "What's the carbon footprint of solar panels? Do they need more energy to produce than what they would produce in their entire life?", "347": "Why do some people find the 24 hour time format so hard to understand?", "348": "What are the most shocking facts about the China?", "349": "What do clinical psychologists like most and least about what they do?", "350": "What is wedding photography?", "351": "What are the differences between SQL and dtsearch?", "352": "How will Donald Trump's presidency affect Europe?", "353": "TV Sitcoms: Why do English comedy shows have people laughing in the background?", "354": "How did Irene Adler fake her death and fool even Sherlock when he saw the body?", "355": "What are the colours of the rainbow? How is a rainbow formed?", "356": "What is the demand in chemical engineering?", "357": "How create zero gravity environment on the earth?", "358": "What is your review of Hackers?", "359": "What is a terrorist?", "360": "If Asian isn't a race, how can you be racist towards Asians?", "361": "When is revenge justified by the law?", "362": "How god Rama died?", "363": "Why don't women and men play chess together competitively?", "364": "Why do people name their WiFi networks \"FBI Surveillance Van\"?", "365": "What is the evolutionary advantage of curiosity?", "366": "What is a G-pen?", "367": "What is Robert Frost's job at NASA?", "368": "What are the most common traffic convictions in Arkansas, and how does the severity of the convictions differ in Idaho?", "369": "Why did Salesforce acquire Heroku?", "370": "How does Quora calculate how many views does an answer have?", "371": "Why is the number of women in IITs really low?", "372": "What were your thoughts when you first learnt that speed of light is constant irrespective of observer's velocity? Did it seem illogical? How did you finally accept it?", "373": "In 2012,India has achieved 21.9% poverty rate according to UN report but India has set the target to achieve 23.9% poverty rate until 2015.critisize?", "374": "Any examples of mathematical statements that were considered axioms until eventually proven false hundreds of years later?", "375": "What is the real estate trend in India?", "376": "What is it like to work at Directi?", "377": "What role does continental deflection play in ocean current?", "378": "Why doesn't Kejriwal just focus on his work rather than wasting time on ego clashes?", "379": "What are the most irrelevant questions you came across? Ex- do the subway drivers know that they are carrying coins on the carriages in subway surfer?", "380": "What would the world be like right now if 9/11 never happened?", "381": "How do banks make money off you?", "382": "What's the difference between the financial sponsors group and the leveraged finance group in investment banking?", "383": "Who is Rahul Gandhi?", "384": "Why are people choosing WhatsApp Messenger over Facebook Messenger? What can WhatsApp offer that Facebook Messenger does not?", "385": "Why do dogs hate skateboards and what can we do about this issue?", "386": "I understand that the reason why black objects are black is because it absorbs all the colors. Where does the absorbed light go? Can it trap light?", "387": "Why is talking to girls online always easier?", "388": "In what ways could the English language be improved?", "389": "How do I think like Facebook and Quora founder think?", "390": "What is a GoPro camera?", "391": "What is the first law of thermodynamics? What are some examples?", "392": "How are indian teenagers?", "393": "If a computer security employee hacks their office computer system and the boss catches him, should he be appreciated or punished? What are some of the reasons?", "394": "How is software design different from coding?", "395": "In my digital camera, how are 'ISO', EV+/- and ND Filter actually different?", "396": "What is the meaning of Punjabi word 'Ghaint'?", "397": "What does \"<3\" mean?", "398": "What is a reverse ATM withdrawal?", "399": "What's the significance of the three-headed dog in Harry Potter?", "400": "What fundamentally gives matter mass?", "401": "What does Germany look like, and how does its geography compare to Austria's?", "402": "Why is Americas emergency services so outdated?", "403": "What do you call a person that is born with a penis and a vagina?", "404": "What is the sum of all the integers less than 100 which leave a remainder 1 when divided by 3 and a remainder of 2 when divided by 4?", "405": "What is the temperament of a Samoyed/Golden Retriever mix?", "406": "What's the reason behind girls getting hotter during the 4 years of college?", "407": "What happens when you call a suicide hotline?", "408": "Fish: Why do mullet jump?", "409": "Why doesn't a Superman equivalent of Kevin Conroy or Mark Hamill honestly exist?", "410": "Why is homosexuality not a disease?", "411": "What did Hegel mean by \"Rational\"?", "412": "Why do men masturbate?", "413": "How could the quality of Taco Bell's meat improve?", "414": "How is the mass of sun, earth, and moon calculated?", "415": "What is a dipole moment?", "416": "What is the Data mining tools in SQL server?", "417": "Who built the Berlin Wall?", "418": "What are some good sentence examples using the word \"quip\"?", "419": "What happens when datanode fails?", "420": "How is general surgery residency in aiims…?", "421": "What is a cumulative frequency?", "422": "Which pins are the power ground on a PCI Express X1 card?", "423": "How can we relate demand and supply with diamond water paradox?", "424": "Why should I use semicolons in C language?", "425": "What is it like to live in Yakutsk Russia? I am fascinated with this place.", "426": "How does working capital affect the performance of small scale enterprise?", "427": "Why do people hate to work on a Friday?", "428": "During mobile device testing how to enter long text inputs in the text areas for testing purpose?", "429": "Why do some people feel good making fun of others?", "430": "What is the difference between Quora and Facebook?", "431": "Why do some teenage girls want to marry, divorce after a while and get alimony?", "432": "What hotel in Diphu Hill-station would be safe for unmarried couples, without the harassment of police, hotel staff, and moral police?", "433": "What is Fortunate 500 in NIT's?", "434": "How do people react when a guy says he wants to lose weight?", "435": "Why should I major in physics?", "436": "This girl called me immature instead of my cat? My cat was the immature one, why did she call me immature instead of my cat?", "437": "What is the distance between two longitudes?", "438": "Why I dream to be killed?", "439": "How would you rate Buffer as a tool for Social Media Automation? What are some of its key features?", "440": "What happened to Thomas Edison's two children?", "441": "What is the name of the United States' measurement system?", "442": "What is the difference between to and for?", "443": "Why do dogs howl in their sleep?", "444": "Why do some people become so popular on Quora?", "445": "What would happen to the U.S economy if the petroleum reserves cease to exist? (check description)", "446": "What are the family roots of the Mir family clan?", "447": "What is the purpose of force outboards on boats?", "448": "What is the number one reason not to vote for Hillary Clinton in 2016?", "449": "Kochi, Kerala, India: What is difference between Kochi and Ernakulam?", "450": "What are San Miguel Gin, Tanduay Rum, Emperador Philippine Brandy and White Castle Whiskey made of?", "451": "What are some good points to include in a racism speech?", "452": "How many children read newspapers in india?", "453": "Can you tell me about myself just by reading this sentence?", "454": "How much does the Royal Family in the UK earn?", "455": "What do billionaires do with their money?", "456": "Why does Wisconsin believe in not invoking the death penalty and why do they see this as beneficial?", "457": "Why does water taste bad after 2 days?", "458": "What might Vietnam be like today if the south won?", "459": "How is the education system for international students in croatia?", "460": "What happens to the accounts of the Vodafone/Airtel/Idea apps once the prepaid number is deactivated?", "461": "What are the myths about France?", "462": "What does \"how\" mean in the following sentence?", "463": "How do solar cells generate electricity?", "464": "How does a bird fly?", "465": "How big is the observable universe?", "466": "What’s the meaning of a probable cause?", "467": "In what ways is coconut water good for your skin?", "468": "How does a lightning arrester work?", "469": "What is the relation between Pi and size of the Universe?", "470": "What are the main reasons why students from Bradley University don't graduate on time?", "471": "How is technology changing the culture of Argentina?", "472": "What are some mind blowing facts about the game Pokémon GO?", "473": "What is the purpose of a control group in science?", "474": "The Walking Dead: Who was Negan before the apocalypse?", "475": "What is the difference between Catholicism and Roman Catholicism?", "476": "Why are Americans getting deported from India?", "477": "How is lift produced by airplanes?", "478": "How do purified and distilled water differ?", "479": "What are the pros and cons to removing a Hemmorragic kidney cyst?", "480": "What do you think Cersei felt about consequence of her actions in the finale of season 6?", "481": "What are some examples of securing the blessings of liberty?", "482": "Who is behind remote neural monitoring?", "483": "As a Christian how do you respond to the suggestion that Jesus and much of his story is just copied from older religions?", "484": "What if this life is just simulation that created by alien?", "485": "How does nightlife in Hong Kong compare to New York City?", "486": "What is the value of US dollar if backed by Gold?", "487": "What is the best way to characterize the differences between Wittgenstein's early and later thinking?", "488": "What is the difference between Intel dual core, amd dual core, Celeron dual core and Pentium dual core and which is best?", "489": "What are the main causes of personality disorders (in general)?", "490": "What is the difference in work between line management, like a finance manger, and executive management, like a director?", "491": "What is the difference between a treaty, charter, statute and convention?", "492": "How many protons, neutrons and electrons does sulfur have?", "493": "At what depth is a diving bell’s air dangerously compressed?", "494": "What are the similarities and differences between acetaminophen and ibuprofen?", "495": "We have had a Betta fish for 5 weeks and it has seemed fine until the last few days. A simplistic description is depression. The only recent change was adding glass beads to the bottom of the bowl and a plastic tree. All suggestions are welcome? Tnx!", "496": "What do you think about JKT48?", "497": "Why does a dual SIM phone have two IMEI numbers?", "498": "Why are the fans in the Sansad Bhawan rooted to the ground?", "499": "Why do dead human bodies float and living human bodies sink?", "500": "Why does my boyfriend listens to emotional love songs, can this mean something in particular?", "501": "Why is it that in photoelectric effect intensity increases no. of photoelectrons being ejected but not max kinetic energy of an electron whereas increase in frequency of incident light increases max kinetic energy of electron?", "502": "Why's watching and playing snooker different?", "503": "How did Nusrat Fateh Ali Khan trained Rahat Fateh Ali Khan?", "504": "How do Christians who admire Ayn Rand reconcile her virtue of selfishness with Jesus' teachings?", "505": "How cold can the Gobi Desert get, and how do its average temperatures compare to the ones in the Patagonian Desert?", "506": "How do you interpret ACT scores?", "507": "What are some advantages and disadvantages of jury trials compared to bench trials?", "508": "Why are some people afraid of darkness?", "509": "What are views of mnit jaipur?", "510": "What is it like to be East Asian in Vancouver?", "511": "What are signs of immaturity in personality (psychology)?", "512": "Why is geothermal energy considered a renewable resource?", "513": "What is the difference between stratified random sampling and cluster sampling?", "514": "When people say commitment and dedication for say upsc exam what exactly does it mean?", "515": "What is a guy's thought process when he friendzones an attractive girl?", "516": "What is the effect of Brexit on Pakistan’s economy?", "517": "Who do you support- Clinton or Trump? Why do you support who you do? What is bad about the other candidate?", "518": "How is the growth and life at TCS?", "519": "What do black people think of the Amish people?", "520": "What is Sensex exactly? Why does its value fluctuate?", "521": "What are some examples of prepositions and their uses?", "522": "What are the advantages and disadvantages of a coaxial cable?", "523": "What do you think about Attila the Hun?", "524": "What does \"Mocking someone on their physical appearance proves that you are mentally handicapped!\" Means?", "525": "What is the difference between two-stroke, four-stroke and six-stroke engines?", "526": "Who is buying craft supplies and where are they buying them?", "527": "What color does mixing green and blue make?", "528": "Why was the Eastern Roman Empire never able to take back the territory to its west after the Western Roman Empire fell?", "529": "Why Indian television stopped making good sitcoms.there has been practically nothing after Sarabhai vs Sarabhai?", "530": "What is Special about this Bollywood Personality Mr. Prem Nath Malhotra?", "531": "How should we mitigate anger against this racist anti-India article in The Economist?", "532": "How are the 6 mother sauces used in cooking?", "533": "What does it mean if a guy says I want you?", "534": "What will Hillary Clinton do after the election?", "535": "How did the Big Bang actually happen?", "536": "Why does my UPS package say it was delivered by my local post office?", "537": "What countries are republics?", "538": "What is the difference between 2D, 3D, and 4D movies?", "539": "What happens to our email accounts, blogs, all the online website accounts after we die?", "540": "What is a statement sentence? What are some examples?", "541": "Why are yawns contagious?", "542": "What do you think of GM?", "543": "What are the consequences for a dog that ate a frog?", "544": "Why are jet engines not used in trains?", "545": "What are some interesting facts about the ancient Vikings?", "546": "What Bullet does Nivin Pauly ride in Om Shanthi Oshana?", "547": "How many people have entirely different names, depending on the language used?", "548": "Where does the term kudos come from?", "549": "What are the major differences between Indonesia and Malaysia?", "550": "Why does the US prohibit most crude exports?", "551": "What is the steering wheel on a boat called?", "552": "What do very large prime numbers mean?", "553": "Why is that Sunglassesweekend? Is not yet well known yet", "554": "What is the difference between \"pancakes\" and \"hotcakes\"?", "555": "In the 1971 version of the film, why does Willy Wonka make quiet sarcastic comments when one of the kids is about to do something dangerous?", "556": "What is 'open-mindedness'?", "557": "What does that cut in Microsoft logo mean?", "558": "What's Jennifer Aniston's relationship like with Brad Pitt?", "559": "What are some common errors that CA Siteminder might produce?", "560": "What are the arguments in favor of, and against, the TPP?", "561": "It's apparent long distance relationships are hard, but what can a couple do to thrive and stay connected?", "562": "Why is there discrimination, inequality and hatred in the world if all humans are made of stardust, atoms, or energy? Isn't everyone equal?", "563": "How nerdy is MIT?", "564": "What is the sum of the squares of the first 20 natural numbers (1 to 20)?", "565": "Why don't seemingly big events in the Pokemon Movie affect the main series anime?", "566": "Parakeet sounds what are their meanings?", "567": "Why are motorcycles so loud?", "568": "Which religion invented the devil?", "569": "What is difference between brandy and whiskey?", "570": "Glasses and Sunglasses: What are the pros and cons of getting transition lenses?", "571": "I can't remember most of my childhood, even high-school memories are blurry. Why is this?", "572": "How do simulated diamonds and cubic zirconia differ?", "573": "How are input and output devices defined?", "574": "How can you determine the average speed of wind?", "575": "What is binomials and trinomials? What are their differences?", "576": "What does the ending of Udta Punjab mean?", "577": "What is the difference between hemoglobin and myoglobin? How are they useful?", "578": "Article 370 has failed and should be removed, What are your views?", "579": "How did Leatherface (2017 movie) get greenlit? What's the backstory of how the movie got made?", "580": "Why is power loom fabric so much cheaper than handloom when the end result is the same fabric? Or is there a difference in the quality of end product?", "581": "What is difference between communication and telecommunications?", "582": "What is an intuitive explanation of a zero-sum game?", "583": "What's the difference between 32 bit and 64 bit cpu?", "584": "What are the achievements of Hitler?", "585": "What are some examples of social justice issues in Canada?", "586": "Why are biofuels carbon neutral?", "587": "What is the difference between non-current asset and liability?", "588": "What is going to happen in Ukraine?", "589": "What's wrong with a notebook if it gets warm without the fan cooling it until it almost turns hot? fan switching between 100 and 0% speed.", "590": "What does a typical start up code for a Bare-Metal ARM Cortex-A9 processor have?", "591": "Though 'prodigal' and 'prodigy' share the same root word they seem to have different meanings. Why is that?", "592": "How friendly is a new born possum?", "593": "Where does Yuengling ship beer?", "594": "How much does navel piercing hurt?", "595": "What is the empire called for the Syriac people?", "596": "How has social media changed the world?", "597": "Why don't the Dutch play rugby?", "598": "How come traffic from Quora comes up as \"direct / none\" in my Google Analytics reports?", "599": "What are the genuine flaws in Islam?", "600": "Some people have so much money and some have barely little to survive.. poor does not have money to get food to eat.. why so much variation?", "601": "Why is it that I’m skinny but have a big stomach?", "602": "Why do people trip when tired?", "603": "Why must Apple products be so expensive if the products are littered with faults?", "604": "What is the difference between satisfaction and pleasure?", "605": "Why are the media biased against Donald Trump?", "606": "What are computer ethics? What are some of the examples of computer ethics?", "607": "What is the difference between sense of humour and presence of mind, and are they independent?", "608": "How did prophet Muhammad (pbuh) treat his wives?", "609": "What is cold heat exchanger?", "610": "Why doesn't PBS make TV shows that people want to watch?", "611": "If a line has no y-intercept, what can you say about the line? What if a line has no x-intercept? Think of a real-life situation where a graph would have no x– or y-intercept. Will what you say about the line always be true in that situation?", "612": "What is the physics behind making Tesla coils sing on pitch (like ArcAttack)?", "613": "How could Hillary Clinton win the popular vote, but still lose the election?", "614": "Why might parents yell, threaten, or spank rather than use a time out to deal with a child's constant refusals?", "615": "How do websites like The Pirate Bay avoid getting shut down?", "616": "When is your complex reaction time compromised?", "617": "What does Arnab Goswami think of himself?", "618": "What is it like to meet Salman Khan, founder of the Khan Academy?", "619": "How Indian Banks deal with bad debts from celebrities and businessman?", "620": "What would have happened if Hitler had been killed during World War I?", "621": "What do you think of gravity as an entropy issue?", "622": "For what purpose JavaScript is used?", "623": "What was marie antoinette famous for?", "624": "How strong is the evidence that even low blood lead levels cause decrements in IQ?", "625": "If you're a Trump supporter who now regrets your vote and you know Trump supporters who don't, why do you think they see it so differently from you?", "626": "What are these bumps? ", "627": "How does the Denver Colorado electrical union work?", "628": "What does a girl feel about sex?", "629": "World of Warcraft (2004 video game): What is it like to play as Warrior in World of Warcraft?", "630": "How did Varun Vasudevan score 99.96 percentile in CAT 2014?", "631": "What is the function of internet protocol?", "632": "What does a blinking folder with a question mark mean on a MacBook?", "633": "What is a table shower at a spa?", "634": "How is energy as a resource important?", "635": "What does it meant to beg for absolution?", "636": "Why do some states have no property taxes?", "637": "What is the role of a deputy architect in India?", "638": "How should be these sentences punctuated?", "639": "What is the polymer of chalk?", "640": "What would happen if a world war broke out?", "641": "Why is the demonetization of 500 and 100 rupees notes necessary?", "642": "What is cultural integration? What are some examples of cultural integration?", "643": "What do you think about Chinese students in your country?", "644": "What is the expected cut off for Neet 2016?", "645": "What is the difference between an amplifier and transistor?", "646": "What is the percentage of yadav voters in Uttar Pradesh?", "647": "What is it like to be in a house fire?", "648": "If black holes pull in all matter due to a high gravitational pull, but light has no mass and also isn't considered matter, how can black holes exist?", "649": "What if I tell you that earth is flat?", "650": "What is henry vii daughter mary?", "651": "Every informed person could ONLY vote for Trump. Why do people dont do their research on Clinton?", "652": "Why is the speed of light faster than the speed of sound?", "653": "What if Harley Quinn met Deadpool ?", "654": "What are some signs that your boyfriend really loves you?", "655": "Medicine and Healthcare: What would happen if you sliced your throat through with a knife?", "656": "What are Yoga poses to lose weight?", "657": "Why is Elon Musk worried about artificial intelligence?", "658": "What is the kingfisher beer tower cost in indore?", "659": "What are the differences between procedural law and substantive law?", "660": "What are the main differences between embedded systems and microcontrollers/microprocessors?", "661": "Why MS Dhoni retire from test?", "662": "Most of people passing government exams belong to meena or Kumar community how can this happen?", "663": "What fears or phobias does Donald Trump have?", "664": "How can there be a Jewish commandment to believe in God?", "665": "What is it like to find out by accident that you are adopted?", "666": "Former Jeopardy! Contestants: How much of your winnings did you pay in taxes?", "667": "What are the benefits of collaborative filtering?", "668": "In the movie Cast Away starring Tom Hanks, what was in the box with the angel wings, and why didn’t he open it?", "669": "I'm having trouble understanding the difference between RMSE and RSE in statistics. What is the intuition behind each? When are they each used?", "670": "What is the \"sugar baby syndrome\"?", "671": "What is the meaning of Urdu word 'Ittefaq'?", "672": "Why is Sweden the only secular Nordic country?", "673": "Why are some rich people always borrowing money?", "674": "What is GDI engine?", "675": "Why is the city of Dubai so wealthy?", "676": "Why do North Indians spend lot of money for their weddings?", "677": "Why do some people keep striving for success in their work despite having to sacrifice important aspects of their lives?", "678": "What is a \"Boolean expression\" in a C program?", "679": "Why is my belly button turning purple?", "680": "Why is the impetus of capitalists (or anyone else) to go to Mars rather than back to the Moon and establish operations there?", "681": "If less than 50% of Americans vote how does the U.S. Government maintain its power?", "682": "How can the process of evaporation be described?", "683": "What did Nietzsche mean by \"God is dead\"?", "684": "When did \"No problem\" come to mean \"You're welcome?\"", "685": "what If any and all bias was destroyed?", "686": "What role do the youth play in Indian politics?", "687": "I see myself worshiping Lord Hanuman idol in my dream in a temple. How do I interpret this?", "688": "How Many ISI agents Are located in India?", "689": "What comes to your mind when you hear the word feedback", "690": "What causes watery discharge and cramps?", "691": "What are the after effects of war on a nation?", "692": "What is self confidence?", "693": "What does mean استغفر الله العظيم?", "694": "What is the height of the governor?", "695": "What are the advantages and disadvantages of being short?", "696": "What do football fans mean when they shout, \"the referee's a wanker!\"?", "697": "If man evolved from apes, what did apes evolve from?", "698": "Why are Nissan Skylines illegal in the US?", "699": "What ingredients are in Domino's white sauce?", "700": "Narendra Modi: How was Narendra Modi in childhood?", "701": "What happens if someone vomits in a swimming pool?", "702": "What causes halitosis?", "703": "The U.S. President travels in the Air Force One. How do the cars used by him and the Secret Service travel?", "704": "What is the thick-walled inferior chamber of the heart? What function does it serve?", "705": "How many U.S. Treasury securities are there?", "706": "How is life of \"body part models\" in India?", "707": "How many years was the Mughal rule in India?", "708": "What are the advantages of doing llb?", "709": "Can anyone name the English song where a girl says \"I thought you'd never ask\"?", "710": "What does Indonesian word 'sodja' mean?", "711": "How do you singular value decomposition? How is it used for image compression?", "712": "When a guy best friend says sweetheart to you, what does it mean?", "713": "How will the ban of Rs 500 and Rs 1000 notes affect people’s lives?", "714": "Who designed dennys.com?", "715": "How much money is in Scrooge McDuck's money bin?", "716": "Why is it impossible for physicists to understand in a double slit experiment it is the dark matter that waves?", "717": "Why most celebrities are promoting Rustom and are not promoting Mohenjo daro?", "718": "How well does the VPN called Lantern work in China?", "719": "How does onal sex feels like?", "720": "How is the density of mild steel determined?", "721": "Where do scorpions fit in the food chain?", "722": "How exactly does Quip work in layman's term?", "723": "Why is satire effective? Give three reasons.", "724": "To what extent do you upvote an answer because of the writer and to what extent do you upvote an answer because of the answer itself?", "725": "What is the recipe for pickled onions?", "726": "What is the English translation of 存在即是合理的?", "727": "Why has India been implementing and dreaming of using exile Tibetans to distabolise China & seperate Tibet from China for several decades?", "728": "What's a dollar worth?", "729": "What's the difference between turnover and sales?", "730": "What are the reasons for SAARC's failure as regional organization for regional integration, economic cooperation and platform to raise common issues?", "731": "How much did Fred Astaire weigh?", "732": "What are psychological factors and what are some examples?", "733": "Why do you get lie bumps?", "734": "What is the difference between informal and formal sectors as against organised and unorganised sectors?", "735": "Why doesn't VLC use a Qt framework for GUI on Mac OS?", "736": "Why do we study the history of psychology?", "737": "What are the advantages of starting blocks?", "738": "In Farsi, how do you say \"I miss you\"?", "739": "What's the criteria to \"make America great again?\"", "740": "What is the difference between information systems and management information systems?", "741": "What is a \"paradigm shift\"?", "742": "How can a body have acceleration when its velocity is zero?", "743": "What is rationalism?", "744": "What is lingerie and garter belts?", "745": "What is a neutron star made of?", "746": "Why do women fake orgasms?", "747": "How safe is Papua New Guinea, and how does it's crime rate compare to Australia's?", "748": "Why did Western media and USA rarely released /print the picture of Vietnam aggressive reclamation in South China Sea as they did against China?", "749": "Why do men abuse some women and not others?", "750": "What is the meaning of the phrase \"in order of time\"?", "751": "A single 18 wheeler with a gas tank seems small to be filling up massive gas stations. How does this work?", "752": "United Nations: Which Countries are dominant in the UN excluding the permanent members?", "753": "What is solution engineering?", "754": "What would happen if Trump died right now?", "755": "What's the average number of answers to each question on Quora?", "756": "How do baryons generate electromagnetic waves?", "757": "How many people did the military think would be killed at Hiroshima and Nagasaki?", "758": "What do you think of the iPhone 5?", "759": "What is Gauss' law?", "760": "Why doesn't the US navy use azimuth propellers on warships?", "761": "What brand of soap and shampoo does Richard Muller use?", "762": "How is the ACLU funded? How are the funds used?", "763": "Only 3 in 10 view Hillary Clinton as honest. How did this happen? How will it impact the 2016 Presidential election?", "764": "What is a boxer mixed with a rottweiler called?", "765": "What do the lyrics to the theme song in Coraline mean?", "766": "What happened to someplacesomewhere.com?", "767": "How do you see the answers on Chegg?", "768": "What is extrinsic regulation?", "769": "For what should you consider the rest mass of an electron?", "770": "What are some interesting differences between American Sign Language and British Sign Language?", "771": "What is a domain?", "772": "What is a flowchart for finding the sum of squares of the first 20 odd numbers?", "773": "What is oral communication? What are the advantages and disadvantages?", "774": "What is the difference between 'consolidation accounting' and the 'equity method' of accounting?", "775": "What happens in the body while a girl is on her period?", "776": "What is a loan of syndicate bank?", "777": "What is it like to be in a relationship with someone you cheated with?", "778": "Why would a man put his wife before his mother?", "779": "What does being a \"catalyst for change\" mean?", "780": "How is the distribution of input important in probabilistic analysis of an algorithm? Can we always assume the input to be uniformly distributed?", "781": "Description about motorcycle cylinder blocks?", "782": "How does it feel to kill a person?", "783": "What is the first letter of a five letter word meaning fake?", "784": "How common is mental illness?", "785": "What is urban culture music?", "786": "What are some examples of sentences using the word \"cynical\"?", "787": "What if the Commonwealth of Nations became a Union/Federation?", "788": "Why did Volkswagen cheat on emissions testing when they actually have emission control devices on their cars which enable the cars to meet the required emission standards but choose to shut that off during normal driving conditions?  What benefits did they get from doing so?", "789": "What is the difference between quality control and quality assurance?", "790": "How does the INSAS rifle compare with AK-47?", "791": "What is Feviquick chemically?", "792": "Why is it difficult to swim in the very salty Dead Sea?", "793": "What do Trump supporters think of his Cabinet picks?", "794": "What is the difference between a machine and a person?", "795": "What does it mean if one dreams about baby elephants?", "796": "Why doesn't Wikipedia just run ads?", "797": "What kind of first lady will Melania Knauss-Trump be ? What will her pet projects be?", "798": "What will be the effect on Tamil Nadu after Jayalalitha's arrest?", "799": "What are the statistics on serious injuries caused in competitive boxing?", "800": "How do Gazans feel about Hamas' attacks on Israeli civilians?", "801": "Why are many murderers released from prison after a while when the innocent person they killed is gone forever?", "802": "What is white noise?", "803": "How do you calculate Rahu and Ketu?", "804": "What makes the 1980s aesthetically so unappealing, and why was it popular at the time?", "805": "How does broiler market rates are set in India?", "806": "What would the world be like if Austria had won the War of Spanish Succession?", "807": "What would happen if the earth stopped spinning suddenly for 10 seconds and then sped up instantly to full speed?", "808": "Why ISL Champions and runners are not qualified to play for AFC Cup?", "809": "What are the causes of natural disaster in 2016?", "810": "Why do most Hindu brahmins promote untouchability?", "811": "How can you see exactly how may answers a question on Quora has when it says 100+ answers?", "812": "Why don't general relativity and quantum mechanics get along well?", "813": "If someone is born in the US to parents who are not Americans, what is that person's citizenship?", "814": "What is the Jack in the Box taco meat made from?", "815": "How do people die?", "816": "Who is known as the father of electronics?", "817": "What happens when the supply frequency of a transformer increases?", "818": "Why are IIT/IIM, IIT, IIM guys so full of themselves?", "819": "What are opcodes and operands in a microprocessor?", "820": "If there are 23 pairs of chromosomes in human DNA, are there particulars as to what each chromosome pair does?", "821": "What does Google Ventures do?", "822": "What does it mean when someone says \"cross my heart and hope to die\"?", "823": "Is there any Quoran that believes that the earth is flat?", "824": "What symbols are associated to socialism? How are they determined?", "825": "Why do you use Twitter?", "826": "Why do women have sex if they don't have orgasms?", "827": "Donald Trump cites Lincoln as the father of the GOP. What would Lincoln think of Trump and the GOP that exists today?", "828": "What does it mean when a person says “goodbye” quickly, slowly, or not at all?", "829": "What are the internet restrictions in D.T.U.?", "830": "What is the reason Pakistan supports terrorism?", "831": "What is the science behind wearing rings of various gems and stones?", "832": "What would happen if the speed of light was 0?", "833": "How many countries are there?", "834": "Why are there homeless college students?", "835": "What is the chemical formula for sodium and oxygen? What are its applications?", "836": "Why will you not be my friend?", "837": "What is it like to live in Nicaragua?", "838": "Why do some of the most prosperous regions of India have an adverse sex ratio for women?", "839": "How is Americium classified?", "840": "Why do anonymous questions get more answers as compared to non-anonymous?", "841": "What do you think about the website distributorbanradial.com?", "842": "Why has Apple's brand strategy been so successful?", "843": "What is the difference between an online trading account and an investment account?", "844": "What's the Vietnam-Japan Culture exchange festival?", "845": "Why is [(-1) ^(1/2)] ^3 not equal to [(-1) ^3] ^(1/2)?", "846": "What is meant by a schema?", "847": "If you dug a hole through the earth, and came out the other side what would happen?", "848": "What are the workings of sticky mouse traps?", "849": "What are your thoughts on Child Support?", "850": "On what basis are our Indian currency notes printed? Why does the strength of the rupee vary in international markets?", "851": "How did Mozart influence the Renaissance?", "852": "How is the periodic table divided?", "853": "Why do we have to pay for medical care?", "854": "How tall is the moon monolith?", "855": "What kind of economy does the United States have compared to the one in Paraguay?", "856": "How many airports are privatized in India?", "857": "What causes depression in humans?", "858": "What do people like about Re:Zero?", "859": "What will the real estate look like now after the 500 and 1000 scraping?", "860": "Why is glass called a super-cooled liquid?", "861": "Why is my daughter so hateful?", "862": "What is the difference between socialists and communists?", "863": "What is the difference between ethical subjectivism and and ethical objectivism?", "864": "What are the chemical properties of oxygen?", "865": "What is the physical meaning of area moment?", "866": "What do airline crews see on the passenger list?", "867": "Why are porn sites deemed unsafe?", "868": "How is live running status of trains updated in India?", "869": "How do surgeons develop steady hands outside of the OR?", "870": "Why does the Quran require Muslims to pray facing Mecca even though God is omnipresent?", "871": "What is the reason behind playing national anthem before a movie in a theater?", "872": "What effect, if any, does the difference between 50 Hz and 60 Hz standards in Japan have on the functioning of electrical appliances?", "873": "How can the world be brought to peace?", "874": "What are the differences of tangible and intangible?", "875": "What classification algorithm is used in Google search?", "876": "What do you think about Modi government banning 500 & 1000 currency note from 9th November?", "877": "What's it like to not be human?", "878": "Why do I not like boys in a boyfriend way anymore (I don't like girls like that either)?", "879": "Where is sangam?", "880": "How far are we from achieving artificial general intelligence (AGI)?", "881": "Why did people vote for congress in Karnataka?", "882": "What are some sentence examples using \"colloquial\"?", "883": "Why is Indian education system so rank obsessed?", "884": "What is the brand of George Soros' cardigan?", "885": "Premiya Hanabaraha song meaning in English please?", "886": "How many people search on Google on a daily basis?", "887": "What is the etymology of the name Warcisław?", "888": "What does <> mean in programming?", "889": "Why do \"good things come in threes\"?", "890": "What exactly went wrong with Google Fiber?", "891": "What are some side effects of Herbalife products?", "892": "How are non-identical twins made? How does that differ from identical twins?", "893": "I just bought a WD Passport Ultra hard drive. It shows that USB 3.0 is compatible with USB 2.0. What does this mean?", "894": "Is there a real scientific explanation behind ghosts?", "895": "Who forged the long-form birth certificate allegedly belonging to Barack Obama?", "896": "What is the reducing agent in photosynthesis?", "897": "What is the best reason ever given for voting for a third party candidate that is certain to lose?", "898": "What is the difference between the BJP and the NDA?", "899": "What is the Farmville DAU 2016?", "900": "Why is music so important for film?", "901": "What are some mind blowing facts about the Indian Air Force?", "902": "Through where does the The Invisible Hand direct economic activity?", "903": "Why do bus drivers wait at stops even though no else is getting on or off?", "904": "Why are apples (fruit) imported in Philippines?", "905": "What language was spoken in Dacia?", "906": "Why do we need computers?", "907": "Game of Thrones Season 5 Episode 8 (Hardhome): Why was the White Walker using a wooden spear?", "908": "What are the limits of Agile and Lean in getting projects done and team work? What are the pitfalls?", "909": "Why was Quora down few minutes back?", "910": "Why did Campbell go to Peggy that night? Why did she sleep with him?", "911": "What are the yellow spots on cars?", "912": "Why do people use Quora to ask questions when Google or Wikipedia would be sufficient?", "913": "What is the process and cost for setting up a legal distilling operation in California?", "914": "What is a submersible pump? What purpose does it serve?", "915": "What would happen if the UK invaded Ireland?", "916": "What is the difference between calculus and statistics?", "917": "Why is it that humans (and many animals) have two kidneys but only one liver?", "918": "What's your opinion on the recent Delhi murder case where a girl was stabbed as she protested against eve-teasing? How could she had saved her life? Should we stop protesting now?", "919": "Why USA supports Pakistan?", "920": "What is the value of [math]\\displaystyle\\int_{0}^{\\infty} \\dfrac{x}{x^2+a^2}\\,dx [/math]?", "921": "What does it mean if a girl stares at a boy?", "922": "What is the difference between a priority queue and a queue?", "923": "What is Jensen Ackles favorite music?", "924": "What does the Focolare Movement do?", "925": "What is an F2 bond order?", "926": "Are there any subtle differences between a columbian and a Brazilian based on physical appearance? If so, what are they?", "927": "Why is no one building a Skylon?", "928": "What are the differences between Chinese and Western diet?", "929": "What is a hairstyle?", "930": "What are the direct and proxy indicators of exposure?", "931": "How do colors affect mood?", "932": "Why hasn't South Sudan signed the Non-Proliferation Treaty?", "933": "How would you describe your experience of consciousness?", "934": "What do say when someone is having a bad day?", "935": "What makes the fundamental theorem of calculus so fundamental?", "936": "What are the differences between Apache Spark and Google's Tensor Flow?", "937": "India and its strategy in foreign policy?", "938": "What happens to used motor oil?", "939": "Why does economics require calculus?", "940": "What information is stored on a black box?", "941": "What is the share market?", "942": "What instrument is this?", "943": "Why we use two flags in byte stuffing?", "944": "What do you think of these logos I made?", "945": "Which debit cards work in Neteller?", "946": "Why should one celebrate birthdays?", "947": "Who is my girlfriend?", "948": "What does ETL verified mean?", "949": "If sweating cures common cold fever, then why is sweating not a natural reaction of our body when we are down with fever?", "950": "What is it like to never know who your biological parents were?", "951": "What are the major purpose of Chhattisgarh Vidhan Sabha?", "952": "Why is Schindler's List one of the greatest movies ever made?", "953": "What's the easiest way to prove the Heisenberg uncertainty principle?", "954": "How is PDP BJP Government in Jammu and Kashmir performing?", "955": "Why do cigarettes smell so bad?", "956": "Which countries were involved in the scramble for Africa?", "957": "Who or what is Donald Trump, really?", "958": "Why do mother cats sometimes eat their own kittens?", "959": "What does code sharing means?", "960": "What does \"The sun never set on the British Empire\" mean?", "961": "How are the disabled treated by the general population in Japan?", "962": "What type of nose do I have?", "963": "How is the sound quality of fake Beats by Dre?", "964": "What is street smart?", "965": "What are the advantages of fiber optic cables?", "966": "How can one explain the unexplainable in spirituality?", "967": "Why does the BBC use such a cumbersome name to describe ISIL?", "968": "What is meant by Adjusted Net Bank Credit (ANBC) in layman terms?", "969": "What are the known causes for depression?", "970": "What is the difference between pastors, bishops, apostles, reverends, and prophets according to the Bible?", "971": "Why is the divorce rate increasing in India?", "972": "Who is the father of modern taxonomy? Why is he called the father of modern taxonomy?", "973": "What is hexavalent chromium used for?", "974": "What exactly is feedspot?", "975": "Why does subtracting the last two digits of our birth year from 114 give us our current age?", "976": "What are scalars and vectors?", "977": "Who is the India of the president?", "978": "What is the either/or logical fallacy?", "979": "What is the S3 Neo Lollipop upgrade release date?", "980": "How are East Asians seen in Spain?", "981": "What do you think about Donald Trump?", "982": "If money is not everything, why is money power?", "983": "What happens if a person overdoses on melatonin?", "984": "Where is Pebble authorised service located in India?", "985": "What is the difference between an Abstract Class and an Interface in C++?", "986": "What is a good reason to open multiple Demat accounts for trading in Indian markets?", "987": "What does it mean if I remember my dreams every night?", "988": "As a old school Pokémon gamer how do you feel about Pokémon GO?", "989": "What did Al Gore mean when he said he invented the Internet?", "990": "Why do farts sometimes stink and sometimes not?", "991": "Why do we yawn when we see others yawning or when we think of yawning?", "992": "What is lesbianism?", "993": "What is SAARC's impact on Indian economy?", "994": "When did the first movie came out, what was the art societies reaction to it?", "995": "What is your review of Muhammad Yunus?", "996": "How do you say \"the family\" in Italian?", "997": "How did Lotame expand so much?", "998": "What is a hydrocarbon? What are some example?", "999": "Why do we get pimples in our ears?"}